{
  "title": "Scoring Goals",
  "metadata": {
    "type": "counting"
  },
  "main_version": {
    "statement": "<p>In the final of a football cup the score was 5 - 2. In how many possible orders could the goals in the game be scored?</p>",
    "correct_answer": "21",
    "hint": "<p>Imagine the sequence of all goals and think about the positions in the sequence in which the second football team can have scored their 2 goals. Try to find the answer in the cases the score was 3 - 2 or 4 - 2.</p>",
    "explanation": "<p>Imagine the score was only 3 - 2. Let us think about three goals scored by the first(home) team (HHH) and two goals scored by the second (away) team (AA). We could try and list the possibilities. e.g. AAHHH would represent the first two goals scored by the away team and then the next three goals scored by the home team. All the options for the five goals are : AAHHH, AHAHH, AHHAH, AHHHA, HAAHH, HAHAH, HAHHA, HHAAH, HHAHA, HHHAA. There are 10 options in total. A way to calculate this is to think about there being 5 options for one away goal: _ <em> _ </em> _ it could be in one of any of the 5 positions (e.g. A _ <em> _ </em>) . The other away goal could be in one of the remaining 4 positions. So you would think there would be 5×4 = 20 ways of choosing where the two goals would go.   However, we have double counted, because we have included every possibility (e.g. AAHHH) twice (one goal in position 1 and the other in position 2 but also the other way around). The order in which we selected the 2 goals of the second team does not matter: we need to divide by 2. So the answer if the score was 5 - 2 is 5×4 ∕ 2 = 10. </p>\n<p>For the question of how many ways can the goals be scored if the score is 5 - 2, we can use the same logic. There are 7 possibilities to select the position for one goal; then there are 7 - 1 = 6 possibilities to select the position of the other goal (\"-1\" because one position has already been selected), therefore you get 7×6 = 42. However, the order in which you selected the 2 goals of the away team does not matter: you need to divide by 2. So we get 7×6 ∕ 2 = 21.</p>"
  },
  "extension_1": {
    "statement": "<p>In the final of a football cup the score was 6 - 2. In how many possible orders could the goals in the game be scored? </p>",
    "hint": "<p>Think about the strategy you used to answer the previous question and try to generalise it for any number of goals scored by the first team. </p>",
    "correct_answer": "28",
    "explanation": "<p>The answer is 8×7 ∕ 2=28</p>\n<p>This problem is equivalent to counting how many ways you select 2 objects (the positions of the two goals of the second team in the sequence above) from a total of n objects (the total number of positions of the goals). This is calculated by the number of <em>combinations</em> ⁿC₂=n! ∕ (2!×(n-2)!) = n×(n - 1) ∕ 2. </p>\n<p>In this formula n! = n×(n - 1)×(n - 2)×…×1</p>\n<p>You can use this to come up with the formula generalising the reasoning in the previous part: there are n possibilities to select the position of the first goal of the second team; then there are (n - 1) possibilities to select the position of the second goal of the second team (\"-1\" because one position has already been selected), therefore you get n×(n-1). However, the order in which you selected the 2 positions for the two goals in the sequence does not matter: you need to divide by 2.</p>"
  },
  "extension_2": {
    "statement": "<p>In the final of a football cup the score was 4 - 3. In how many possible orders could the goals in the game be scored?</p>",
    "hint": "<p>Think about how many goals have been scored in total. In how many positions could the first goal of the second team be scored? The second? The third?</p>",
    "correct_answer": "35",
    "explanation": "<p>If we think about the sequence of 4 + 3 = 7 goals (G₁, G₂, G₃, G₄, G₅, G₆, and G₇), then the problem is equivalent to counting how many ways you select 3 objects (the positions of the three goals of the second team in the sequence above) from a total of 7 objects (the total number of positions of the goals). There are 7 possibilities to select the position for the first goal; then there are 7 - 1 = 6 possibilities to select the position of the second goal (\"-1\" because one position has already been selected); there are 7 - 2 = 5 possibilities to select the position of the third goal (\"-2\" because two positions have already been selected). Therefore you get 7×6×5 = 210. However, the order in which you selected the 3 goals of the second team does not matter: you need to divide by the number of ways you can order the 3 goals. You have 3 ways of picking the first goal; then you have 3 - 1 = 2 ways to pick the second (\"-1\" because one goal has already been selected); there are 3 - 2 = 1 possibilities to select the third goal (\"-2\" because two goals have already been selected); therefore you get 3×2×1 = 6 ways you can order 3 goals. Finally, you can find the result by doing: 210 ∕ 6 = 35.</p>\n<p>35 is the answer to rearranging HHHHAAA, whereas 210 would be the answer to rearranging HHHHA₁A₂A₃.</p>"
  },
  "additional_information": {
    "about": "<p>Combinatorics is an area of mathematics primarily concerned with counting. Two big aspects of combinatorics are finding combinations and permutations. For combinations the order does not matter - like in our football example we didn't mind which order the away team scored the goals. For permutations the order does matter - for example there are six ways to arrange the digits 123.</p>",
    "references": [
      "<p><a href=\"https://www.mathsisfun.com/combinatorics/combinations-permutations.html\" target=\"_blank\">https://www.mathsisfun.com/combinatorics/combinations-permutations.html</a></p>",
      "<p><a href=\"https://betterexplained.com/articles/easy-permutations-and-combinations/\" target=\"_blank\">https://betterexplained.com/articles/easy-permutations-and-combinations/</a></p>"
    ]
  }
}