{
  "title": "Alphanumerics",
  "metadata": {
    "type": "puzzle"
  },
  "main_version": {
    "statement": "<p>In the sum CAR + CAT = RARE each letter represents a different digit from 0 to 9. What is the value of the word RARE?</p>",
    "correct_answer": "1510",
    "hint": "<p>What digit must the letter R represent? If you add two 3-digit numbers together, what is the largest sum you could make?</p>",
    "explanation": "<p>R must be equal to 1 since only the digit 1 can carry over from the hundreds column into the thousands column. So we now have CA1 + CAT = 1A1E.</p>\n<p>If we look at the tens column we have A + A = 1 (or ends in 1). Since A + A is even, the only way for it to end in the digit 1 is for there to be a carry over from the ones column. </p>\n<p>This gives us A = 5 or A = 0. </p>\n<p>Since we know there was a carry over from the ones column, T = 9 and hence E = 0. This means A = 5 since each letter represents a different digit. Therefore the word RARE = 1510. (Though not needed, it can be verified that C = 7). Finally we have 751 + 759 = 1510.</p>"
  },
  "extension_1": {
    "statement": "<p>In the sum TWO + TWO = FOUR each letter represents a different digit from 0 to 9. There are 7 different solutions to this sum. For these 7 solutions, what is the largest value of the word FOUR? </p>",
    "hint": "<p>Once you figured out what digit F represents, you then want to consider what the largest possible value of O could be.</p>",
    "correct_answer": "1876",
    "explanation": "<p>F must be equal to 1 since only the digit 1 can carry over from the hundreds column.</p>\n<p>We now have TWO + TWO = 1OUR.</p>\n<p>As we are trying to find the largest possible value of FOUR, we next try O = 9. Which would give TW9 + TW9 = 19UR. Then the only possibility is T = 9 but this is not allowed since O = 9, making O = T.</p>\n<p>We next try O = 8. So TW8 + TW8 = 18UR. Which leads to R = 6 and T = 9.  And we then have 9W8 + 9W8 = 18U6.</p>\n<p>We still have a choice of answers for W and U.</p>\n<p>We require W to be less than 5 to avoid carrying over into the hundreds column. If we tried W = 4, this would lead to U = 9 but this is not possible as T = 9. So we try W = 3.</p>\n<p>We end up with  938 + 938 = 1876, and so the largest possible value of the word FOUR is 1876.</p>"
  },
  "extension_2": {
    "statement": "<p>In the sum MATHS + GAMES = DECODE each letter represents a different digit from 0 to 9. What is the value of the word DECODE?</p>",
    "hint": "<p>There are 10 different letters used in this sum so each digit from 0 to 9 will be used. You will need an organised approach to solve this one. You might want to make a table of all the possibilities and then cross out any values as you eliminate them. You can start with the fact that D = 1.</p>",
    "correct_answer": "164816",
    "explanation": "<p>There are many ways to solve this puzzle. First D = 1. To continue, we must use all the given information to eliminate possibilities. For example, we observe that E must be an even digit. S cannot be equal to 0 or 1 or 5. A lot of brute force is required to work through this problem, but with a table to organise all of the information, you should be able to whittle down the possible solutions until you have reached the correct answer. T = 0, D = 1, A = 2, S = 3, C = 4, H = 5, E = 6, M = 7, O = 8, G = 9.</p>"
  },
  "additional_information": {
    "about": "<p>These types of puzzles are called 'Cryptarithms' or 'Verbal Arithmetic'. The most classic example was published in the July 1924 issue of Strand Magazine by English mathematician Henry Dudeney.  </p>\n<p>SEND + MORE = MONEY</p>\n<p>Given the potentially large number of possibilities, computer programs are often used to generate and solve these types of puzzles.</p>",
    "references": [
      "<p><a href=\"https://en.wikipedia.org/wiki/Verbal_arithmetic\" target=\"_blank\">https://en.wikipedia.org/wiki/Verbal_arithmetic</a></p>",
      "<p><a href=\"https://www.dcode.fr/cryptarithm-solver\" target=\"_blank\">https://www.dcode.fr/cryptarithm-solver</a></p>",
      "<p><a href=\"http://www.iread.it/cryptarithms.php\" target=\"_blank\">http://www.iread.it/cryptarithms.php</a></p>"
    ]
  }
}