{
  "title": "Gomoku",
  "metadata": {
    "type": "game"
  },
  "main_version": {
    "statement": "<p>Start by drawing a square grid of 15 by 15 lines. Two players take it in turns to place a counter on any point where lines cross. The player who gets five of their counters in a straight line wins. The line can be vertical, horizontal or diagonal.</p>",
    "further_instructions": "<p>This game is traditionally played with black and white counters, but you could use any different counters, or little pieces of paper. You could also draw the grid in pen and then use pencil to mark x or o for each player and then rub them out when you are finished to be able to use the grid again.</p>",
    "strategy_tips": "<p>It is very important to be watching your opponents moves as well as trying to make a line of 5 yourself. If your opponent has three in a row with nothing at either end - this is called \"open 3\" - then it is a good idea to use your turn to block one end. If they manage to get \"open 4\" you have certainly lost! A good attacking strategy might be to aim for two overlapping lines of open 3s - like a cross - so that it is very hard for your opponent to defend.</p>"
  },
  "extension_1": {
    "statement": "<p>For advanced players, the first player has a big advantage. This advantage can be removed by starting the game using the \"Swap 2\" rule. Let's say at the start of the game player one is crosses (x) and player two is circles (o).</p>\n<p>Player one begins the game by marking 3 intersections (two with x, and one with o), player two then chooses one of these three options (i) they take crosses, ending their turn (player one becomes circles and it is now their go), (ii) they stay as circles and add one circle as normal, (iii) they add two circles to the board, but then player one now gets to decide whether they want to steal circles. After this, play as normal.  </p>"
  },
  "additional_information": {
    "about": "<p>There is a World Championship tournament for Gomuku. Since 2009 it has used the Swap 2 rule to make it a fair game, no matter who starts. There are also championships for computers to play at Gomuku! So people write an artificial intelligence program and their program plays against someone else's program to see who wins. There are also computer vs. human competitions - in 2017 a computer called Yixin beat the world champion human player Rudolf Dupszki 2-0.</p>",
    "references": [
      "<p><a href=\"https://en.wikipedia.org/wiki/Gomoku\" target=\"_blank\">https://en.wikipedia.org/wiki/Gomoku</a></p>"
    ]
  }
}