{
  "title": "Mixed-up Socks",
  "metadata": {
    "type": "puzzle"
  },
  "main_version": {
    "statement": "<p>You have a pair of red socks, a pair of blue socks, a pair of yellow socks, and a pair of green socks. In how many ways can you mix them up and form new pairs so that all the new pairs are mismatched (have different colours), and none of the new mismatched pairs is the same as another new mismatched pair? </p>",
    "correct_answer": "3",
    "hint": "<p>Start with matching one of the red with one of the green, and the other red with a blue. You could write this as RB, RY. What would the other two pairs have to be? </p>",
    "explanation": "<p>You can solve this problem by listing all the options. You could have RB, RY, YG, BG or RB, RG, GY, BY or RY, RG, YB, GB. You could also solve it by thinking that, starting with the red socks, there are three different colours that the two socks could be matched with. If you choose RB and RY as the first two pairs, you can't then match BY together because that would leave GG for the last pair which isn't allowed. So once you have picked the two colours to go with red, there are no more choices to make. There are 3 ways to pick two colours from a choice of three, so the answer is 3.</p>"
  },
  "extension_1": {
    "statement": "<p>You have five pairs of socks, each a different colour (red, blue, yellow, green, orange). Mix them up and form new pairs so that all the new pairs are mismatched, and none of the new (mismatched) pairs is the same as another new (mismatched) pair. </p>\n<p>In how many ways can you mix them up and form new pairs in this way?</p>",
    "hint": "<p>Start off with the two red socks. Can you work out how many ways there are of choosing which two colours these two socks could be matched with?</p>",
    "correct_answer": "12",
    "explanation": "<p>Starting with the red socks, there are four different colours that the two socks could be matched with. If you choose RB and RY as the first two pairs, you cannot then have BY as a pair. This is because it would only leave two green and two orange socks and you can't have GG or OO and you can't have GO twice. You could match the second blue sock with green or orange. Once you choose one the other two pairs are fixed. For example RB, RY, BG then it must be OG and OY. </p>\n<p>There are 6 ways to pick two colours from a choice of four, and then 2 ways to pick one colour from a choice of two, so the answer is 6×2 = 12.</p>"
  },
  "extension_2": {
    "statement": "<p>Imagine you have a bag with 3 red marbles, a bag with 3 blue marbles, a bag with 3 green marbles, and a bag with 3 yellow ones. If the order of the bags doesn't matter, in how many ways can we mix up and sort the marbles into the 4 different bags with 3 different coloured marbles each?</p>",
    "hint": "<p>In addition to thinking about the consequences of a certain color being included in a certain bag, consider the consequence of a particular color marble not being chosen for, say, the first bag.</p>",
    "correct_answer": "1",
    "explanation": "<p>It helps in a problem such as this one to think primarily about the colour of the marble that <em>doesn't</em> get picked to be included in the first bag. Since we have four colours and bags that hold three marbles, and since we can't have two of the same colour in the same bag, there are four ways in which we can fill the first bag (think: in each possible combination, one colour gets excluded, and with four colours of marbles, there are four potential colours to exclude from the first bag. Now, what does that mean for the colour that wasn't included in the first bag. Let's refer to the three colours included in the first bag as a, b, and c. That leaves d to denote the colour that was excluded. Because we cannot have two of the same colour marble in any given bag, each of the remaining bags must contain one d marble. Now let's move on to the second bag. The second bag already has a colour d in it, and only has room for two more. There are three colours left to choose from, so we once again arrive at a situation where it's best to think in terms of what colour we are excluding. We must pick 2 marbles from a list of 3, so we must exclude 1. Whatever colour we exclude will have two remaining that must go into the two remaining bags. The colours that were included in the second bag each have one remaining to be placed inside a bag. We now arrive at the third bag, which already has a marble of the colour excluded from the first bag, and a marble of the colour excluded from the second. We then have two options to pick from, and the one we don't pick will go into the fourth bag, whose makeup will already be decided. We thus have 4×3×2×1 = 24 ways of placing the marbles into the four bags. Because the order of the bags doesn't matter, we must divide this number by the number of ways that four bags can be ordered, which is equal to 4×3×2×1 = 24. We thus get 24 / 24 = 1.</p>"
  },
  "additional_information": {
    "about": "<p>For four different pairs of socks, if they were loose in a drawer and you shut your eyes and matched them together at random there would be a 1% chance of matching them perfectly and a 46% chance of matching them completely wrongly as in the puzzle.</p>",
    "references": [
      "<p><a href=\"https://nrich.maths.org/166\" target=\"_blank\">https://nrich.maths.org/166</a></p>"
    ]
  }
}