{
  "title": "Prime Removal",
  "metadata": {
    "type": "funfact"
  },
  "main_version": {
    "statement": "<p>73939133 is the largest prime number that, if you keep removing digits from the right, will always leave a prime number.</p>",
    "hint": "<p>If you take away the last digit the number would be 7393913, which is a prime number. Keep going ...</p>",
    "explanation": "<p>A right-truncatable prime is a prime number that remains a prime when you successively remove the last digit. We can look for the biggest right-truncatable prime by starting with the one digit primes 2, 3, 5, and 7. Then try to add another digit to the right of these so that the new numbers are also prime. We could have 23, 29, 31, 37, 53, 59, 71, 73, and 79. Now we try to add another digit. We could have 233, 239, 293, 311, 313, 317, 373, 379, 593, 599, 719, 733, 739, and 797. If we keep going with this process we end up with these eight digit numbers 23399339, 29399999, 37337999, 59393339, and 73939133. There are no nine digit prime numbers that start with any of these eight digits so the biggest right-truncatable number is 73939133.</p>"
  },
  "extension_1": {
    "statement": "<p>A left-truncatable prime is a prime number that remains a prime when you successively remove the first digit. E.g. 137 is a prime number, so is 37 and so is 7 so 137 is a left-truncatable prime. The biggest one is 357686312646216567629137. There are eleven 2 digit ones, can you find them all? Can you find more 3 digit ones?</p>",
    "hint": "<p>23 is the first one because 23 and 3 are both prime numbers.</p>",
    "explanation": "<p>The two digit left-truncatable primes are: 13, 17, 23, 37, 43, 47, 53, 67, 73, 83, 97</p>\n<p>The three digit left-truncatable primes are: 113, 137, 167, 173, 197, 223, 283, 313, 317, 337, 347, 353, 367, 373, 383, 397, 443, 467, 523, 547, 613, 617, 643, 647, 653, 673, 683, 743, 773, 797, 823, 853, 883, 937, 947, 953, 967, 983, 997</p>"
  },
  "additional_information": {
    "about": "<p>Interestingly there are 4260 left-truncatable primes but only 83 right-truncatable primes. If you repeatedly remove the first and last digit of a prime number and it stays prime, it is called a left-and-right-truncatable prime. There are 920720315 of those!</p>",
    "references": [
      "<p><a href=\"https://en.wikipedia.org/wiki/Truncatable_prime\" target=\"_blank\">https://en.wikipedia.org/wiki/Truncatable_prime</a></p>"
    ]
  }
}