{
  "title": "Benford's Law",
  "metadata": {
    "type": "funfact"
  },
  "main_version": {
    "statement": "<p>When you look at numbers found in real-world data sets, for most sets of numbers the first digit is more often a 1 than any other digit. 2 is a more common first digit than 3, and so on up to 9. In fact, the first digits often follow the same pattern (distribution).</p>\n<p><img alt=\"\" src=\"assets/images/Benford_s_Law_image_0.png\" class=\"Benford_s_Law_image_0\" /></p>",
    "hint": "<p>Have a look at some data sets that span many orders of magnitude. For example, what are the first digits of: the first 100 prime numbers (or more!), the populations of the countries in Africa, the heights of the tallest buildings in the world?</p>",
    "explanation": "<p>Many data sets (for example, populations of countries, heights of buildings, stock prices) or famous sequences (Fibonacci numbers, prime numbers) are spread over very different scales (orders of magnitude). Many of these big sets of data arise from decreasing power laws. A simple example might be  </p>\n<p>y = k×10⁽⁻ᵃˣ⁾ where k, a &gt; 0. Choosing a = 0.1 and k = 1000 gives the following:</p>\n<p><img alt=\"\" src=\"assets/images/Benford_s_Law_image_1.png\" class=\"Benford_s_Law_image_1\" /></p>\n<p>Power laws will look like a straight line on semi-log graph paper - where the y-axis is on a log-scale paper. We can show this by rewriting our formula for the power law y = k×10⁽⁻ᵃˣ⁾ = 10ᵇ×10⁽⁻ᵃˣ⁾ = 10⁽⁻ᵃˣ⁺ᵇ⁾ , and then applying a logarithm on both sides: log₁₀(y) = - a×x + b. This is the equation when the y-axis is on a log scale. The same example is shown below:</p>\n<p><img alt=\"\" src=\"assets/images/Benford_s_Law_image_2.png\" class=\"Benford_s_Law_image_2\" /></p>\n<p>The horizontal lines represent 1, 2, 3, 4, …, 10, 20, 30, …, 100, 200, 300, … and note they are unevenly spaced on the y axis! The largest spaces are between 1 and 2, between 10 and 20, and between 100 and 200. The smallest spaces are between 9 and 10, 90 and 100.</p>\n<p>Try picking random values of x, and reading off corresponding values of y from our (power law) straight line. Because of the spacing of the horizontal lines we see that we are most likely to get a value of y with first digit 1, then we are next likely to get a value of y with a first digit 2, etc. These probabilities are what leads to Benford's Law. </p>"
  },
  "extension_1": {
    "statement": "<p>Can you think of which sets of numbers do not obey Benford's law?</p>",
    "hint": "<p>The explanation of Benford's law mentioned that the data set typically spans many orders of magnitude.</p>",
    "explanation": "<p>Anything that is within a small range, an example would be something normally distributed E.g Measure everyone's height (in metres). Almost all heights would begin with a 1.</p>"
  },
  "additional_information": {
    "about": "<p>Benford's Law is used in the real world to check for fraud on big data sets. If they don't follow the law when they should, it is possible they have been falsified!</p>",
    "references": [
      "<p><a href=\"https://brilliant.org/wiki/benfords-law/\" target=\"_blank\">https://brilliant.org/wiki/benfords-law/</a></p>",
      "<p><a href=\"https://towardsdatascience.com/what-is-benfords-law-and-why-is-it-important-for-data-science-312cb8b61048\" target=\"_blank\">https://towardsdatascience.com/what-is-benfords-law-and-why-is-it-important-for-data-science-312cb8b61048</a></p>"
    ]
  }
}