{
  "title": "Paving Paths",
  "metadata": {
    "type": "counting"
  },
  "main_version": {
    "statement": "<p>In how many different ways can you lay 6 equal paving slabs, each 2 meters by 1 meter, to make a path 2 meters wide and 6 meters long from my back door into my garden, without cutting any of the paving slabs?</p>",
    "correct_answer": "13",
    "hint": "<p>In how many different ways can you do that in case you had fewer paving slabs for a shorter path? Think about a good strategy to classify different ways. For example, how many ways can you have 2 pairs of slabs lengthwise?</p>",
    "explanation": "<p>This problem is firstly meant to make you think about a good strategy to count. You can draw all possibilities for shorter paths. However, this will soon become too lengthy. A first step towards finding an organizing principle could be classifying the paths accordingly to how many pairs of \nslabs placed lengthwise there are. Let us denote as n the number of paving slabs.\nFor n = 1, there is clearly only one possibility (no pairs); for n = 2 there are 2 possibilities (no pairs, and 1 pair); for n = 3 there are 1×(no pairs) + 2×(1 pair) = 3 ways; for n = 4 there are 1×(no pairs) + 3×(1 pair) + 1×(2 pairs)= 5. Using this strategy we can easily count n = 6: there are 1×(no pairs) + 5×(1 pair) + 6×(2 pairs) + 1×(3 pairs) = 13. Looking at the sequence 1, 2, 3, 5, 8, 13, …you might recognize the pattern!</p>"
  },
  "extension_1": {
    "statement": "<p>How many different ways can you lay the 11 paving slabs of the same type to make a path 2 meters wide and 11 meters long, without cutting any of the paving slabs?</p>",
    "hint": "<p>Counting explicitly might be too long. Can you come up with a way to reduce the problem in simpler cases you have already counted?</p>",
    "correct_answer": "144",
    "explanation": "<p>Supposing you have to lay n slabs. Let us denote as F(n) the solution of the problem for n slabs. There are two ways you can end your path: either by laying the last pair of slabs lengthwise, or by laying the last slab across. In the first case, you are free to arrange the first (n - 2) slabs as you wish to make a path of length (n - 2) meters: there are exactly F(n - 2) ways of doing this. As far as the second case is concerned, you are then free to arrange the first (n - 1) slabs as you wish to make a path of length (n - 1) meters: there are exactly F(n - 1) ways of doing this. Therefore, you find that F(n) = F(n - 1) + F(n - 2): this is the proof for the recursion relation for your sequence of numbers! By previous experiments, it should be clear that F(1) = 1 and F(2) = 2.\nWe can now build the sequence easily: each term in the sequence can be found by adding the two previous terms. We can carry it on:</p>\n<p>1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144</p>\n<p>So there are 144 ways to lay the 11 paving slabs to make the path.</p>"
  },
  "extension_2": {
    "statement": "<p>For all the paths built with a number of slabs between 1 and 30 inclusive, how many of these will have an odd number of ways of building them?</p>",
    "hint": "<p>Think about how the sequence is generated … can you find a pattern that repeats thinking about odd and even numbers?</p>",
    "correct_answer": "20",
    "explanation": "<p>For the sequence 1, 2, 3, 5, 8, 13, 21, … we can see that there is a pattern odd-even-odd, odd-even-odd, odd- etc. This makes sense as even + odd = odd and odd + odd = even. So in a sequence of 30 numbers, there are 30 ∕ 3×2= 20 odd numbers.</p>"
  },
  "additional_information": {
    "about": "<p>The sequence of numbers in this puzzle are part of the Fibonacci sequence: </p>\n<p>0, 1, 1, 2, 3, 5, 8, 13, 21, 34,... It is easy to find the next number by adding the previous two numbers, but you can also find numbers in the sequence directly using this formula:</p>\n<p><!-- LaTeX Start -->$$F_n = \\frac{1}{\\sqrt{5}}\\left[ \\left(\\frac{1+\\sqrt{5}}{2}\\right)^{n+1} - \\left(\\frac{1-\\sqrt{5}}{2}\\right)^{n+1}\\right]$$<!-- LaTeX End --><!-- Fₙ = (1 ∕ √5)×( ((1 + √5) ∕ 2)ⁿ⁺¹ - ((1 - √5) ∕ 2)ⁿ⁺¹ ) --></p>",
    "references": [
      "<p><a href=\"http://datagenetics.com/blog/june52020/index.html\" target=\"_blank\">http://datagenetics.com/blog/june52020/index.html</a></p>",
      "<p><a href=\"http://datagenetics.com/blog/october22015/index.html\" target=\"_blank\">http://datagenetics.com/blog/october22015/index.html</a></p>",
      "<p><a href=\"https://www.mathsisfun.com/numbers/fibonacci-sequence.html\" target=\"_blank\">https://www.mathsisfun.com/numbers/fibonacci-sequence.html</a></p>"
    ]
  }
}