{
  "title": "Lost cards",
  "metadata": {
    "type": "puzzle"
  },
  "main_version": {
    "statement": "<p>A small number of cards has been lost from a complete pack of 52. I deal cards to players until all have the same number of cards and some cards are left. If I deal to four players, three cards remain. If I deal to three players, two cards remain and if I deal to five players, two cards remain. How many cards are there?</p>",
    "correct_answer": "47",
    "hint": "<p>Think about remainders when dividing. If there are two left when divided amongst five people then the number must be two more than a multiple of 5, e.g. 7 or 32</p>",
    "explanation": "<p>As only a small number of cards have been lost, let us start by listing the numbers that work that are close to 52.</p>\n<p>If there were no cards remaining when dealt between four people we would know that the number of cards was in the four times table, i.e …, 36, 40, 44, 48. But there are three left over, so the number of cards must be in the sequence …, 39, 43, 47, 51.</p>\n<p>For dealing among three people with two left over we get the sequence …, 41,44,47,50</p>\n<p>For dealing among five people with two left over we get the sequence …,32, 37,42,47</p>\n<p>The number that appears on all three lists is 47.</p>\n<p>We could also solve the puzzle starting with the last two clues. There is the same number of cards leftover when dealing to three or five people, so the answer must be two more than a multiple of 15, so 17, 32 or 47. The only one of these numbers that fits with the first clue is 47.</p>"
  },
  "extension_1": {
    "statement": "<p>Some cards have been lost from a complete pack of 52. If I deal among three or four people there are always two cards remaining. How many different options are there for the number of cards remaining?</p>",
    "hint": "<p>Think about multiples of 12.</p>",
    "correct_answer": "4",
    "explanation": "<p>There must be two more than a multiple of 12, because there are two more than a multiple of 3 and two more than a multiple of 4. So there are four numbers … namely 14, 26, 38, 50.</p>"
  },
  "extension_2": {
    "statement": "<p>Some cards have been lost from a complete pack of 52. If I deal among two people there is one card remaining, and if I deal among four people there are two cards remaining. How many different options are there for the number of cards remaining?</p>",
    "hint": "<p>Think about odd and even numbers.</p>",
    "correct_answer": "0",
    "explanation": "<p>There are 0 options because it is impossible to have a number that is both one more than a multiple of 2 (must be odd) and two more than a multiple of 4 (must be even).</p>"
  },
  "additional_information": {
    "about": "<p>There is a special name for the operation of dividing by a number and finding the remainder in mathematics - it is called <strong>mod</strong>ular arithmetic. 47 mod 5 = 2 because when you divide 47 by 5 you have a remainder of 2. It is a powerful technique in mathematics to prove facts about numbers. We use it in everyday life when we tell the time with a 24 hour clock. </p>\n<p>(18 + 8) mod 24 = 2 or in other words 8 hours after 6pm is 2am! </p>",
    "references": [
      "<p><a href=\"https://betterexplained.com/articles/fun-with-modular-arithmetic/\" target=\"_blank\">https://betterexplained.com/articles/fun-with-modular-arithmetic/</a></p>"
    ]
  }
}