{
  "title": "Lychrel Numbers",
  "metadata": {
    "type": "funfact"
  },
  "main_version": {
    "statement": "<p>Take a positive integer (whole number). Reverse the digits to get a new number. Add the two numbers together. Repeat this process until you get a palindrome (a number that reads the same forwards and backwards).</p>\n<p>Can you find a starting number that doesn't end up at a palindrome? Nobody knows if this is possible.</p>",
    "hint": "<p>Pick a positive integer (whole number), e.g. 57. Reverse the digits to get 75. Adding gives 57 +75 = 132. Then reverse this new number and add together. You get 132 + 231 = 353. This is a palindrome as it reads the same forwards as backwards, so we stop. Can you find a number that takes longer to reach a palindrome? </p>",
    "explanation": "<p>Some numbers end up in a palindrome after one step, e.g. 243: 243 +342 = 585. Some take a bit longer, e.g. 87: </p>\n<p>87 + 78 = 165, </p>\n<p>165 + 561 = 726, </p>\n<p>726 + 627 = 1353, </p>\n<p>1353 + 3531 = 4884.</p>\n<p>Some numbers take a very long time – 89 takes an unusually large 24 steps (the most of any number under 10,000) to reach the palindrome 8813200023188.</p>\n<p>A number is called a Lychrel number if it never reaches a palindrome. No one has proved that a Lychrel number exists. One possibility is 196 - the first billion steps have been carried out by computers and it hasn't reached a palindrome… but this does not prove it never will!</p>"
  },
  "extension_1": {
    "statement": "<p>Can you find different 3-digit numbers that take 1, 2, 3, and 4 steps to become a palindrome?</p>",
    "hint": "<p>Most smaller 3-digit numbers take only 1 step to become a palindrome, but try using bigger digits that will mean you have to carry when you add (e.g. 8 + 9 = 17 so you will have to carry the 1).</p>",
    "explanation": "<p>There are lots of options, but 122 takes 1 step, 109 takes 2 steps, 199 takes 3 steps and 192 takes 4 steps.</p>"
  },
  "additional_information": {
    "about": "<p>If you change the base of the problem to binary then 10110 (22 in decimal) is a Lychrel number. The name Lychrel comes from a rough anagram of Wade Van Landingham's girlfriend Cheryl.</p>",
    "references": [
      "<p><a href=\"https://lycee.samicharity.co.uk/2020/02/06/lychrel-numbers/\" target=\"_blank\">https://lycee.samicharity.co.uk/2020/02/06/lychrel-numbers/</a></p>",
      "<p><a href=\"https://en.wikipedia.org/wiki/Lychrel_number#196_palindrome_quest\" target=\"_blank\">https://en.wikipedia.org/wiki/Lychrel_number#196_palindrome_quest</a></p>",
      "<p><a href=\"http://datagenetics.com/blog/october12015/index.html\" target=\"_blank\">http://datagenetics.com/blog/october12015/index.html</a></p>"
    ]
  }
}