{
  "title": "Deux distances",
  "metadata": {
    "type": "puzzle"
  },
  "main_version": {
    "statement": "<p>Combien de façons y-a-t-il de dessiner quatre points sur une feuille de papier, de façon que, n’importe quels deux points que vous choisissiez, aient une distance qui est une de seulement deux valeurs possibles ?</p>\n<p>Voici un exemple correct :</p>\n<p><img alt=\"\" src=\"assets/images/Two_Distances_image_0.png\" class=\"Two_Distances_image_0\" /></p>",
    "correct_answer": "6",
    "hint": "<p>Essayez de dessiner un triangle équilatéral. Cela vous donnera trois points qui sont tous à la même distance l’un de l’autre. Où pourrait se placer le quatrième point ?</p>",
    "explanation": "<p>Si nous appelons les deux distances « court » et « long », alors chaque dessin de points doit avoir un triangle avec un bord « long » et deux bords « courts ». (Ce n’est pas si évident mais si vous y réfléchissez, vous pouvez éliminer toutes les autres possibilités). Maintenant, où est-ce que le dernier point se place ? Il est connecté à chacun des trois autres points soit par un bord long ou court, ce qui donne 8 possibilités. Essayez chacune d’entre elles, vous allez remarquer que 2 d’entre elles ne marchent pas, ce qui laisse 6 solutions.</p>\n<p><img alt=\"\" src=\"assets/images/Two_Distances_image_1.png\" class=\"Two_Distances_image_1\" /></p>\n<p>Les bords courts sont de couleur bleue alors que les bords longs sont de couleur verte. Une de ces solutions peut être étendue jusqu’à 5 points qui utilisent seulement deux distances. Regardez le dessin en bas à droite.</p>"
  },
  "extension_1": {
    "statement": "<p>De combien de façons pouvez- vous dessiner quatre points sur un plan dont les distances par paire sont les suivantes ?</p>",
    "hint": "<p>Essayez de deviner quelles sont les sortes de triangles que vous pouvez composer qui utilisent 3 de ces 6 distances. Si vous avez du papier à carreaux, cela aide de pouvoir placer tous les sommets sur la grille.</p>",
    "correct_answer": "2",
    "explanation": "<p>Cet ensemble de distances est plutôt particulier. Pour la plupart des ensembles de distances par paires, il y a seulement une solution. Mais ici il y en a deux.</p>\n<p><img alt=\"\" src=\"assets/images/Two_Distances_image_2.png\" class=\"Two_Distances_image_2\" /></p>"
  },
  "additional_information": {
    "about": "<p>Alex Bellos a présenté ce puzzle dans sa chronique dans le journal quotidien The Guardian au Royaume Uni après en avoir entendu parler par le jongleur de maths Colin Wright, qui en avait eu ouïe par l’expert de puzzles Peter Winkler.</p>",
    "references": [
      "<p><a href=\"https://www.theguardian.com/science/2019/oct/21/can-you-solve-it-the-four-points-two-distances-problem\" target=\"_blank\">https://www.theguardian.com/science/2019/oct/21/can-you-solve-it-the-four-points-two-distances-problem</a></p>",
      "<p><a href=\"https://www.solipsys.co.uk/new/FourPointsTwoDistancesProof.html?RSS\" target=\"_blank\">https://www.solipsys.co.uk/new/FourPointsTwoDistancesProof.html?RSS</a></p>",
      "<p><a href=\"http://datagenetics.com/blog/october12019/index.html\" target=\"_blank\">http://datagenetics.com/blog/october12019/index.html</a></p>",
      "<p><a href=\"https://arxiv.org/pdf/math/0304192.pdf\" target=\"_blank\">https://arxiv.org/pdf/math/0304192.pdf</a></p>"
    ]
  }
}