{
  "title": "Nombres carrés et nombres triangulaires",
  "metadata": {
    "type": "funfact"
  },
  "main_version": {
    "statement": "<p>Les six premiers nombres triangulaires sont 1, 3, 6, 10 et 15</p>\n<p>Les six premiers numéros carrés sont 1, 4, 9, 16 et 25</p>\n<p>Tout nombre carré supérieur à 1 est la somme de deux nombres triangulaires consécutifs.</p>",
    "hint": "<p>Les nombres triangulaires peuvent être dessinés avec des points en forme de triangle. Les numéros carrés peuvent être dessinés avec des points en forme de grille carrée. Voyez si vous pouvez représenter cela visuellement en premier. Pouvez-vous aussi l'exprimer algébriquement ?</p>",
    "explanation": "<p>D'abord, nous montrons cela visuellement, dans l'image ci-dessous, vous pouvez voir que 4 = 1 + 3, 9 = 3 + 6, 16 = 6 + 10, et 25 = 10 + 15. </p>\n<p><img alt=\"\" src=\"assets/images/Square_Numbers_and_Triangular_Numbers_image_0.png\" class=\"Square_Numbers_and_Triangular_Numbers_image_0\" /></p>\n<p>Si nous prenons T = triangulaire et S = carré, alors nous pouvons dessiner le nombre S en tant que grille S de points, le plus petit nombre T forme le T supérieur des points, le plus grand nombre T forme le T inférieur ET la diagonale des points.</p>\n<p>Ce sont des nombres triangulaires consécutifs qui forment un carré.</p>\n<p>La longueur latérale en points du plus grand nombre T est la racine carrée du nombre S. </p>"
  },
  "extension_1": {
    "statement": "<p>Trouvez le 250ème nombre triangulaire.</p>",
    "hint": "<p>Commencer par un petit nombre triangulaire peut vous aider. Pouvez-vous utiliser le modèle de triangles et de carrés pour vous aider ? Quel carré pourrait être la somme du 250e nombre triangulaire et d'un autre nombre triangulaire ? Pensez au 250e nombre carré et à son rapport avec le 250e nombre triangulaire.</p>",
    "explanation": "<p>Regardons d'abord un plus petit exemple. Nous pourrions trouver le 5ème numéro triangulaire en utilisant ce carré:</p>\n<p><img alt=\"\" src=\"assets/images/Square_Numbers_and_Triangular_Numbers_image_1.png\" class=\"Square_Numbers_and_Triangular_Numbers_image_1\" /></p>\n<p>Nous recherchons le nombre de carrés violets. Nous pouvons calculer ½×(5×5 - 5) = 10 pour obtenir le triangle rose. Et en ajoutant sur les 5 carrés de la diagonale, on obtient le triangle violet. Du coup nous avons 15.</p>\n<p><img alt=\"\" src=\"assets/images/Square_Numbers_and_Triangular_Numbers_image_2.png\" class=\"Square_Numbers_and_Triangular_Numbers_image_2\" /></p>\n<p>Pour le 250e nombre triangulaire, nous recherchons le nombre de carrés dans le \"triangle\" noir. Il sera environ ½×250×250, sauf que la diagonale sera incluse. On calcule donc ½×(250×250 - 5) pour trouver le triangle bleu, puis on ajoute 250 pour trouver le triangle noir, la réponse est 31375.</p>\n<p>On peut étendre cette logique pour trouver une formule pour le n-ième nombre triangulaire</p>\n<p>½×(n×n - n) + n = ½×(n² +2×n - n) = ½×(n² + n) = ½×n×(n + 1)</p>\n<p>Vérifier: ½×250×251 = 31375</p>\n<p>En utilisant la formule, on peut également voir que les nombres triangulaires consécutifs ajoutent à un nombre carré. Les nombres triangulaires consécutifs peuvent être représentés par ½×(n - 1)×n and ½×n×(n + 1).</p>\n<p>Si on ajoute ces nombres triangulaires consécutifs et qu'on simplifie, on peut trouver :</p>\n<p>½×(n - 1)×n + ½×n×(n + 1)=  ½×((n - 1)×n + n×(n + 1)) = ½×(n² - n + n²  + n) = n² </p>"
  },
  "additional_information": {
    "about": "<p>La formule pour le n-ième nombre triangulaire est aussi exactement égale à la somme 1 + 2 + 3 + 3 + … + n et c'est donc un moyen rapide pour ajouter des listes de nombres consécutifs! Cette formule a été écrite par le moine irlandais Dicuil environ 816AD mais était probablement déjà connue des Pythagores au Ve siècle av. J.-C.</p>",
    "references": [
      "<p><a href=\"https://www.geogebra.org/m/ZXAP0QPv\" target=\"_blank\">https://www.geogebra.org/m/ZXAP0QPv</a></p>",
      "<p><a href=\"https://nrich.maths.org/2274\" target=\"_blank\">https://nrich.maths.org/2274</a></p>",
      "<p><a href=\"https://en.wikipedia.org/wiki/Triangular_number#Applications\" target=\"_blank\">https://en.wikipedia.org/wiki/Triangular_number#Applications</a></p>"
    ]
  }
}