{
  "title": "Arrête ou Ose",
  "metadata": {
    "type": "game"
  },
  "main_version": {
    "statement": "<p>C’est un jeu pour deux où trois joueurs. Mélangez le jeu de cartes et\nplacez-le à face à l’envers. Le premier joueur retourne la carte sur le\ndessus et continue de retourner les cartes, ajoutant ensemble la valeur\nde chaque carte, jusqu’à ce qu’ils décident d’arrêter et d’enregistrer\nleur score. J= 11 et Q=12.</p>\n<p>Si un A or un K est retourné, on ne compte aucun point à ce tour et le\ntour est fini.</p>\n<p>Les joueurs jouent chacun à leur tour jusqu’à ce que l’un atteigne 100\nou bien plus-ce joueur est le gagnant.</p>",
    "further_instructions": "<p>Si les cartes sont toutes retournées avant que la cible ne soit\natteinte, mélangez à nouveau le paquet et continuez. </p>",
    "strategy_tips": "<p>Essayez de compter combien de cartes K et A sont déjà apparues . Ceci pourrait changer comment vous\nvous sentez audacieux. Si quelqu'un d'autre est près de 100 c'est peut être mieux de retourner plus de\ncartes que ce que vous feriez normalement.</p>"
  },
  "extension_1": {
    "statement": "<p>Vous pourriez essayer de changer le nombre cible, ou changer combien de cartes effacent votre score\npour cet essai. Vous pourriez aussi essayer d’avoir K comme effacer votre score “complet” à zéro pour\nessayer de le rendre plus audacieux.</p>"
  },
  "additional_information": {
    "about": "<p>Ce jeu peut aussi être joué avec un dé et s'appelle parfois Cochon. Il\ny a un ou deux versions de dé, et même une version où vous pouvez\nchoisir combien de dé à jeter plutôt que combien de fois il faut jeter\nun nombre exact de dé.</p>",
    "references": [
      "<p><a href=\"https://en.wikipedia.org/wiki/Pig_(dice_game)\" target=\"_blank\">https://en.wikipedia.org/wiki/Pig_(dice_game)</a></p>",
      "<p><a href=\"https://nrich.maths.org/1193\" target=\"_blank\">https://nrich.maths.org/1193</a></p>"
    ]
  }
}