{
  "title": "Tranches triangulaires",
  "metadata": {
    "type": "counting"
  },
  "main_version": {
    "statement": "<p>Considérez le gâteau ci-dessous - un hexagone avec six côtés. Maintenant, divisez le en triangles en coupant le long de diagonales qui ne se croisent pas, un exemple est donné en rouge. Cette division en triangles s'appelle une triangulation, de combien de façons pouvez-vous le faire?</p>\n<p><img alt=\"\" src=\"assets/images/Triangular_Slices_image_0.png\" class=\"Triangular_Slices_image_0\" /></p>",
    "correct_answer": "14",
    "hint": "<p>De combien de façons pourriez-vous le faire si le gâteau était un carré? Et si c'était un pentagone à cinq côtés? Pouvez-vous utiliser les symétries de votre gâteau pour compter plus rapidement?</p>",
    "explanation": "<p>Il est mieux de commencer par une question plus simple et de rechercher des modèles. Commencez par regarder un carré. Il y a deux façons différentes de couper le gâteau. </p>\n<p><img alt=\"\" src=\"assets/images/Triangular_Slices_image_1.png\" class=\"Triangular_Slices_image_1\" /></p>\n<p>Pour un pentagone, il y a cinq façons:</p>\n<p><img alt=\"\" src=\"assets/images/Triangular_Slices_image_2.png\" class=\"Triangular_Slices_image_2\" /></p>\n<p>Pour un hexagone il y a 14 façons comme on peut le voir ci dessous:</p>\n<p><img alt=\"\" src=\"assets/images/Triangular_Slices_image_3.png\" class=\"Triangular_Slices_image_3\" /></p>\n<p>Dans ce diagramme, vous pouvez voir que la solution est trouvée en pensant à 6 + 3 + 2 + 3 = 14, mais vous pouvez arriver à la solution en faisant 5 + 2 + 2 + 5 = 14 où 5 est la réponse pour un pentagone et 2 est la réponse pour un carré. La combinaison équivalente pour le pentagone est 2 + 1 + 2 = 5, où 1 est le résultat du triangle (qui n'a bien sûr qu'une seule option) et 2 est le résultat pour un carré.</p>\n<p>C'est une technique plus utile pour passer à la réflexion sur les polygones avec plus de sommets.</p>"
  },
  "extension_1": {
    "statement": "<p>Peux-tu trouver la réponse à la même question, si le gâteau a la forme d´un heptagone avec sept côtés ? </p>",
    "hint": "<p>Peux-tu réutiliser les résultats d'avant pour calculer ce nombre? Compter explicitement pourrait durer trop de temps. Peux-tu trouver un chemin pour réduire le problème dans les cas plus simples, que tu déjà as comptés ? Concentre-toi sur quand un bord fixe du heptagon est présent dans un certain triangle. Puis le heptagon est divisé en deux parties, celui à gauche du triangle en haut et celui à droite. Les deux parties sont plus petites...</p>",
    "correct_answer": "42",
    "explanation": "<p>Nous allons compter les sommets ? dl l” heptagon de 1 à 7 dans le sens anti-horaire. Nous allons concentrer notre attention sur un bord fixe, disons l'un avec les vertices 1 et 2. Quand le bord est présent dans le triangle avec le vertice extra 3, ensuite le heptagon est divisé en ce triangle et le hexagon sur sa gauche (avec les vertices 1, 3, 4, 5, 6 et 7). Pour le dernier, le problème est exactement le même que tu´as résolu avant, par exemple tu obtiens toujours 14 chemins pour construire un triangle. Ensuite considérons lorsque le côté fixe forme un triangle avec le sommet 4. À la droite du triangle on a un triangle (avec les sommets 2, 3 et 4), tandis qu’à la gauche on a un pentagone (avec les sommets 1, 4, 5, 6 et 7) pour lesquels on sait qu’on peut faire 5 triangulations. Donc, ce cas nous fournit avec 5x1 = 5 triangulations.\nConsidérons le cas lorsque le côté fixe forme un côté avec le triangle qui a le sommet 5. Nous avons à gauche et à droite du triangle un carré : un avec les sommets 2, 3, 4, 5, et l’autre avec les sommets 1, 5, 6, 7. Chaque carré peut être triangulé indépendamment de 2 façons, donc, ce cas nous fournit avec 2x2 = 4 triangulations.\nNous continuons avec le côté fixe formant un triangle avec les sommets 6 et 7. Nous avons épuisé tous les moyens possibles pour qu’un côté fixe puisse apparaître dans une triangulation. De plus dans chaque triangulation possible chaque côté doit faire partie d’un triangle. Donc ci-dessus nous avons abordé tous les cas possibles, qui sont en train de s’additionner : 14 + 1×5 + 2×2 + 5×1 + 14 = 42.</p>\n<p>On peut trouver une formule pour le nombre Cₙ de triangulations du (n+2)-gone. Généralisant ce que nous avons fait avant, on a: Cₙ = Cₙ₋₁ + C₁×Cₙ₋₂ + C₂×Cₙ₋₃ + … + Cₙ₋₂×C₁ + Cₙ₋₁\nLe iᵗʰ terme correspond au nombre de triangulations possibles quand un côté fixe forme un triangle avec le sommet (i+2), où i est un nombre entre 1 et n. De ce qu’on a vu : C₁ = 1, C₂ = 2, C₃ = 5, C₄ = 14, C₅ = 42, .</p>"
  },
  "extension_2": {
    "statement": "<p>Peux-tu trouver la solution pour la même question si le gâteau avait la forme d’un ennéagone à neuf côtés? </p>",
    "hint": "<p>Can you use the formula to find the answer for an eight sided shape so that you have all the values you need to find the answer for a nine sided shape? </p>",
    "correct_answer": "429",
    "explanation": "<p>Jusqu’ici, la solution pour 3, 4, 5, 6, et 7 côtés, les solutions pour lesquelles sont 1, 2, 5, 14 et 42 respectivement). Pour trouver 8 côtés nous pouvons faire 42 + 1x14 + 2x5 + 5x2 + 14x1 + 42 = 132. Finalement pour 9 côtés nous avons 132 + 1x42 + 2x14 + 5x5 + 14x2 + 42x1 + 132 = 429 </p>"
  },
  "additional_information": {
    "about": "<p>Ces Cn sont appelés les Nombres de Catalans et sont cruciaux dans le monde de combinatorics. Il existe une formule explicite pour eux, mais la trouver va bien au-delà de notre portée: la définition récursive d’au dessus et bien assez pour l’instant! Intéressement, il y a de nombreux problèmes différents qui mènent à ces nombres (plus de 200!) … peut-être as tu vu un autre problème avec les mêmes réponses?</p>",
    "references": [
      "<p><a href=\"https://garethrees.org/2013/06/11/tabular/\" target=\"_blank\">https://garethrees.org/2013/06/11/tabular/</a></p>"
    ]
  }
}