{
  "title": "Nombre de Kaprekar",
  "metadata": {
    "type": "funfact"
  },
  "main_version": {
    "statement": "<p>Choisissez un nombre à quatre chiffres où les chiffres ne sont pas tous les mêmes.</p>\n<p>Réorganiser les chiffres pour obtenir le plus grand et le plus petit nombre possible que ces chiffres peuvent former.</p>\n<p>Soustrayez le plus petit nombre du plus grand pour obtenir un nouveau nombre, et continuez à répéter l'opération pour chaque nouveau nombre. Vous finirez toujours au même nombre.</p>",
    "hint": "<p>Par exemple, si vous commencez par 4252, vous devez faire le calcul 5422 - 2245 = 3177, puis faire 7731 - 1377 et ainsi de suite.</p>",
    "explanation": "<p>Vous finissez toujours avec le nombre 6174. Ceci est connu sous le nom de nombre de Kaprekar. Par exemple 5432 – 2345 = 3087</p>\n<p>8730 – 0378 = 8352</p>\n<p>8532 – 2358 = 6174</p>\n<p>7641 – 1467 = 6174</p>"
  },
  "extension_1": {
    "statement": "<p>Que se passe-t-il lorsque vous effectuez ce processus avec des nombres à 3 chiffres (où tous les chiffres ne sont pas les mêmes)? Pouvez-vous expliquer pourquoi vous vous retrouvez toujours avec le même nombre ? Notez que si vous trouvez 99 comme réponse à n'importe quel moment, cela donnerait alors 099 comme le plus petit nombre et 990 comme le plus grand.</p>",
    "hint": "<p>Par exemple, si vous commencez par 792, le premier calcul que vous devez effectuer est 972 - 279 = 693. </p>",
    "explanation": "<p>On peut écrire un nombre abc à trois chiffres (imaginez qu'il soit aussi grand que possible) que 100×a + 10×b + c. Si nous réorganisons les chiffres pour les rendre aussi petits que possible, ce serait cba que nous pouvons écrire comme 100×c + 10×b + a. Puis soustraire pour donner 100×a + 10×b + c - (100×c + 10×b + a) = 99×a - 99×c = 99×(c). Donc, après une étape, le nombre sera un multiple de 99. Les 10 seuls nombres qui sont des multiples de 99 sont 099, 198, 297, 396, 495, 594, 693, 792, 891, et 990. Nous avons seulement besoin de vérifier les cinq premiers (comme nous réarrangerons les chiffres de toute façon) et nous pouvons vérifier que tous finissent par donner la réponse 495.</p>"
  },
  "additional_information": {
    "about": "<p>D. R. Kaprekar (1905 - 1986) était un professeur indien de mathématiques qui aimait jouer avec les nombres. Il a découvert un certain nombre de résultats dans la théorie des nombres et décrit diverses propriétés des nombres.</p>",
    "references": [
      "<p><a href=\"https://en.wikipedia.org/wiki/D._R._Kaprekar\" target=\"_blank\">https://en.wikipedia.org/wiki/D._R._Kaprekar</a></p>",
      "<p><a href=\"https://plus.maths.org/content/mysterious-number-6174\" target=\"_blank\">https://plus.maths.org/content/mysterious-number-6174</a></p>"
    ]
  }
}