{
  "title": "Patience",
  "metadata": {
    "type": "game"
  },
  "main_version": {
    "statement": "<p>Ceci est une partie de patience pour qu'un seul joueur. Étalez un grille de 8 cartes en 2 rangées de 4 cartes, en face et retenez les cartes restantes. Si vous trouvez deux cartes dans la grille dont la somme monte à 11 vous pouvez mettre des nouvelle cartes dans votre main sur celles-ci (ici, l'as = 1). Si vous trouvez le Valet, la Reine ou le Roi vous pouvez aussi mettre une nouvelle carte au dessus de chacune. Le but du jeu est de déposer toutes les cartes dans la main. </p>",
    "further_instructions": "<p>Retirez les Jokers avant de commencer. Le as a une valeure de 1 dans ce jeu. Si vous parvenez a placer toutse les cartes, la dernière étape du jeu est de ramasser les cartes de dessus dont la somme est 11, ou de trois piles avec le Valet, Reine ou Roi en haut. Vous avez gagner le jeu si vous pouvez rammaser toutes les cartes. Si vous ne pouvez pas placer toutes vos cartes, comptez combien de cartes restantes il y a</p>",
    "strategy_tips": "<p>Ce jeu est composé principalement de la chance - mais vous devez réflécbien hir au nombre de Valets, Reines et Rois que vous avez couvert pour gagner à la dernière étape !</p>"
  },
  "extension_1": {
    "statement": "<p>Un jeu similaire utilise 10 cartes avec leur face visible et vous devez supprimer des paires qui totalisent jusqu'à 13 (As = 1, Valet = 11, Reine = 12, et Roi=13). Le Roi peut être retiré tout seul. Chaque fois que vous retirez des cartes, vous les remplacez par des nouvelles. Le but est de finir de jouer à toutes les cartes du paquet. </p>\n<p>Vous pouvez créer votre propre version de ce type de jeu en choisissant le montant à calculer, combien de cartes avec leur face visible et que faire avec lescartes de la cour royale. Pouvez-vous concevoir un jeu qui peut être gagné environ la moitié des fois jouées ?</p>"
  },
  "additional_information": {
    "about": "<p>Ce genre de jeu sont souvent appelés Patience ou Solitaire. Patience parce que vous avez besoin de beaucoup de patience pour essayer de gagner, et Solitaire parce que vous pouvez les jouer tout seul. Bien que de nombreuses variations de Patience compte sur le hasard, il est intéressant d'utiliser des mathématiques pour analyser la probabilité de gagner.</p>",
    "references": [
      "<p><a href=\"https://nrich.maths.org/1194\" target=\"_blank\">https://nrich.maths.org/1194</a></p>",
      "<p><a href=\"https://www.solsuite.com/games/elevens.htm\" target=\"_blank\">https://www.solsuite.com/games/elevens.htm</a></p>"
    ]
  }
}