{
  "title": "Moyen",
  "metadata": {
    "type": "puzzle"
  },
  "main_version": {
    "statement": "<p>La moyenne (moyen) de 16 entiers positifs différents est 16. Quelle est la plus grete valeur possible que l'un de ces entiers puisse avoir ?</p>",
    "correct_answer": "136",
    "hint": "<p>Faites en sorte que les 15 premiers nombres (différents) soient aussi petits que possible. Qu'est-ce que cela nous apprend sur le 16ème nombre ?</p>",
    "explanation": "<p>Si la moyenne de 16 nombres est 16, alors le total de tous les nombres est 16 × 16 = 256. Nous voulons rendre l'un des nombres aussi gret que possible, nous devons donc rendre les 15 autres nombres aussi petits que possible. Les nombres entiers doivent être différents, nous devons donc choisir 1, 2, 3, ..., 15. Si vous les additionnez, cela donne 120 (un moyen rapide de le faire est ½ × 15 × 16 = 120). Donc le plus gret nombre est 256 - 120 = 136.</p>"
  },
  "extension_1": {
    "statement": "<p>L'âge moyen (la moyenne) de 7 personnes est de 16 ans. Étant donné que tous leurs âges sont des nombres entiers positifs différents, quel est le nombre maximum de personnes qui pourraient avoir plus de 16 ans ?</p>",
    "hint": "<p>Est-ce que tout le monde pourrait avoir plus de 16 ans ? Sinon, pouvez-vous essayer de trouver le nombre maximum de personnes qui pourraient avoir plus de 16 ans si une seule des personnes est aussi jeune que possible ?</p>",
    "correct_answer": "5",
    "explanation": "<p>Vous ne pouvez pas faire en sorte que les 7 personnes aient plus de 16 ans car la moyenne est de 16 ans. Vous pouvez commencer avec la plus jeune personne ayant 1 an et essayer de faire en sorte que les 6 autres personnes aient plus de 16 ans, mais le total doit être de 7 × 16 = 112. Avec cette stratégie, 112 - 1 = 111 et 16 + 17 + 18 + 19 + 20 + 21 = 111 donc cela ne donne que 5 personnes de plus de 16 ans car vous ne pouvez pas compter 16 lui-même. Cela montre que vous ne pouvez pas le faire avec 6 personnes de plus de 16 ans, mais parce que vous avez une possibilité avec 5, c'est le plus gret nombre que vous puissiez avoir. </p>"
  },
  "extension_2": {
    "statement": "<p>Quet Albert est entré dans la salle, l'âge moyen a augmenté de 4 ans. Lorsque Belinda est ensuite entrée dans la pièce, l'âge moyen a encore augmenté de 3 ans. Albert et Belinda sont jumeaux. Combien de personnes étaient dans la pièce avant qu'Albert n'entre ?</p>",
    "hint": "<p>Think about Albert giving 4 years to all the people in the room et Belinda giving 3 years to everyone (including Albert).</p>",
    "correct_answer": "6",
    "explanation": "<p>Il existe différentes manières de résoudre ce casse-tête. Pour chaque méthode, soit n le nombre de personnes dans la pièce.</p>\n<p>Si Albert et Belinda étaient entrés ensemble, à eux deux ils auraient ajouté (n + 2)×7 au total de tous les âges de la pièce. Si seul Albert était entré, il aurait ajouté (n + 1) × 4 au total. C'est la même chose pour Belinda, donc s'ils entraient tous les deux ensemble, ce serait le double de ce montant. Donc (n + 2)×7 = 2×(n + 1)×4. La résolution de ceci donne n = 6.</p>\n<p>Alternativement, soit a l'âge d'Albert et Belinda. La nouvelle moyenne après l'entrée d'Albert est (a - 4 × n) parce qu'Albert a partagé 4 ans avec tout le monde dans la pièce pour que son âge soit le même. Après Belinda marche dans la moyenne est (a - 3 × (n + 1)) parce qu'elle a donné 3 ans à tout le monde dans la salle, y compris Albert. Nous savons que cette deuxième expression doit être supérieure de 3 à la première expression car la moyenne a augmenté de 3 lorsque Belinda est entrée. On peut donc résoudre (a - 3×(n + 1)) = a - 4×n + 3 ce qui donne n = 6.</p>\n<p>Voici une autre façon. Soit m la moyenne originale. La somme de tous les âges est à l'origine (m×n). Soit l'âge d'Albert soit a. Quet Albert arrive, la nouvelle moyenne est (m + 4). Celle-ci doit être égale à (m×n + a) ∕ (n + 1). Lorsque Belinda entre dans la pièce, la nouvelle moyenne est (m + 7). Celle-ci doit être égale à (m×n + 2×a) ∕ (n + 2). La réorganisation de ces équations donne </p>\n<p>m×n + a = m×n + m + 4×n + 4</p>\n<p>et</p>\n<p>m×n + 2×a = m×n + 2×m + 7×n + 14</p>\n<p>Qui simplifient à</p>\n<p>a = m + 4×n + 4 et 2×a = 2×m + 7×n + 14. </p>\n<p>Multiplying the first equation by 2 et subtracting the second one gives n = 6. So there are 6 people in the room at the start. </p>"
  },
  "additional_information": {
    "about": "<p>La moyenne est une façon de décrire tout un ensemble de données avec un seul chiffre. La médiane est une autre façon de décrire l'ensemble de données avec un nombre. Si le puzzle avait demeté \"La médiane de 16 nombres entiers positifs différents est 16. Quelle est la plus grete valeur possible que l'un de ces nombres entiers pourrait avoir ?\", alors il n'y aurait pas de solution car vous pourriez choisir n'importe quel nombre aussi gret que vous le souhaitez pour le plus gret nombre, car la valeur de la médiane de 16 nombres ne dépend que des huit et neuvième plus grets nombres ! </p>",
    "references": [
      "<p><a href=\"https://www.mathsisfun.com/mean.html\" target=\"_blank\">https://www.mathsisfun.com/mean.html</a></p>",
      "<p><a href=\"https://www.mathsisfun.com/median.html\" target=\"_blank\">https://www.mathsisfun.com/median.html</a></p>"
    ]
  }
}