{
  "title": "Coloriage",
  "metadata": {
    "type": "counting"
  },
  "main_version": {
    "statement": "<p>Combien de drapeaux tricolores similaires à celui ci-dessous y a-t-il si nous disposons seulement de 5 couleurs. Deux bandes juxtaposées ne peuvent PAS être de la même couleur.</p>\n<p><img alt=\"\" src=\"assets/images/Colouring_image_0.png\" class=\"Colouring_image_0\" /></p>",
    "correct_answer": "80",
    "hint": "<p>Pensez au nombre de couleurs différentes qui pourraient être utilisées dans la première bande, puis la deuxième, ...</p>",
    "explanation": "<p>Il y a 5 choix possibles pour la première bande. Dès qu’une couleur a été choisie, la deuxième bande ne peut être de la même couleur. Il n’y a donc que quatre couleurs à choisir pour la deuxième bande. Pour la troisième bande, il y a 4 couleurs au choix, car elle ne peut pas être de la même couleur que la deuxième, mais elle peut être de la même couleur que la première. Ainsi, le nombre de drapeaux tricolores avec 5 couleurs au choix vaut 5 × 4 × 4 = 80.</p>"
  },
  "extension_1": {
    "statement": "<p>De combien de manières différentes puis-je peindre les cinq murs d'une pièce pentagonale avec de la peinture rouge, bleue et verte de sorte que deux murs voisins ne soient de la même couleur ?</p>\n<p><img alt=\"\" src=\"assets/images/Colouring_image_1.png\" class=\"Colouring_image_1\" /></p>",
    "hint": "<p>Choisissez une couleur, par exemple, peignez le toit en rouge et essayez de lister toutes les différentes options pour les autres murs.  </p>",
    "correct_answer": "30",
    "explanation": "<p>Tout d'abord, vous pouvez commencer par le rouge, le bleu ou le vert et utilisez l'une des autres couleurs pour le deuxième côté et ainsi de suite autour du pentagone. Lorsque vous arrivez au dernier côté, il ne peut pas être de même couleur que le quatrième ou le premier côté.</p>\n<p>Nous pouvons représenter les choix de couleurs dans un diagramme d'arbre, au sommet (connu comme la racine de l'arbre) nous peignons le premier côté. Ici, nous choisissons le rouge. La première ramification est le choix du vert ou du bleu pour le deuxième côté. La prochaine ramification est le choix du troisième côté qui dépend de votre choix du deuxième côté. Tout chemin allant de la racine à la fin de l'arbre (appelé feuille) vous donne un choix pour les cinq côtés. Nous voyons que si nous commençons par le rouge, nous avons 10 colorations différentes. </p>\n<p>Comme nous pouvons obtenir des diagrammes similaires si nous avions choisi le vert ou le bleu en première position, nous avons un total de 3 × 10 = 30 colorations différentes. </p>\n<p><img alt=\"\" src=\"assets/images/Colouring_image_2.png\" class=\"Colouring_image_2\" /></p>"
  },
  "additional_information": {
    "about": "<p>Dans une pièce comportant un nombre pair de murs, deux couleurs sont suffisantes. Pour les pièces avec un nombre impair de murs, vous aurez besoin de trois couleurs.</p>",
    "references": [
      "<p><a href=\"https://nrich.maths.org/600\" target=\"_blank\">https://nrich.maths.org/600</a></p>"
    ]
  }
}
