{
  "title": "Quatre couleurs",
  "metadata": {
    "type": "funfact"
  },
  "main_version": {
    "statement": "<p>Il faut au plus quatre couleurs pour colorier chaque carte de telle sorte que les deux régions voisines (régions qui partagent une frontière) ne soient pas de la même couleur.</p>",
    "hint": "<p>Pouvez-vous colorier une carte de l'Afrique avec cinq couleurs de façon à ce que 2 pays voisins ne soit coloriés de la même couleur? Pouvez-vous aussi réussir avec quatre couleurs ? Qu'en est-il de trois couleurs?</p>",
    "explanation": "<p>Le théorème des quatre couleurs stipule que pour toute séparation d'un plan en régions contiguës, produisant une figure appelée une carte, pas plus de quatre couleurs sont requises pour colorier les régions de la carte, de sorte que deux régions voisines n'aient pas la même couleur. Nous pouvons comprendre pourquoi ce n'est pas possible avec trois couleurs en regardant la situation autour du Rwanda: </p>\n<p><img alt=\"\" src=\"assets/images/Four_Colours_image_0.png\" class=\"Four_Colours_image_0\" /></p>\n<p>Si nous essayons d'utiliser le rouge, le bleu et le vert, nous pourrons aller aussi loin :</p>\n<p><img alt=\"\" src=\"assets/images/Four_Colours_image_1.png\" class=\"Four_Colours_image_1\" /></p>\n<p>Mais nous ne pouvons pas colorier le Rwanda en rouge (parce qu'il partage une frontière avec l'Ouganda et le Burundi) vert (à cause de la Tanzanie) ou bleu (à cause République démocratique du Congo). Nous avons besoin d'une autre couleur. </p>\n<p>La preuve que seules quatre couleurs sont nécessaires peut paraître compliquée, mais l'extension vous donnera un aperçu de la façon dont elle est faite.</p>"
  },
  "extension_1": {
    "statement": "<p>Pouvez-vous tracer une carte avec 12 pays de telle sorte que chaque pays a exactement cinq voisins, puis la colorier en utilisant seulement 4 couleurs?</p>",
    "hint": "<p>Votre carte devrait essentiellement ressembler à ceci:</p>\n<p><img alt=\"\" src=\"assets/images/Four_Colours_image_2.png\" class=\"Four_Colours_image_2\" /></p>",
    "explanation": "<p>L'idée de prouver le théorème à quatre couleurs est de trouver les conditions nécessaires pour avoir un contre-exemple minimal (cela signifie une carte minimale 4-non-coloriables) et donc de se concentrer sur les cartes avec ces conditions nécessaires. L'une de ces nombreuses conditions nécessaires est de montrer que, dans un petit contre-exemple avec 12 pays, tous les pays doivent avoir exactement cinq voisins. Cependant cela peut être coloré comme ceci:</p>\n<p><img alt=\"\" src=\"assets/images/Four_Colours_image_3.png\" class=\"Four_Colours_image_3\" /></p>\n<p>La preuve est de vérifier environ 1500 cartes de ce genre !</p>"
  },
  "additional_information": {
    "about": "<p>La preuve du théorème des quatre couleurs est connue pour être un peu compliquée et provient de la théorie des graphes, où les mathématiciens enquêtent sur un problème équivalent de coloration des sommets d'un réseau de sorte qu'aucune arête n'a des extrémités de la même couleur. La preuve originale de quatre couleurs a été tentée par<a href=\"https://en.wikipedia.org/wiki/Alfred_Kempe\"> </a>Alfred Kempe en 1879, mais malheureusement Percy John Heawood a trouvé une erreur 11 ans plus tard. Cependant, son travail n'a pas été inutile. Comme Percy a été en mesure de prouver le théorème à cinq couleurs (que l'on peut colorier une carte sans deux régions voisines la même couleur en utilisant au maximum 5 couleurs) en fonction du travail de Kempe. Kenneth Appel, Wolfgang Haken et John Koch ont finalement prouvé le théorème des couleurs en 1976. Ce fut le premier théorème majeur à être prouvé à l'aide d'un ordinateur. Ils ont vérifié environ 1500 configurations en utilisant environ 1200 heures de temps de calcul. Certaines personnes étaient sceptiques quant à une preuve utilisant un ordinateur, mais la vérification indépendante a vite convaincu tout le monde que le théorème des quatre couleurs avait finalement été prouvé.</p>",
    "references": [
      "<p><a href=\"https://mathshistory.st-andrews.ac.uk/HistTopics/The_four_colour_theorem/\" target=\"_blank\">https://mathshistory.st-andrews.ac.uk/HistTopics/The_four_colour_theorem/</a></p>",
      "<p><a href=\"https://www.mathsisfun.com/activity/coloring.html\" target=\"_blank\">https://www.mathsisfun.com/activity/coloring.html</a></p>"
    ]
  }
}