{
  "title": "Ramanujan",
  "metadata": {
    "type": "funfact"
  },
  "main_version": {
    "statement": "<p>1729 est le plus petit nombre qui peut être écrit comme une somme de deux nombres cubes de deux manières différentes.</p>",
    "hint": "<p>72 peut être exprimé comme 2³ + 4³ mais c'est la seule manière avec deux cubes positifs. Pouvez-vous trouver les deux manières de calculer 1729?</p>",
    "explanation": "<p>1³ + 12³ = 1 + 1728 = 1729 et aussi 9³ + 10³ = 729 + 1000 = 1729</p>"
  },
  "extension_1": {
    "statement": "<p>Si vous modifiez le problème pour permettre d'avoir un cube d'un nombre négatif, par ex. (-3)³=27 alors le plus petit nombre que vous pouvez calculer est inférieur à 100. Pouvez-vous trouver le nombre et les deux façons de le faire?</p>",
    "hint": "<p>Le nombre est compris entre 90 et 100.</p>",
    "explanation": "<p>91 peut être écrit comme 6³+(-5)³ = 216 - 125 =91 ou 4³+3³=64+27=91</p>"
  },
  "additional_information": {
    "about": "<p>Bernard Frénicle de Bessy a écrit sur le nombre 1729 en 1657, mais il a été rendu populaire par G. H. Hardy racontant une histoire sur Srinivasa Ramanujan vers 1919 : \"Je me souviens d'être allé le voir une fois quand il était malade à Putney. J'étais monté dans le taxi numéro 1729 et j'avais remarqué que le numéro me paraissait plutôt ennuyeux et que j'espérais que ce n'était pas un mauvais présage. \"Non,\" répondit-il, \"c'est un nombre très intéressant; c'est le plus petit nombre exprimable comme la somme de deux cubes de deux manières différentes.\" 1729 est maintenant appelé un numéro de « taxi ». C'est le deuxième numéro de taxi. Le premier est 2 car c'est le plus petit nombre qui peut être écrit d'une manière comme la somme de deux cubes. 87539319 est le troisième numéro de taxi car c'est le plus petit nombre qui peut être écrit de trois manières différentes comme la somme de deux cubes. Personne ne sait quels sont les numéros de taxi au-dessus du 6e. </p>",
    "references": [
      "<p><a href=\"https://en.wikipedia.org/wiki/Bernard_Fr%C3%A9nicle_de_Bessy\" target=\"_blank\">https://en.wikipedia.org/wiki/Bernard_Fr%C3%A9nicle_de_Bessy</a></p>",
      "<p><a href=\"https://en.wikipedia.org/wiki/1729_(number)\" target=\"_blank\">https://en.wikipedia.org/wiki/1729_(number)</a></p>",
      "<p><a href=\"https://en.wikipedia.org/wiki/Taxicab_number\" target=\"_blank\">https://en.wikipedia.org/wiki/Taxicab_number</a></p>"
    ]
  }
}