{
  "title": "Mastermind",
  "metadata": {
    "type": "game"
  },
  "main_version": {
    "statement": "<p>Il s'agit d'un jeu à deux joueurs, le premier joueur choisit secrètement quatre cartes et les mets dans une rangée avec leur face cachée. Le deuxième joueur a sept essais pour deviner les enseignes/combinaisons (trèfles, carreaux, cœurs, piques) de ces cartes, en ordre. Le deuxième joueur devine en plaçant quatre cartes en rangée face vers le haut. Le premier joueur regarde les enseignes et leur dit combien d'enseignes ils ont devinés dans la bonne position (x), et combien d'autres enseignes ils ont bien deviné mais dans la mauvaise position (o). Le deuxième joueur utilise ces informations pour mieux deviner la prochaine fois.</p>",
    "further_instructions": "<p>Voici comment une partie pourrait fonctionner :</p>\n<p>Le joueur 1 choisit 1) 4 Cœur, 2) 3 Trèfle, 3) 8 Pique, 4) 10 Pique et les places face vers le bas.</p>\n<p>Le joueur 2 pose par exemple : 1) 6 Cœurs, 2) 4 Pique, 3) Valet de Carreau, 4) 3 Pique.</p>\n<p>Le joueur 2 a trois enseignes corrects (Cœur, Pique et Pique) et deux dans la bonne position - 1) et 4) donc le joueur 1 dirait \"vous en avez deux dans la bonne position et une dans la mauvaise position\", mais ne dit pas lequels - une methode facile d'enregistrer cela serait xxo. Alors le joueur 2 devinerait à nouveau. Ils pourraient estimer que ce sont les deux dernières cartes qui ont été tout à fait correctes, alors les gardes et devinerai les deux premières différamment . Enregistrer les résultats avec stylo et papier sera nécessaire et ressemblerait à ceci:</p>\n<p>CoPCaP xxo</p>\n<p>TTCaP xoo </p>\n<p>Notez que ce n'est que les enseignes qui nous intéressent et non les chiffres. Le joueur 1 ne dit pas exactement lesquels sont corrects, il suffit de dire combien ont été bien deviné, le joueur 2 continue à deviner jusqu'à ce que tous les quatre soient corrects. </p>",
    "strategy_tips": "<p>Pour celui qui devine : Votre première essai sera au hasard, mais après cela, vous devriez utiliser la logique pour déterminer quelle est la solution. Une bonne stratégie pour les débutants est juste de changer une seule carte à la fois, mais des que vous jouez plus, vous pouvez trouver une meilleure stratégie optimale.</p>\n<p>Pour celui qui décide: pensez a savoir s'il est mieux d'avoir que le même enseigne, tous différent, ou quelques uns pareils. </p>"
  },
  "extension_1": {
    "statement": "<p>Essayez de jouer au jeu en devinant le chiffre des cartes - 1 (As) à 10 - au lieu des enseignes. Il y aura plus d'options donc ce sera beaucoup plus difficile, vous pouvez même utiliser V, Re, Ro aussi.</p>"
  },
  "additional_information": {
    "about": "<p>Ce jeu peut être joué avec des chiffres, des lettres, des symboles ou bien des couleurs comme dans le jeux de société du même nom.</p>",
    "references": [
      "<p><a href=\"https://en.wikipedia.org/wiki/Mastermind_(board_game)\" target=\"_blank\">https://en.wikipedia.org/wiki/Mastermind_(board_game)</a></p>",
      "<p><a href=\"https://lycee.samicharity.co.uk/2017/09/21/mastermind-problems/\" target=\"_blank\">https://lycee.samicharity.co.uk/2017/09/21/mastermind-problems/</a></p>"
    ]
  }
}