{
  "title": "Alphanumérique",
  "metadata": {
    "type": "puzzle"
  },
  "main_version": {
    "statement": "<p>Dans la somme, CAR + CAT = RARE, chaque lettre représente un unique chiffre compris entre 0 et 9. Quelle est la valeur du mot RARE ?</p>",
    "correct_answer": "1510",
    "hint": "<p>Quel chiffre doit représenter la lettre R? Si vous additionnez deux nombres de trois chiffres, quelle est la plus grande somme que vous pourriez obtenir?</p>",
    "explanation": "<p>R doit être égal à 1 parce que 1 est la seule retenue possible que l’on peut faire passer de la case des centaines à la case des milliers. Nous avons donc, CA1 + CAT = 1A1E.</p>\n<p>Si on regarde la case des dizaines, nous avons A+A = 1 (ou se termine par 1). Puisque A+A est un nombre pair, la seule façon que le nombre se termine par le chiffre 1 est qu'il y ait une retenue provenant de la case des unités. </p>\n<p>Ceci nous donne A = 5 ou A = 0. </p>\n<p>Puisque l’on sait qu’il y a eu une retenue dans la case des unités, T = 9 et donc E = 0. Ceci signifie que A = 5 car chaque lettre représente un unique chiffre. Ainsi, le mot RARE = 1510. \n(Bien que cela ne soit pas nécessaire, on peut vérifier que C = 7). Finalement nous avons 751 + 759 = 1510.</p>"
  },
  "extension_1": {
    "statement": "<p>Dans la somme TWO + TWO = FOUR chaque lettre représente un unique chiffre compris entre 0 à 9. Pour ces 7 solutions, quelle est la plus grande valeur du mot FOUR? </p>",
    "hint": "<p>Une fois que vous avez trouvé le chiffre que F représente, vous pouvez alors considérer la plus grande valeur possible de O.</p>",
    "correct_answer": "1876",
    "explanation": "<p>F doit être égal à 1 puisque seule la retenue 1 peut provenir de la case des centaines.</p>\n<p>Nous avons maintenant TWO + TWO = 1OUR.</p>\n<p>Puisque nous essayons de trouver la plus grande valeur de FOUR, nous essayons ensuite O = 9. Ce qui donnerait, TW9 + TW9 = 19UR. Alors, la seule possibilité est T = 9, mais ceci est exclu puisque O = 9 veut dire que O = T.</p>\n<p>Nous essayons ensuite O = 8. Donc, TW8 + TW8 = 18UR. Ce qui entraine R = 6 et T = 9. Nous avons ensuite 9W8 + 9W8 = 18U6.</p>\n<p>Nous avons encore un choix de réponses pour W et U.</p>\n<p>Il faut que W soit moins que 5 pour éviter d’ajouter une retenue à la case des centaines. Si nous essayons W = 4, nous obtiendrons U = 9, toutefois ceci n’est pas possible puisque nous avons déjà T = 9. Nous pouvons donc essayer W = 3.</p>\n<p>Nous avons donc 938 +938 = 1876, et donc la plus grande valeur du mot FOUR est 1876.</p>"
  },
  "extension_2": {
    "statement": "<p>Dans la somme MATHS + GAMES = DECODE, chaque lettre représente un unique chiffre compris entre 0 et 9. Quelle est la valeur du mot DECODE?</p>",
    "hint": "<p>There are 10 different letters used in this sum so each digit from 0 to 9 will be used. You will need an organised approach to solve this one. You might want to make a table of all the possibilities and then cross out any values as you eliminate them. You can start with the fact that D = 1.</p>",
    "correct_answer": "164816",
    "explanation": "<p>Il y a de nombreuses manières de résoudre cette énigme. Premièrement, D = 1. Pour continuer, nous devons utiliser toutes les informations disponibles pour éliminer certaines possibilités. Par exemple, nous observons que E doit être un nombre pair. S ne peut être égal à 0, 1, ou 5. Beaucoup de coup de force est requis pour résoudre ce problème, mais avec une table pour organiser toutes les informations, vous devriez être en mesure de réduire toutes les possibilités jusqu'à ce que vous parveniez à la réponse correcte. T = 0, D = 1, A = 2, S = 3, C = 4, H = 5, E = 6, M = 7, O = 8, G = 9.</p>"
  },
  "additional_information": {
    "about": "<p>Ces types d'énigmes sont appelés ‘ Cryptarithmes”, ou \"arithmétique verbale”. L'exemple le plus classique a été publié dans l'édition de juillet 1924 du Magazine Strand par le mathématicien anglais Henry Dudeney.  </p>\n<p>SEND + MORE = MONEY</p>\n<p>Étant donné le nombre considérable de possibilités, les programmes informatiques sont souvent utilisés pour générer et résoudre ces types d'énigmes.</p>",
    "references": [
      "<p><a href=\"https://en.wikipedia.org/wiki/Verbal_arithmetic\" target=\"_blank\">https://en.wikipedia.org/wiki/Verbal_arithmetic</a></p>",
      "<p><a href=\"https://www.dcode.fr/cryptarithm-solver\" target=\"_blank\">https://www.dcode.fr/cryptarithm-solver</a></p>",
      "<p><a href=\"http://www.iread.it/cryptarithms.php\" target=\"_blank\">http://www.iread.it/cryptarithms.php</a></p>"
    ]
  }
}