{
  "title": "Serrer la main",
  "metadata": {
    "type": "counting"
  },
  "main_version": {
    "statement": "<p>Le jour de l'anniversaire de votre ami, il y a 8 enfants. Chaque enfant serre la main de tous les autres enfants à la fête. Combien de poignées de main se sont produites au total? </p>",
    "correct_answer": "28",
    "hint": "<p>Commencez par un petit nombre d'enfants, par exemple. 3, 4 ou 5. Combien de poignées de main devez-vous ajouter si un autre enfant rejoint le groupe? </p>",
    "explanation": "<p>En comptant sur de petits exemples, vous trouverez = erreur de temps et de vocabulaire peut-être que chaque fois que vous ajoutez une personne à la fête d'anniversaire avec n enfants, le nombre de poignées de main augmente de n.</p>\n<p>Si nous avons 2 enfants (disons A et B), nous n'avons qu'une poignée de main AB. </p>\n<p>Lorsque nous avons 3 enfants (disons A, B et C), nous avons 3 poignées de main: AB, AC et BC. Il y a l'original et 2 autres maintenant que C a rejoint. 1 + 2 = 3.  </p>\n<p>Si l’on ajoute un autre enfant (par exemple D) ils doivent serrer la main de A, B et C et tous les autres se dérouleront quand-même. Alors il y aura 1+2+3=6 poignées de main</p>\n<p>Si l’on ajoute un autre enfant au groupe de 4, il y aura 4 poignées de main en plus. Alors 1+2+3+4=10 poignées de main.</p>\n<p>Si on suit ce modèle, on peut trouver que la réponse pour 8 enfants est 1+2+3+4+5+6+7=28.</p>\n<p>Une autre manière d’y penser est que si vous êtes l’un des 8 enfants, il faut que vous vous serriez la main avec les 7 autres personnes. Ainsi que tous les autres dans la fête. Puisqu'il y a 8 d’entre vous, et vous serrez la main avec 7 autres personnes, il devrait avoir 8×7 poignées de main. Cependant, comme il faut 2 personnes pour serrer la main, nous avons compté chaque poignée de main deux fois. Il faut donc diviser par deux et la réponse est 8×7 ∕ 2 = 28 </p>"
  },
  "extension_1": {
    "statement": "<p>Toute l’école est venue à la fête d'anniversaire: il y a maintenant 100 enfants! Combien de poignées de main se déroulent le = accord ?</p>",
    "hint": "<p>Est-ce que vous pouvez trouver une formule pour le nombre de poignées de main quand il y a n enfant à la fête d’anniversaire? Pensez à la stratégie que vous aviez utilisée pour répondre à la question précédente et essayez de la généraliser pour quelconque de tous les = pas sûre pour la traduction de any nombres d'enfants.</p>",
    "correct_answer": "4950",
    "explanation": "<p>En généralisant ce que vous avez trouvé auparavant, vous pouvez créer une règle qui est, pour une fête d’anniversaire avec n enfants vous avez 1 + 2 + … + (n - 1) poignées de mains. Vous réaliserez que vous pouvez ensuite utiliser une formule (n×(n - 1) ∕ 2) pour calculer le nombre de poignées de mains. Pour 100 enfants il y a 100×99 ∕ 2 = 4950 poignées de mains. Ceci est la même chose que d’ajouter les nombres 1 + 2 + 3 + …+ 99.</p>"
  },
  "extension_2": {
    "statement": "<p>Une plus grande école a eu une fête. Il y avait 28680 poignées de mains! Combien d’enfants y avait-il?</p>",
    "hint": "<p>Try using the formula we have derived for the total number of handshakes for n children.</p>",
    "correct_answer": "240",
    "explanation": "<p>La formule pour le nombre de poignées de mains pour n enfants est n×(n - 1) ∕ 2. On a besoin de trouver la valeur de n tel que n×(n - 1) ∕ 2=28680. En multipliant par deux cela nous donne n×(n - 1) = 57360. Remarquez qu’on veut à peu près n×n = 57360 donc essayez de prendre la racine carré de 57360. Ceci nous donne 239.49947… Alors essayons 240, ce qui nous donne en effet 240×239/2 = 28680.</p>"
  },
  "additional_information": {
    "about": "<p>Ceci est un puzzle classique qui existe depuis de nombreuses années. Il y a plusieurs stratégies de résolution du problème qui peuvent être utilisées pour trouver la solution - mimer, dessiner un diagramme, chercher une tendance, résoudre un problème plus simple, créer une liste organisée, faire un tableau, utiliser un raisonnement logique… La solution à des propriétés mathématiques profondes et est un résultat clé dans le domaine de la combinatoire. Le nombre de poignées de mains est toujours un nombre triangulaire. Les premiers dix nombres triangulaires sont 1, 3, 6, 10, 15, 21, 28, 36, 45, 55, …</p>",
    "references": [
      "<p><a href=\"https://nrich.maths.org/6708\" target=\"_blank\">https://nrich.maths.org/6708</a></p>",
      "<p><a href=\"https://www.nctm.org/Publications/Teaching-Children-Mathematics/Blog/Reflecting-on-the-Handshake-Problem/\" target=\"_blank\">https://www.nctm.org/Publications/Teaching-Children-Mathematics/Blog/Reflecting-on-the-Handshake-Problem/</a></p>",
      "<p><a href=\"https://www.mathsisfun.com/algebra/triangular-numbers.html\" target=\"_blank\">https://www.mathsisfun.com/algebra/triangular-numbers.html</a></p>",
      "<p><a href=\"https://en.wikipedia.org/wiki/Triangular_number\" target=\"_blank\">https://en.wikipedia.org/wiki/Triangular_number</a></p>"
    ]
  }
}