{
  "title": "Les parts de gâteau",
  "metadata": {
    "type": "counting"
  },
  "main_version": {
    "statement": "<p>Quel est le plus grand nombre de morceaux d'un gâteau circulaire que vous pouvez obtenir avec 5 coupes droites ? Les coupes doivent être faites sur le dessus du gâteau.</p>",
    "correct_answer": "16",
    "hint": "<p>Commencez par un petit nombre de coupes, par ex. 1, 2, 3. Comment pouvez-vous ajouter une autre coupe pour obtenir le plus grand nombre de pièces ? Rappelez-vous qu'il ne dit pas que les pièces doivent être de la même taille ! Que se passe-t-il si plusieurs coupes passent par le même point ?</p>",
    "explanation": "<p>Avec une coupe, vous obtenez toujours 2 pièces. Avec deux coupes, vous pouvez obtenir 4 pièces. Avec trois coupes, si toutes les coupes passent par le même point, vous obtenez 6 pièces. Cependant, vous pouvez obtenir 7 pièces si la troisième coupe ne passe pas par le même point que les deux précédentes. Utilisez cette idée pour obtenir le nombre maximum avec quatre coupes. Donc, pour obtenir le plus de morceaux, assurez-vous que pas plus de deux coupes passent par le même point, sinon vous obtenez moins de morceaux. Avec quatre coupes, vous pouvez obtenir 11 pièces. Recommencez la même chose pour cinq coupes, commencez par les quatre coupes qui donnent 7 pièces et ajoutez une coupe sans passer par aucun point de rencontre (intersections) et vous pouvez obtenir 16 pièces.</p>\n<p><img alt=\"\" src=\"assets/images/Pieces_of_Cake_image_0.png\" class=\"Pieces_of_Cake_image_0\" /></p>"
  },
  "extension_1": {
    "statement": "<p>Quel est le plus grand nombre de morceaux de gâteau que vous pouvez obtenir avec 7 coupes ?</p>",
    "hint": "<p>Au fur et à mesure que le nombre de coupes augmente, le dessin et le comptage peuvent être trop compliqués : pouvez-vous repérer le motif dans la séquence de nombres obtenue à partir des exemples précédents ? Pour 7 coupes, calculez d'abord la réponse pour 6 coupes, puis utilisez ce résultat.</p>",
    "correct_answer": "29",
    "explanation": "<p>Vous vous rendez peut-être compte qu'il existe une formule pour obtenir le numéro suivant dans la séquence à partir du précédent. Vous pouvez le voir en calculant le nombre de nouvelles pièces créées lorsque vous ajoutez une coupe supplémentaire. Par exemple, ajouter une quatrième coupe à 7 pièces obtenues à partir de 3 coupes ajoute 4 nouvelles pièces (11). L'ajout d'une cinquième coupe à cela ajoute 5 nouvelles pièces (16). (Pouvez-vous voir pourquoi cela est vrai en général en pensant à la façon dont nous croisons les coupes existantes pour créer le plus de pièces ?)</p>\n<p>Donc si C est le nombre de coupes et P(C) est le nombre maximum de pièces de C coupes, alors la formule est : </p>\n<p>P(C + 1) = P(C) + C + 1</p>\n<p>Donc :\n P(6) = P(5) + 5 + 1 = 16 + 6 = 22 \nP(7) = P(6) + 6 + 1 = 22 + 7 = 29</p>"
  },
  "extension_2": {
    "statement": "<p>Pouvez-vous calculer le plus grand nombre de pièces que vous pouvez obtenir avec 99 coupes ?</p>",
    "hint": "<p>Once you've found out the pattern, try to find a simple formula for the maximum number of pieces. Triangular numbers might help.</p>",
    "correct_answer": "4951",
    "explanation": "<p>Nous avons trouvé la formule P(C + 1) = P(C) + C + 1 pour le nombre maximum de pièces donnant les coupes. Cependant, ce n'est pas pratique à utiliser pour le cas de 99 coupes car il faudrait d'abord connaître le nombre de pièces pour 98 coupes, puis le nombre de pièces pour 97 coupes, et ainsi de suite. Vous devez penser comment obtenir la formule explicite : P(C) = ½×C×(C + 1) + 1.</p>\n<p>Soit par intuition, soit en utilisant la formule pour remonter de P(C) à P(1) : P(C) = P(C - 1) + C - 1 + 1 </p>\n<p>= P(C - 1) + C  </p>\n<p>= P(C - 2) + (C - 1) + C</p>\n<p>= P(C - 3) + (C - 2) + (C - 1)  + C</p>\n<p>… </p>\n<p>= P(1) + 2 + 3 … + (C - 2) + (C - 1) + C</p>\n<p>= 2 + (2 + 3 + … + C)</p>\n<p>= 1 + (1 + 2 + 3 + … + C) </p>\n<p>= 1 + ½×C×(C + 1)</p>\n<p>La dernière étape est obtenue à partir de ce que nous savons sur les nombres triangulaires. Par conséquent, P(99) = ½×99×100 = 4951.</p>\n<p>Ce problème est lié au nombre de régions (morceaux du gâteau) dans un plan délimité par une configuration générique de lignes (coupes). \"Générique\" signifie qu'il n'y a pas de lignes parallèles et que pas plus de deux lignes se croisent aux mêmes points. Cela garantit que le nombre de parts de gâteau est maximal. Étant donné C lignes sur un plan (dans une configuration générique), puis ajouter une ligne supplémentaire telle qu'elle coupe toutes les lignes précédentes créerait (C + 1) nouvelles régions (autour de chaque point d'intersection de la nouvelle ligne avec les précédentes, nous ajouter deux nouvelles régions. Cependant, l'un des deux est également compté au point d'intersection suivant). Cela conduit à P(C + 1) = P(C) + C + 1.</p>"
  },
  "additional_information": {
    "about": "<p>Si vous pouviez couper le gâteau dans n'importe quelle direction, pas seulement par le haut, avec seulement trois coupes, vous pourriez le couper en 8 morceaux (au lieu de seulement 6) !</p>",
    "references": [
      "<p><a href=\"http://www.murderousmaths.co.uk/teacher/pizza.htm\" target=\"_blank\">http://www.murderousmaths.co.uk/teacher/pizza.htm</a></p>"
    ]
  }
}