{
  "title": "Gomoku",
  "metadata": {
    "type": "game"
  },
  "main_version": {
    "statement": "<p>Commencez par dessiner une grille carrée de 15 par 15 lignes. Deux joueurs prennent chacun son tour de placer une pièce sur n'importe quel point où les lignes se croisent. Le joueur qui parvient à avoir cinq de ses compteurs sur une ligne droite gagne, la ligne peut être verticale, horizontale ou diagonale.</p>",
    "further_instructions": "<p>Ce jeu est traditionnellement joué avec des pièces noir et blanc, mais vous pouvez utiliser des pièces différents ou de petits morceaux de papier. Vous pouvez aussi dessiner la grille en stylo et ensuite utiliser marquer avec un crayon x ou o pour chaque joueur et ensuite les éffacer à la fin pour pouvoir utiliser la grille de nouveau.</p>",
    "strategy_tips": "<p>Il est très important de regarder le placement de votre adversaire et d'essayer de faire une ligne de 5 vous-même. Si votre adversaire a trois pièces dans une rangée sans rien à chaque extrémité - cela s'appelle \"3 ouvert\" - alors ce serai une bonne idée d'utiliser votre tour pour bloquer une extrémité. S'ils réussissent à \"4 ouvert\", vous avez certainement perdu! Une bonne stratégie d'attaque pourrait être de viser pour avoir deux lignes perpendiculaire de 3 ouvert- comme une croix - de sorte qu'il est très difficile pour votre adversaire de défendre.</p>"
  },
  "extension_1": {
    "statement": "<p>Pour les joueurs avancés, le premier joueur a un énorme avantage. Cet avantage peut être éléminé en démarrant la partie en utilisant la règle \"Échangez 2\". Disons qu'au début de la partie le joueur un est les croix (x) et que le joueur deux est les cercles (o).</p>\n<p>Le joueur 1 commence le jeu en marquant 3 intersections (deux avec x, et une avec o), le joueur 2 choisit alors une de ces trois options (i) il prend des croix, terminant son tour (le joueur 1 devient des cercles et c'est maintenant son tour), (ii) il reste en tant que cercles et ajoute un cercle comme normal, (iii) il ajoute deux cercles au plateau, mais le joueur 1 peut maintenant décider s'il veut voler des cercles. Après cela, le jeu se poursuit comme d'habitude.  </p>"
  },
  "additional_information": {
    "about": "<p>Il y a un tournoi de Championnat du Monde pour Gomuku. Depuis 2009, ils utilisent la règle Échangez 2 pour en faire un jeu équitable, quel que soit le début. Il y a aussi des championnats pour que les ordinateurs jouent à Gomuku! A cause de cela, ils y a certains qui écrivent un programme d'intelligence artificielle en sorte que leur programme joue contre le programme de quelqu'un d'autre pour voir qui gagne. Il y a aussi des compétitions d'ordinateur contre des humains - en 2017 un ordinateur appelé Yixin a battu le champion du monde humain Rudolf Dupszki 2-0.</p>",
    "references": [
      "<p><a href=\"https://en.wikipedia.org/wiki/Gomoku\" target=\"_blank\">https://en.wikipedia.org/wiki/Gomoku</a></p>"
    ]
  }
}