{
  "title": "L’Épée de Josephus",
  "metadata": {
    "type": "puzzle"
  },
  "main_version": {
    "statement": "<p>Les pions numérotés de 1 à 52 sont placés en cercle. En commençant par le numéro 2, les pions alternés sont renversés jusqu'à ce qu'il n'en reste plus qu'un.</p>\n<p>Quel est le numéro du dernier pion à abattre ?</p>",
    "correct_answer": "41",
    "hint": "<p>Que se passe-t-il si vous n'aviez que 2 pions ? Qu'en est-il de 3, 4, 5, 6, 7 ou 8 pions ? Pouvez-vous repérer le modèle après avoir examiné ces cas ?</p>",
    "explanation": "<p>En commençant avec seulement 2 pions, nous savons que le dernier pion à renverser serait le numéro 1. Nous pouvons déterminer quel serait le dernier pion si nous augmentons le nombre de pions. Pour commencer, nous enregistrons nos résultats et recherchons un modèle.</p>\n<p>2 - 1</p>\n<p>3 - 3</p>\n<p>4 - 1</p>\n<p>5 - 3</p>\n<p>6 - 5</p>\n<p>7 - 7</p>\n<p>8 - 1</p>\n<p>9 - 3</p>\n<p>Et ainsi de suite. Chaque puissance de deux (1, 2, 4, 8 …) réinitialise la dernière cheville debout pour être numéro 1. Vous pouvez voir que le numéro de la dernière cheville debout monte en nombres impairs après cela. Pour trouver la réponse pour 52, nous savons que la dernière réinitialisation était la plus grande puissance de deux. La plus grande puissance de deux en dessous 52 est 32, et 52-32 = 20. Donc c’est le vingtième nombres impair qui est calculé comme 2x20 +1 =41.  </p>"
  },
  "extension_1": {
    "statement": "<p>Les pions (chevilles) numérotées 1 à 2000 sont placées dans un cercle. Commençant avec le numéro 2, les chevilles sont renversées alternativement jusqu'à qu'il n'y en ait plus qu'un qui reste.</p>\n<p>Quel est le numéro du dernier pion à abattre ?</p>",
    "hint": "<p>Quelle est la plus grande puissance de 2 (1, 2, 4, 8, ...) inférieure à 2000 ?</p>",
    "correct_answer": "1953",
    "explanation": "<p>La plus grande puissance de deux en dessous de 2000 est 1024. Car 2000 - 1024 = 976, la dernière cheville va être le 976 eme nombre impair, 976x2 + 1 = 1953.</p>"
  },
  "additional_information": {
    "about": "<p>La légende de ce puzzle parle d’un groupe de soldats dans un cercle. </p>",
    "references": [
      "<p><a href=\"https://lycee.samicharity.co.uk/2016/10/20/sword-of-josephus/\" target=\"_blank\">https://lycee.samicharity.co.uk/2016/10/20/sword-of-josephus/</a></p>"
    ]
  }
}