{
  "title": "Chaussettes mélangées",
  "metadata": {
    "type": "puzzle"
  },
  "main_version": {
    "statement": "<p>Vous avez une paire de chaussettes rouges, une paire de chaussettes bleues, une paire de chaussettes jaunes et une paire de chaussettes vertes. De combien de façons pouvez-vous les mélanger et former de nouvelles paires de telle façon que toutes les nouvelles paires soient dépareillées (de couleur différente) et aucune de ces nouvelles paires dépareillées soit la même qu’une autre paire dépareillée ? </p>",
    "correct_answer": "3",
    "hint": "<p>Commencez en assortissant une des rouges avec une des vertes, et l’autre rouge avec une bleue. Vous pourriez écrire cela ainsi : RB, RY. Quelles seront les deux autres paires ? </p>",
    "explanation": "<p>Vous pouvez résoudre ce problème en écrivant la liste de toutes les options. Vous pourriez avoir RB, RY, YG, BG ou RB, RG, GY, BY or RY, RG, YB, GB. Vous pourriez aussi le résoudre en pensant que, en commençant avec les chaussettes rouges, il y a trois différentes couleurs qui peuvent être associées pour les deux chaussettes. Si vous choisissez RB et RY pour les deux premières paires, vous pouvez ensuite mettre BY ensemble car cela laisserait GG pour la dernière paire, ce qui n’est pas autorisé. Donc une fois que vous avez choisi les deux couleurs qui vont avec rouge, il n’y a plus aucun choix à faire. Il y a trois façons de choisir deux couleurs en partant d’un choix de trois, donc la réponse est 3.</p>"
  },
  "extension_1": {
    "statement": "<p>Vous avez cinq paires de chaussettes, chacune d’une couleur différente (rouge, bleue, jaune, verte, orange). Mélangez-les et formez de nouvelles paires de façon telle que toutes les nouvelles paires sont dépareillées et aucune des nouvelles paires (dépareillées) est la même qu’une autre nouvelle paire (dépareillée). </p>\n<p>De combien de façons pouvez-vous les mélanger et former de nouvelles paires en utilisant cette méthode ?</p>",
    "hint": "<p>Commencez avec deux chaussettes rouges. Pouvez-vous trouver combien de combinaisons permettent de choisir les deux couleurs que l’on peut assortir avec ces deux chaussettes ?</p>",
    "correct_answer": "12",
    "explanation": "<p>En commençant avec les chaussettes rouges, il y a quatre différentes couleurs qui pourraient être mises en paire avec ces deux chaussettes. Si vous choisissez RB et RY comme les deux premières paires, donc vous ne pouvez pas avoir BY comme paire. La raison est que cela laisserait deux chaussettes vertes et deux chaussettes orange et vous ne pouvez pas avoir GG ou OO et vous ne pouvez pas avoir deux fois GO. Vous pourriez mettre en paire la seconde chaussette bleue avec une verte ou une orange. Dès qu’une combinaison est choisie, les autres deux paires sont établies. Par exemple, RB, RY, BG donc ce doit être OG et OY. </p>\n<p>Il y a six façons de choisir deux couleurs parmi un choix de quatre, et ensuite deux façons de choisir une couleur d’un choix de deux donc la réponse est 6x2=12.</p>"
  },
  "extension_2": {
    "statement": "<p>Imaginez que vous ayez un sac avec 3 billes rouges, un sac avec 3 billes bleues, un sac avec 3 billes vertes et un sac avec 3 billes jaunes. Si l’ordre des sacs n’a aucune importance, de combien de façons peut-on mélanger et arranger les billes dans 4 sacs différents avec 3 billes de couleur différente?</p>",
    "hint": "<p>In addition to thinking about the consequences of a certain color being included in a certain bag, consider the consequence of a particular color marble not being chosen for, say, the first bag.</p>",
    "correct_answer": "1",
    "explanation": "<p>Dans un problème comme celui -ci, cela aide de penser d’abord à la couleur de la bille qui n’est pas choisie pour être inclue dans le premier sac. Comme nous avons trois couleurs et sacs qui contiennent trois billes et comme nous ne pouvons pas avoir deux billes de la même couleur dans le même sac, il y a quatre façons de remplir le premier sac (pensez ainsi : Dans chaque combinaison possible, une couleur est exclue, et avec quatre couleurs de billes, il y a quatre couleurs potentielles à exclure du premier sac. Donc, qu’est-ce que cela veut dire pour la couleur qui n’était pas incluse dans le premier sac. Referrons-nous aux trois couleurs inclues dans le premier sac comme a, b et c. Donc d devient la couleur qui était exclue. Sachant que nous ne pouvons pas avoir deux billes de la même couleur dans aucun sac, chacun des sacs qui reste doit contenir au moins une bille d. \nMaintenant passons au second sac. Le second sac contient déjà une bille de couleur d et a seulement de la place pour deux autres. Il reste trois couleurs au choix donc, une nouvelle fois, il vaut mieux penser à la couleur que nous allons exclure. On doit choisir 2 billes d’une liste de 3 donc on doit en exclure 1. Quelle que soit la couleur que l’on exclut, il en restera deux qui doivent aller dans les deux sacs restants. Les couleurs qui étaient inclues dans le second sac ont chacune une bille qui reste à inclure dans un sac. \nOn arrive maintenant au troisième sac qui a déjà une bille de la couleur exclue du premier sac et une bille de la couleur exclue du second sac. Puis nous avons deux options au choix et celle que nous ne choisirons pas ira dans le quatrième sac dont la couleur a déjà été décidée. \nNous avons donc 4x3x2x1=24 façons de placer les billes dans les quatre sacs. Parce que l’ordre des sacs n’a pas d’importance, nous devons diviser ce nombre par le nombre de façons de commander les quatre sacs, ce qui est équivalent a 4x3x2x1=24. Donc nous arrivons à 24/24=1.</p>"
  },
  "additional_information": {
    "about": "<p>Pour quatre différentes paires de chaussettes, si elles étaient non rangées dans un tiroir et que vous fermiez vos yeux et les rangiez ensemble au hasard, il y aurait 1% de chance de les assortir parfaitement et 46% de chance de les assortir complètement de travers comme dans un puzzle.</p>",
    "references": [
      "<p><a href=\"https://nrich.maths.org/166\" target=\"_blank\">https://nrich.maths.org/166</a></p>"
    ]
  }
}