{
  "title": "Restaurant",
  "metadata": {
    "type": "puzzle"
  },
  "main_version": {
    "statement": "<p>Dans un restaurant, chaque table a 3 pieds, chaque chaise a 4 pieds et tous les clients et les trois membres du personnel ont 2 pieds chacun. Il y a quatre chaises à chaque table. Les trois quarts des chaises sont occupées par des clients et il y a 206 pieds au total dans le restaurant. Combien de chaises le restaurant a-t-il ?</p>",
    "correct_answer": "32",
    "hint": "<p>Pouvez-vous déterminer combien de pieds il y a à chaque table si les trois quarts des chaises sont occupées par des personnes ?</p>",
    "explanation": "<p>Les trois membres du personnel ont six pattes, alors retirez cela du total, ce qui donne 206 - 6 = 200. Maintenant, les tables, les chaises et les clients ont 200 pattes. En moyenne, à chaque table il y a 3 pieds de table, 16 pieds de chaise et 6 pieds clients (puisque seulement les trois quarts des chaises sont prises). Cela donne 3 + 16 + 6 = 25 pieds par table. Le nombre de tables est donc 200 ∕ 25 = 8, donc le nombre de chaises est 8×4 = 32. </p>"
  },
  "extension_1": {
    "statement": "<p>J'ai 30 pièces. Certaines des pièces sont de 1 ¢, d'autres de 2 ¢ et d'autres de 6 ¢. La valeur des pièces de 6 ¢ vaut le même montant que la valeur totale des pièces de 1 ¢ et des pièces de 2 ¢ combinées. Étant donné que j'ai un nombre différent de chaque type de pièce, quelle est la valeur totale de toutes les pièces (en ¢) ?</p>",
    "hint": "<p>Commencez par considérer combien de pièces de 6 ¢ je pourrais avoir... si j'en ai trop, je ne pourrai pas faire correspondre leur valeur avec les pièces de 1 ¢ et les pièces de 2 ¢.</p>",
    "correct_answer": "84",
    "explanation": "<p>D'abord, nous supposons que nous avons des pièces de 8 × 6 ¢, cela a une valeur de 48 ¢, avec 22 pièces restantes. La valeur cible est toujours un multiple de six et donc paire, nous aurons donc besoin d'un nombre pair de 1 ¢ pour obtenir le nombre pair. Le plus grand total pair parmi le reste des pièces est de 20x2 ¢ + 2x1 ¢ = 42 ¢, soit moins de 48 ¢.</p>\n<p>Donc, au plus, nous pouvons avoir 7 × 6 ¢ = 42 ¢, avec 23 pièces restantes. Dans ce cas, le total pair le plus élevé est 21x2 ¢ + 2x1 ¢ = 44 ¢. Notre objectif était de 42 ¢, donc nous incluons plus de pièces de 1 ¢ et moins de pièces de 2 ¢. Le total pair suivant le plus élevé est de 19x2 ¢ + 4x1 ¢ = 42 ¢, atteignant notre objectif.</p>\n<p>Par conséquent, la valeur totale de toutes les pièces est de 7 × 6 ¢ + 19 x 2 ¢ + 4 x 1 ¢ = 84 ¢.</p>\n<p>Pour être complet, le plus petit nombre de pièces de 6 ¢ est 5 (choisir 4 donne un total de 24 ¢ avec 26 pièces restantes). La solution avec 5×6¢ est 5×2¢ et 10×1¢. La solution pour 6 × 6 ¢ est 12 × 2 ¢ et 12 × 1 ¢. Cependant, aucune de ces solutions n'a une quantité différente de chaque pièce.</p>"
  },
  "additional_information": {
    "about": "<p>Ce puzzle était à l'origine un problème d'un défi de mathématiques UKMT  </p>",
    "references": [
      "<p><a href=\"https://nrich.maths.org/2458\" target=\"_blank\">https://nrich.maths.org/2458</a></p>",
      "<p><a href=\"https://www.ukmt.org.uk/\" target=\"_blank\">https://www.ukmt.org.uk/</a></p>"
    ]
  }
}