{
  "title": "-> Mélanger les Cartes",
  "metadata": {
    "type": "funfact"
  },
  "main_version": {
    "statement": "<p>-> Si on mélange un packet de carte correctement, il est plus probable que l'orde de cartes a présent n'a jamais été vu a auparavant dans l'histoire de l'univers.</p>",
    "hint": "<p>Combien d'ordre specifique de 52 cartes existe-t'il? Peut-etre ceci est trop compliqué pour commencer. Essayons avec un nombre de 3 cartes, combien d'arrangements uniques peut-on avoir? Maintenant essayez aves 4 cartes?</p>\n<p>Avec cette methode, est-ce qu'on peut arriver a 52 cartes?</p>",
    "explanation": "<p>Nous voulons déterminer le nombre de combinaisons différentes de 52 cartes. Commençons par penser à seulement 3 cartes. Nous pourrions comparer cela à la réflexion sur le nombre de façons dont 3 personnes pourraient s'asseoir sur trois chaises numérotées. N'importe laquelle des trois personnes pourrait s'asseoir sur la première chaise, puis l'une des 2 personnes restantes pourrait s'asseoir sur la deuxième chaise, puis il reste 1 personne qui n'aurait d'autre choix que de s'asseoir sur la seule chaise restante. Nous pouvons multiplier le nombre de choix pour chaque chaise (3×2×1 = 6) pour trouver combien de façons différentes il y a pour les 3 personnes à disposer. Il est intéressant de noter que le modèle ici prend le nombre initial puis se multiplie consécutivement par le plus petit entier suivant jusqu'à ce que vous atteigniez 1. Ce processus a un nom, il s'appelle <strong>Factoriel</strong>. Le symbole pour cela est !. par exemple. 3 ! = 6. Généralement, si vous voulez trouver le nombre de façons différentes de réorganiser n éléments, vous pouvez trouver n ! = n!×(n - 1)!×(n - 2)!×…×1 Le nombre de façons de mélanger 52 cartes est de 52 ! = 52×51×50×…×3×2×1 qui est à peu près égal à 8×10⁶⁷</p>"
  },
  "extension_1": {
    "statement": "<p>Prenez un jeu de 52 cartes, mélangez-les autant que vous le pouvez, puis essayez de deviner quelles cartes exactes seront les 3 premières cartes (dans l'ordre). Avez-vous bien compris votre estimation ? </p>\n<p>Maintenant on suppose qu'il y a un million de personnes en train de faire cette procédure exacte, on pourrais assumer que 7 personnes aient raison.</p>",
    "hint": "<p>Quelle est la probabilité de deviner correctement la carte du dessus?</p>",
    "explanation": "<p>La probabilité de deviner la carte du dessus est 1/52. La probabilité de deviner la deuxième carte est 1/51, est puis 1/50 pour la troisième. Donc la chance de savoir exactement les trois premières cartes est (1/52) x(1/51) x(1/50) = 0.0000075415. Multiplies ceci par les 1 000 000 individus vous donne 7.51478.. Donc on s'attends que seulement qu'a 7 personne on réussi â deviner correctement.</p>"
  },
  "additional_information": {
    "about": "<p>52! est à peu près 8×10⁶⁷. So quelqu'un mélangeait un paquet de cartes un fois par seconde depuis le début de l'univers (disons il y a environ de 14 billions d'années), il n'aurait que mélangé ce paquet de cartes seulement 10¹⁸ fois.</p>\n<p>Par conséquent, lorsque vous mélangez un paquet de cartes, il est presque certain que vous êtes la première personne à jouer avec des cartes dans cet ordre unique.</p>",
    "references": [
      "<p><a href=\"https://nrich.maths.org/5402\" target=\"_blank\">https://nrich.maths.org/5402</a></p>",
      "<p><a href=\"https://math.hmc.edu/funfacts/making-history-by-card-shuffling/\" target=\"_blank\">https://math.hmc.edu/funfacts/making-history-by-card-shuffling/</a></p>"
    ]
  }
}