{
  "title": "Pong Hau K'i",
  "metadata": {
    "type": "game"
  },
  "main_version": {
    "statement": "<p><img alt=\"\" src=\"assets/images/Pong_Hau_K_i_image_0.png\" class=\"Pong_Hau_K_i_image_0\" /></p>\n<p>Dessinez la grille montrée avec cinq points et sept lignes de\nconnexion. Deux joueurs placent deux pions de la même couleur/ du\nmême motif dans la grille comme indiqué.</p>\n<p>Décidez qui commencera en premier. Le premier joueur déplace une\nde ses pièces vers le point central. Ensuite, les joueurs\ndéplacent à tour de rôle un pion le long d'une ligne vers une case\nvide jusqu'à ce qu'un joueur ne puisse plus déplacer ses pions et\nperde.</p>",
    "further_instructions": "<p>Si les mêmes mouvements sont répétés trois fois, vous pouvez décider qu'il y a\négalité. Chaque fois que vous jouez, vous devez changer qui joue en premier ou\néchanger les positions de départ (si vous étiez dans les deux premières positions\nla première fois, prenez les deux dernières positions la prochaine fois)</p>",
    "strategy_tips": "<p>Pensez-vous que c'est mieux d'aller en premier ou en deuxième? Quelle est\nla position que vous devez atteindrepour bloquer l'autre joueur?</p>"
  },
  "extension_1": {
    "statement": "<p><img alt=\"\" src=\"assets/images/Pong_Hau_K_i_image_1.png\" class=\"Pong_Hau_K_i_image_1\" /></p>\n<p>Ce jeu s'appelle Shisima et se joue au Kenya. Deux joueurs ont chacun\nbesoin de 3 pions de la même couleur ou avec le même motif.</p>\n<p>Placez les pions sur trois points consécutifs sur les extrémités de l’octagone, de direction opposée. Il doit y avoir un point vide sur les deux extrémités du groupe des pions d’un joueur. </p>\n<p>Les joueurs font à chaque tour bouger leur pion d’une case dans une ligne. </p>\n<p>Afin de gagner, un joueur doit faire en sorte d’arranger ses trois pions dans\nune ligne, avec une pion sur le centre (shisima). </p>"
  },
  "extension_2": {
    "statement": "<p><img alt=\"\" src=\"assets/images/Pong_Hau_K_i_image_2.png\" class=\"Pong_Hau_K_i_image_2\" /></p>\n<p>Deux joueurs ont chacun besoin de 3 pions de la même couleur/motif. À tour\nde rôle, ajoutez un marqueur à la grille jusqu'à ce que les six marqueurs aient\nété placés. Ensuite, les joueurs déplacent à tour de rôle un pion sur une case\nvide jusqu'à ce qu'un joueur ait réussi à obtenir trois de ses pions d'affilée.</p>"
  },
  "additional_information": {
    "about": "<p>Pong Hau K'i est un simple jeu de société chinois. C'est aussi un jeu\ntraditionnel en Corée, où il est connu sous le nom de Ou-moul-ko-no. Des\njeux similaires se jouent au Togo. Si les deux joueurs jouent parfaitement, le\njeu devrait se terminer par un match nul.</p>",
    "references": [
      "<p><a href=\"https://multiculturalkidblogs.com/2015/09/28/traditional-chinese-game/\" target=\"_blank\">https://multiculturalkidblogs.com/2015/09/28/traditional-chinese-game/</a></p>",
      "<p><a href=\"https://en.wikipedia.org/wiki/Pong_Hau_K%27i\" target=\"_blank\">https://en.wikipedia.org/wiki/Pong_Hau_K%27i</a></p>",
      "<p><a href=\"https://www.whatdowedoallday.com/shisima/\" target=\"_blank\">https://www.whatdowedoallday.com/shisima/</a></p>",
      "<p><a href=\"https://www.whatdowedoallday.com/nine-holes-game\" target=\"_blank\">https://www.whatdowedoallday.com/nine-holes-game</a></p>"
    ]
  }
}