{
  "title": "Abattre ou\nknock-down",
  "metadata": {
    "type": "puzzle"
  },
  "main_version": {
    "statement": "<p>Les piquets numérotés de 1 à 50 sont placés dans l'ordre en ligne, avec le numéro 1 à gauche.</p>\n<p>Ils sont ensuite renversés, un par un, en suivant ces deux règles :</p>\n<p>(1.) En commençant par le premier piquet debout à gauche, les autres piquets sont renversés jusqu'à ce que la fin de la rangée soit atteinte.</p>\n<p>(2.) Chaque fois que la fin de la ligne est atteinte, répétez la règle précédente.</p>\n<p>Quel est le numéro du dernier pion à abattre ?</p>",
    "correct_answer": "32",
    "hint": "<p>Que se passe-t-il si vous n'aviez que 5 piquets ? Et 10 ou 20 ? Pouvez-vous repérer le motif ?</p>",
    "explanation": "<p>Départ: 1 2 3 4 5 6 7 8 9 ...</p>\n<p>Premier tour: ✕ 2 ✕ 4 ✕ 6 ✕ 8 ✕ ... seuls les nombres impairs restent</p>\n<p>Deuxième tour:  ✕ 4 ✕ 8 ✕ 12  ... seuls les multiples de 4 à restent</p>\n<p>Troixième tour:  ✕ 8 ✕ 16 ✕ 24  ... seuls les multiples de 8 restent</p>\n<p>Quatrième tour: Seuls les multiples de 16 resterons</p>\n<p>Cinquième tour: Seuls les multiples de 32 resterons.</p>\n<p>32 est le seul multiple de 32 plus petit que 50, donc 32 est le dernier piquet restant.</p>"
  },
  "extension_1": {
    "statement": "<p>Les piquets numérotés de 1 à 1050 sont placés dans l'ordre en ligne, avec le numéro 1 à gauche.</p>\n<p>Ils sont ensuite renversés, un par un, en suivant ces deux règles :</p>\n<p>(1.) En commençant par le premier piquet debout à gauche, les autres piquets sont renversés jusqu'à ce que la fin de la rangée soit atteinte.</p>\n<p>(2.) Chaque fois que la fin de la ligne est atteinte, répétez la règle précédente.</p>\n<p>Quel est le numéro du dernier pion à abattre ?</p>",
    "hint": "<p>Pouvez-vous trouver la puissance 2 la plus proche de 1050 par valeur inferieure?</p>",
    "correct_answer": "1024",
    "explanation": "<p>Comme précédemment, après le premier tour, nous n'avons que des multiples de 2. Le second ne laisse que des multiples de 4, le modèle se poursuit et chaque tour suivant ne laisse que des multiples de 8, 16, 32, ..., 512, 1024. Tous les multiples de 1024 (à l'exception de 1024 lui-même) sont plus grands que 1050, ce qui signifie que 1024 sera le dernier piquet restant.</p>"
  },
  "extension_2": {
    "statement": "<p>Les piquets numérotés de 1 à 10000050 sont placés dans l'ordre en ligne, avec le numéro 1 à gauche.</p>\n<p>Ils sont ensuite renversés, un par un, en suivant ces deux règles :</p>\n<p>(1.) En commençant par le premier piquet debout à gauche, cette fois-ci <strong>9 piquets sont renversés et la dixième est laissée debout</strong>, jusqu'à ce que la fin de la rangée soit atteinte.</p>\n<p>(2.) Chaque fois que la fin de la ligne est atteinte, répétez la règle précédente.</p>\n<p>Quel est le numéro du dernier pion à abattre ?</p>",
    "hint": "<p>Think about the sequence of pegs left in the previous parts 2, 4, 8, ... is there another way of writing down this sequence? In what way will the sequence change in this new case?  </p>",
    "correct_answer": "10000000",
    "explanation": "<p>Cette énigme est similaire aux parties précédentes. Dans ces cas, à chaque tour, nous avons laissé les multiples des puissances croissantes de 2. La séquence 2, 4, 8, 16,... peut s'écrire 2, 2², 2³, 2⁴,... </p>\n<p>Dans la nouvelle énigme, il ne reste que des multiples de puissances de 10. En effet, après le premier tour, il ne reste que des multiples de 10. Après le deuxième tour, il ne reste que des multiples de 100 = 10², après le troisième tour, il ne subsiste que des multiples de 1000 = 10³, et ainsi de suite. Ainsi 10000000 = 10⁷ sera le dernier piquet subsistant, car tous les autres multiples de 10⁷ sont plus grands que 10000050.</p>"
  },
  "additional_information": {
    "about": "<p>Cette énigme concerne en fait les puissances de 2 et les nombres binaires), et sa deuxième extension sur les puissances de 10 et les nombres décimaux.</p>",
    "references": [
      "<p><a href=\"https://nrich.maths.org/11677\" target=\"_blank\">https://nrich.maths.org/11677</a></p>"
    ]
  }
}