{
  "title": "Partage des cartes",
  "metadata": {
    "type": "puzzle"
  },
  "main_version": {
    "statement": "<p>Les enfants sont assis en cercle et un enseignant fait le tour du cercle en distribuant des cartes. L'enseignant donne un Valet à chaque deuxième enfant et une Reine à chaque troisième enfant.</p>\n<p>Après avoir fait quatre fois le tour, le sixième enfant dans le cercle, à partir d'où l'enseignant a commencé, a deux Valets et deux Dames.</p>\n<p>Quel est le plus petit nombre possible d’enfants dans le cercle ?</p>",
    "correct_answer": "7",
    "hint": "<p>Doit-il y avoir un nombre pair ou impair d'enfants dans le cercle ?</p>",
    "explanation": "<p>L'enseignant fait le tour du cercle quatre fois. S'il y avait un nombre pair d'enfants, le sixième enfant recevrait toujours un Valet à chaque fois et aurait quatre Valets à la fin. Puisqu'ils n'ont que deux Valets, il doit y avoir un nombre impair d'enfants dans le cercle.</p>\n<p>Le sixième enfant reçoit une Reine lors du premier tour parce que 6 est un multiple de 3. Elle ne reçoit qu'une seule Reine de plus, la réponse ne peut donc pas être un multiple de 3.</p>\n<p>Les options sont 7, 11, 13, 17, 19 … et donc 7 est le plus petit nombre d'enfants. </p>"
  },
  "extension_1": {
    "statement": "<p>Les enfants sont assis en cercle et un enseignant fait le tour du cercle en distribuant des cartes. L'enseignant donne un Valet à chaque deuxième enfant, une Reine à chaque troisième enfant et un Roi à chaque cinquième enfant. </p>\n<p>Après avoir fait quatre tours, le sixième enfant, d’où l'enseignant a commencé, a quatre Valets, deux Reines et pas de Rois.</p>\n<p>Quel devrait être le plus petit nombre d'enfants ?</p>",
    "hint": "<p>Imaginez si le nombre doit être impair ou pair et s'il doit être divisible par 3 ou 5.</p>",
    "correct_answer": "10",
    "explanation": "<p>L'enfant a reçu quatre Valets, il doit donc y avoir un nombre pair d'enfants, mais il n'a reçu que deux Reines, le nombre d'enfants ne peut donc pas être un multiple de 3. Comme l'enfant n'a pas reçu de Rois, 6 et 10 restent les deux possibilités (essayez de vérifier ceci avec des cartes ou un crayon et du papier). Mais 6 étant un multiple de 3, la réponse doit être 10. </p>"
  },
  "extension_2": {
    "statement": "<p>1000 enfants sont assis en cercle et un enseignant fait le tour du cercle en distribuant des cartes. L'enseignant donne un Valet à chaque deuxième enfant et une Reine à chaque troisième enfant</p>\n<p>Après que l'enseignant ait fait 1000 tours, combien de cartes aura au total le sixième enfant ?</p>",
    "hint": "<p>Which child will get a Queen next after the 999ᵗʰ child gets one on the first turn round?</p>",
    "correct_answer": "1334",
    "explanation": "<p>Il y a un nombre pair d'enfants de sorte que le sixième enfant sera toujours en position de recevoir un Valet à chaque tour. Il aura donc 1000 cartes de cette règle. Pour les Reines, au premier tour, les élèves, qui en recevront une, seront en position 3, 6, 9, 12, 15, ..., 999, puis ce sera 2, 5, 8, ..., 998, ensuite 1, 4, 7, ..., 997, 1000, et puis de retour à 3, 6, 9, ..., 999.  Ainsi, à chaque troisième tour, il recevra une Reine. Comme 1000 ∕ 3 fait 333 avec un reste de 1, il en recevra une au 1000ᵉ tour également. Alors 1000 + 334 = 1334 est le nombre total de cartes.  </p>"
  },
  "additional_information": {
    "about": "<p>Cette énigme a été écrite par un étudiant au Lycée français Charles de Gaulle pour une énigme de Noël impliquant la distribution de cadeaux rouges et bleus.</p>",
    "references": [
      "<p><a href=\"https://lycee.samicharity.co.uk/2018/12/03/wrapping-presents/\" target=\"_blank\">https://lycee.samicharity.co.uk/2018/12/03/wrapping-presents/</a></p>"
    ]
  }
}