{
  "title": "Différents Chemins",
  "metadata": {
    "type": "counting"
  },
  "main_version": {
    "statement": "<p>Il y a 5 différents chemins que vous pouvez emprunter pour vous rendre de la maison à l'école. Dans une semaine (de lundi à vendredi) vous aimeriez essayer un chemin différent chaque jour. De combien de façons différentes pouvez-vous organiser votre trajet vers l'école pour la semaine ? </p>",
    "correct_answer": "120",
    "hint": "<p>Pensez au nombre d'options dont vous disposez pour choisir le premier chemin, puis au nombre d'options dont vous disposez pour le second et ainsi de suite. Attention, vous ne pouvez pas choisir le même chemin deux fois dans la même semaine.</p>",
    "explanation": "<p>Vous avez 5 jours possibles de la semaine et vous souhaitez avoir un chemin différent par jour. Le premier jour, vous avez le choix entre 5 chemins. Le deuxième jour, il ne vous reste que 4 chemins à choisir, car vous ne pouvez pas prendre celui du lundi. Le troisième jour, vous avez le choix entre 3 chemins et ainsi de suite. La solution est donc 5×4×3×2×1 =120. Il s'agit de compter combien de façons vous pouvez ordonner 5 objets (chemins) dans 5 positions (jours de la semaine). Il s'agit d'un problème de <em>permutations</em> (sans répétition). </p>\n<p>Le symbole mathématique ! est appelé <em>factoriel</em> et représente la multiplication par des entiers décroissants jusqu'à atteindre 1. Donc 5×4×3×2×1 s'écrit 5!  </p>"
  },
  "extension_1": {
    "statement": "<p>Et si vous deviez aller à l'école le samedi et que vous trouviez un nouveau chemin ? De combien de façons pouvez-vous organiser votre semaine de telle sorte que chaque jour vous allez à l'école en empruntant des chemins différents ? </p>",
    "hint": "<p>Y a-t-il un moyen d'utiliser le résultat du problème précédent ? Pensez maintenant à combien de façons vous pouvez marcher jusqu'à l'école le lundi.</p>",
    "correct_answer": "720",
    "explanation": "<p>Vous avez maintenant 6 jours possibles de la semaine et 6 chemins différents. Vous aimeriez avoir un chemin différent par jour. La solution est obtenue en comptant combien de façons vous pouvez ordonner 6 objets (chemins) en 6 positions (jours de la semaine). La solution est obtenue sous la forme 6×5×4×3×2×1 = 720. Remarquez que cela fait 6×120 (6 fois la solution précédente). Vous venez de découvrir une propriété récursive de factoriels : n! = n×(n - 1)!.</p>"
  },
  "extension_2": {
    "statement": "<p>Et si vous deviez aller à l'école les dimanches et que vous trouviez quatre nouveaux chemins ? Il y a maintenant 10 chemins à choisir. De combien de façons pouvez-vous organiser votre semaine de telle sorte que chaque jour vous allez à l'école en empruntant des chemins différents ? </p>",
    "hint": "<p>Is this exactly the same style of problem as before? Think about how many ways you can now walk to school on Monday etc but when you get to Sunday there will still be more than one to choose from. </p>",
    "correct_answer": "604800",
    "explanation": "<p>Vous avez maintenant 7 jours possibles de la semaine et 10 chemins différents. Vous aimeriez avoir un chemin différent par jour. La solution est obtenue en comptant le nombre de façons dont vous pouvez ordonner 10 objets (chemins) dans 7 positions (jours de la semaine). La solution est obtenue par 10×9×8×7×6×5×4 = 604800. Si vous vouliez calculer ceci en utilisant les factoriels, 10! est proche de la réponse, mais nous ne désirons pas 3×2×1 à la fin. 3×2×1 est 3 ! nous pouvons donc faire 10 ! ∕ 3 ! =604800.  </p>"
  },
  "additional_information": {
    "about": "<p>Les factoriels ont été utilisés pour compter les permutations, au moins dès le Xiie siècle, par des savants indiens. La notation n! a été introduite par le mathématicien français Christian Kramp en 1808.</p>\n<p>Les factoriels deviennent grands très rapidement. 5! = 120, mais 20! = 2432902008176640000.</p>",
    "references": [
      "<p><a href=\"https://en.wikipedia.org/wiki/Factorial\" target=\"_blank\">https://en.wikipedia.org/wiki/Factorial</a></p>",
      "<p><a href=\"https://www.mathsisfun.com/numbers/factorial.html\" target=\"_blank\">https://www.mathsisfun.com/numbers/factorial.html</a></p>"
    ]
  }
}