{
  "title": "La conjecture de Collatz",
  "metadata": {
    "type": "funfact"
  },
  "main_version": {
    "statement": "<p>Pensez à un entier positif (nombre entier). S'il est pair, divisez-le par 2. S'il est impair, multipliez-le par 3 et ajoutez 1. Répétez le processus avec votre nouveau numéro et continuez. Arrêtez-vous si vous arrivez au chiffre 1. Personne ne sait s'il existe un nombre qui ne finit pas par 1.</p>",
    "hint": "<p>Par exemple, si vous choisissez le numéro 6, vous obtiendrez la séquence 6, 3, 10, 5, 16, 8, 4, 2, 1. Il a donc fallu 8 étapes pour arriver à 1. Essayez ceci avec vos propres nombres.</p>",
    "explanation": "<p>Cette activité est intéressante parce qu'il est facile a comprendre ses règles et de commencer à produire des séquences, mais personne ne sait si tous les chiffres se retrouvent à 1; c'est un problème non résolu en mathématiques. La séquence la plus longue pour un nombre plus petit que 100 est pour 97, qui prend 118 étapes mais finit quand même par 1. Le nombre juste avant, 96, ne prend que 12 étapes ! En utilisant des ordinateurs, tous le nombres jusqu'à environ 2.95×10²⁰ ont été vérifiés, et tous retombent à 1.</p>"
  },
  "extension_1": {
    "statement": "<p>Quel est le plus grand nombre qui prends exactemenet 8 étapes pour arriver à 1?</p>",
    "hint": "<p>Quel type de nombres descendent très rapidement vers 1 parce qu-ils suivent toujours la loi de division par 2?</p>",
    "correct_answer": "256",
    "explanation": "<p>Les séquences les plus courtes sont celles où vous pouvez toujours réduire de moitié ces nombres. Cela signifie qu'ils sont des puissances de 2, par exemple 1, 2, 4, 8, 16, 32, etc. comme ces nombres s'écoulent à 1. 256 reduit à 1 de 8 pas, chaque fois par dminuer de moitié: 256, 128, 64, 32, 16, 8, 4, 2, 1.</p>"
  },
  "additional_information": {
    "about": "<p>La conjecture porte le nom de Lothar Collatz, qui a introduit l'idée en 1937, deux ans après avoir reçu son doctorat. Depuis Collatz, de nombreuses personnes ont essayé de trouver une suite qui ne tend pas vers 1, ou bien pour prouver que toutes les suites tendent vers 1, mais personne n'a réussi. Il y a plusieurs prix à gagner si vous réussissez ! Le 8 septembre 2019, Terence Tao a prouvé que, en utilisant des échantillons de chiffres, presque tous les nombres finissent par atteindre une valeur qui est assez proche de 1. En gros, il a prouvé que 99% des valeurs initiales supérieures à 1 quadrillion finissent par atteindre une valeur inférieure à 200. C'est un grand pas en avant pour un problème aussi difficile ! </p>",
    "references": [
      "<p><a href=\"https://lycee.samicharity.co.uk/2017/03/17/collatz-conjecture/\" target=\"_blank\">https://lycee.samicharity.co.uk/2017/03/17/collatz-conjecture/</a></p>",
      "<p><a href=\"https://www.quantamagazine.org/mathematician-terence-tao-and-the-collatz-conjecture-20191211/\" target=\"_blank\">https://www.quantamagazine.org/mathematician-terence-tao-and-the-collatz-conjecture-20191211/</a></p>",
      "<p><a href=\"https://en.wikipedia.org/wiki/Collatz_conjecture\" target=\"_blank\">https://en.wikipedia.org/wiki/Collatz_conjecture</a></p>",
      "<p><a href=\"https://www.quantamagazine.org/cash-for-math-the-erdos-prizes-live-on-20170605/\" target=\"_blank\">https://www.quantamagazine.org/cash-for-math-the-erdos-prizes-live-on-20170605/</a></p>",
      "<p><a href=\"http://thescienceexplorer.com/universe/earn-two-thousand-dollars-solving-simple-math-problem\" target=\"_blank\">http://thescienceexplorer.com/universe/earn-two-thousand-dollars-solving-simple-math-problem</a></p>"
    ]
  }
}