{
  "title": "Gagnedeuxtroisquatre",
  "metadata": {
    "type": "game"
  },
  "main_version": {
    "statement": "<p>Retirez les 10, J, Q, K et les Jokers. Distribuez 9 cartes à chaque\njoueur (A = 1 ici). Les joueurs arrangent secrètement leurs cartes pour\nformer un nombre à 4 chiffres, un nombre à 3 chiffres et un nombre à 2\nchiffres. Tout à coup, les joueurs montrent leurs trois numéros.</p>\n<p>Le numéro à 2 chiffres le plus grand gagne 2 points, le numéro à 3\nchiffres le plus grand gagne 3 points, le numéro à 4 chiffres le plus\ngrand gagne 4 points. S’ il y a égalité, les points sont partagés\nentres les joueurs.</p>",
    "further_instructions": "<p>Vous pouvez jouer un certain nombre de tours ou jouer jusqu'à ce qu'un\njoueur atteigne un certain score, par exemple 25.</p>",
    "strategy_tips": "<p>Il est tentant de vous concentrer pour faire votre nombre de quatre\nchiffres le plus grand possible, mais peut-être que tous les autres\nessayent de faire cela aussi! Il est important de regarder comment\nvotre adversaire joue et d’essayer d’adapter votre stratégie.</p>"
  },
  "extension_1": {
    "statement": "<p>Essayez de jouer cela pour que le nombre de 2 chiffres le plus petit\nait 2 points, le nombre de 3 chiffres le plus petit ait 3 points et le\nnombre 4 chiffres le plus petit ait 4 points. </p>"
  },
  "additional_information": {
    "about": "<p>Ce jeu figurait dans le pack book du chef de Andrew Jeffrey a 52 jeux\net activités liés à des cartes. Il est simple de comprendre les règles\nmais très intéressant pour essayer de trouver une stratégie pour\ngagner.</p>",
    "references": [
      "<p><a href=\"http://andrewjeffrey.co.uk/product/leader-of-the-pack/\" target=\"_blank\">http://andrewjeffrey.co.uk/product/leader-of-the-pack/</a></p>",
      "<p><a href=\"https://www.jennettspark.bracknell-forest.sch.uk/wp-content/uploads/2020/04/52-Card-Activities-for-Mathematics.pdf\" target=\"_blank\">https://www.jennettspark.bracknell-forest.sch.uk/wp-content/uploads/2020/04/52-Card-Activities-for-Mathematics.pdf</a></p>"
    ]
  }
}