{
  "title": "Les Cartes perdues",
  "metadata": {
    "type": "puzzle"
  },
  "main_version": {
    "statement": "<p>Un petit nombre de cartes ont été perdues à partir d'un pack complet de 52. Je distribue des cartes aux joueurs jusqu'à ce que tous aient le même nombre de cartes et certaines cartes sont restantes. Si je donne à quatre joueurs, trois cartes restent. Si je distribue à trois joueurs, deux cartes restent et si je distribue à cinq joueurs, il reste deux cartes. Combien y a-t-il de cartes ?</p>",
    "correct_answer": "47",
    "hint": "<p>Pensez aux restes lors de la division. S'il y a deux restants lors de la division entre cinq personnes\nalors le nombre doit être deux fois plus qu'un\nmultiple de 5, par ex. 7 ou 32</p>",
    "explanation": "<p>Comme seul un petit nombre de cartes ont été perdues, commençons par lister les nombres qui fonctionnent et qui sont proches de 52.</p>\n<p>S'il ne restait plus de cartes lorsqu'elles étaient distribuées entre quatre personnes, nous saurions que le nombre de cartes était dans la table de multiplication par quatre, c'est-à-dire …, 36, 40, 44, 48. Mais il en reste trois, donc le nombre de cartes doit être dans la séquence …, 39, 43, 47, 51.</p>\n<p>Pour distribuer entre trois personnes les deux restants, nous obtenons la séquence …, 41,44,47,50</p>\n<p>Pour distribuer entre cinq personnes les deux restants, nous obtenons la séquence …, 32, 37,42,47</p>\n<p>Le nombre qui apparaît sur toutes les trois listes est 47.</p>\n<p>On pourrait aussi résoudre l'énigme en commençant par les deux derniers indices. Il reste le même nombre de cartes lorsqu'on distribue à trois ou cinq personnes, donc la réponse doit être deux de plus qu'un multiple de 15, donc 17, 32 ou 47. Le seul de ces nombres qui correspond au premier indice est 47 .</p>"
  },
  "extension_1": {
    "statement": "<p>Certaines cartes ont été perdues dans un paquet complet de 52. Si je distribue entre trois ou quatre personnes, il reste toujours deux cartes. Combien d'options différentes existe-t-il pour le nombre de cartes restantes ?</p>",
    "hint": "<p>Pensez aux multiples de 12.</p>",
    "correct_answer": "4",
    "explanation": "<p>Il doit y avoir deux de plus qu'un multiple de 12, car il y a deux de plus qu'un multiple de 3 et deux de plus qu'un multiple de 4. Il y a donc quatre nombres... à savoir 14, 26, 38, 50.</p>"
  },
  "extension_2": {
    "statement": "<p>Certaines cartes ont été perdues dans un paquet complet de 52. Si je distribue entre deux personnes, il reste une carte, et si je distribue entre quatre personnes, il reste deux cartes. Combien d'options différentes existe-t-il pour le nombre de cartes restantes ?</p>",
    "hint": "<p>Think about odd and even numbers.</p>",
    "correct_answer": "0",
    "explanation": "<p>Il y a 0 options car il est impossible d'avoir un nombre qui soit à la fois un de plus qu'un multiple de 2 (doit être impair) et deux de plus qu'un multiple de 4 (doit être pair).</p>"
  },
  "additional_information": {
    "about": "<p>Il existe un nom spécial pour l'opération consistant à diviser par un nombre et à trouver le reste en mathématiques - c'est ce qu'on appelle l'arithmétique <strong>mod</strong>ulaire. 47 mod 5 = 2 car lorsque vous divisez 47 par 5 vous avez un reste de 2. C'est une technique puissante en mathématiques pour prouver des faits sur les nombres. Nous l'utilisons dans la vie de tous les jours lorsque nous donnons l'heure avec une horloge de 24 heures. </p>\n<p>(18 + 8) mode 24 = 2 soit 8h après 18h c'est 2h du matin ! </p>",
    "references": [
      "<p><a href=\"https://betterexplained.com/articles/fun-with-modular-arithmetic/\" target=\"_blank\">https://betterexplained.com/articles/fun-with-modular-arithmetic/</a></p>"
    ]
  }
}