{
  "title": "Somme des cartes",
  "metadata": {
    "type": "game"
  },
  "main_version": {
    "statement": "<p>Retirez les cartes 10, J, Q, K et Joker et mélangez le reste du paquet.</p>\n<p><img alt=\"\" src=\"assets/images/Card_Sums_image_0.png\" class=\"Card_Sums_image_0\" /></p>\n<p>N'importe quel nombre de joueurs peut jouer. Distribuez 6 cartes face visible sur une table. Chacun a 1 minute pour décider comment les disposer dans le schéma ci-dessus afin d'obtenir le plus grand total des deux multiplications. A compte pour 1. Le joueur avec le score le plus élevé gagne.</p>",
    "further_instructions": "<p>Cela pourrait aider si tout le monde avait un stylo et du papier. Après une minute, chacun annonce son total le plus élevé. La personne qui prononce le nombre le plus élevé explique comment elle est parvenue à ce nombre, en disposant les cartes. S'ils ont raison, ils gagnent un point, s'ils sont incorrects, la personne ayant le total suivant le plus élevé tente de justifier sa réponse. Si deux personnes ont la même réponse, elles gagnent chacune un point.</p>",
    "strategy_tips": "<p>Pensez à l’endroit où il sera préférable de placer les plus grands nombres.</p>"
  },
  "extension_1": {
    "statement": "<p>Une fois les cartes J, Q, K et Joker retirées, distribuez 4 cartes à chaque joueur. Chaque joueur doit faire deux fractions avec ses cartes qui peuvent être additionnées, soustraites, multipliées ou divisées pour essayer de rendre la réponse la plus proche possible de 1. Quiconque parvient à en faire 1 obtient exactement 2 points. Si personne ne peut faire 1, alors le plus proche de 1 obtient 1 point.</p>"
  },
  "additional_information": {
    "about": "<p>Ces jeux figurent dans le livre Leader of the Pack d'Andrew Jeffrey, qui propose 52 jeux et activités à réaliser avec un jeu de cartes. Il existe une stratégie parfaite pour le jeu principal. </p>",
    "references": [
      "<p><a href=\"http://andrewjeffrey.co.uk/product/leader-of-the-pack/\" target=\"_blank\">http://andrewjeffrey.co.uk/product/leader-of-the-pack/</a></p>",
      "<p><a href=\"https://www.jennettspark.bracknell-forest.sch.uk/wp-content/uploads/2020/04/52-Card-Activities-for-Mathematics.pdf\" target=\"_blank\">https://www.jennettspark.bracknell-forest.sch.uk/wp-content/uploads/2020/04/52-Card-Activities-for-Mathematics.pdf</a></p>"
    ]
  }
}