{
  "title": "Aller à l'école",
  "metadata": {
    "type": "counting"
  },
  "main_version": {
    "statement": "<p>En quittant la maison (H) pour vous rendre à l'école (S), vous pouvez vous deplacer sur la grille 2 fois 5 qu'en faisant des pas vers l'est ou le nord. Combien de différents chemins pouvez-vous emprunter pour atteindre votre école ?</p>\n<p><img alt=\"\" src=\"assets/images/Going_to_School_image_0.png\" class=\"Going_to_School_image_0\" /></p>",
    "correct_answer": "21",
    "hint": "<p>Quel est le nombre total de pas que vous devez faire ? Pensez à quel moment vous pourriez faire les deux pas vers le nord.\nVous pouvez d'abord essayer de trouver la réponse pour une grille 2 fois 3 puis 2 fois 4.</p>",
    "explanation": "<p>Tout d'abord, nous pouvons nous rendre compte que, pour aller à l'école, vous devez faire au total, 2 pas vers le nord et 5 pas vers l'est. Si l'on considère la séquence de 2 + 5 = 7 pas (S1, S2, S3, S4, S5, S6 et S7), le problème revient à compter le nombre de façons de sélectionner 2 objets (les positions des deux pas vers le nord) parmi un total de 7 objets (le nombre total de positions des pas). Il y a 7 possibilités de choisir la position du premier pas vers le nord ; puis il y a 7 - 1 = 6 possibilités de choisir la position du deuxième pas vers le nord (\"-1\" parce qu'une position a déjà été choisie), donc vous obtenez 6×7 = 42. Cependant, l'ordre dans lequel vous avez choisi les 2 positions des pas vers le nord n'a pas d'importance : vous devez diviser par 2, pour obtenir la réponse finale de 21.</p>\n<p>Autrement, nous pourrions d'abord nous pencher sur des exemples plus simples.</p>\n<p>Supposons que N représente un pas vers le nord et E un pas vers l'est. </p>\n<p>Pour une grille 2 fois 2, nous pourrions avoir NNEE, NENE, NEEN, ENNE, ENEN, EENN (6 choix)</p>\n<p>Pour une grille de 2 fois 3, nous avons besoin d'un pas supplémentaire vers l'est. Nous pourrions ajouter un E à toutes les options ci-dessus. Nous manquerions alors toutes les routes qui ont eu N comme dernier pas. Il y en a 4, correspondant à l'autre N dans chacune des quatre premières positions.</p>\n<p>NNEE(E), NENE(E), NEEN(E), ENNE(E), ENEN(E), EENN(E) (6 choix) plus NEEEN, ENEEN, EENEN, EEENN (4 choix) = 10 choix</p>\n<p>Pour une grille 2 fois 4 il y a 10 + 5 = 15 choix</p>\n<p>Pour une grille 2 fois 5 il y a 15 + 6 = 21 choix</p>\n<p>En général, en comptant à partir de simples exemples, nous pouvons voir que chaque fois que vous augmentez de 1 le nombre total de pas n (tout en maintenant le nombre de pas vers le nord à 2), le nombre de façons d'aller à l'école augmente de n - 1. Cela est dû au fait que vous avez déjà compté les façons dont les pas vers le nord peuvent se trouver dans toutes les positions précédentes, de 1 à n - 1. Par conséquent, il vous suffit d'ajouter la possibilité que les deux pas vers le nord se trouvent dans la position n et dans n'importe quelle autre des n - 1 positions restantes. </p>"
  },
  "extension_1": {
    "statement": "<p>De combien de façons pourriez-vous atteindre votre école si elle était plus éloignée dans le coin supérieur droit d'une grille 2 fois 10 ? </p>",
    "hint": "<p>Pensez à la stratégie que vous avez utilisée pour répondre à la question précédente et essayez de généraliser dans le cas où l'école est dans le coin supérieur droit (nord-est) d'une grille 2 fois n. </p>",
    "correct_answer": "66",
    "explanation": "<p>Vous pouvez trouver une formule généralisant le raisonnement de la partie précédente : il y a n+2 possibilités de choisir la position du premier pas vers le nord ; puis il y a n+1 possibilités de choisir la position du deuxième pas vers le nord (1 de moins car une position a déjà été choisie), vous obtenez donc (n + 2)×(n + 1). Cependant, l'ordre dans lequel vous avez choisi les 2 positions des pas vers le nord n'a pas d'importance : vous devez alors diviser par 2.</p>\n<p>Alternativement, en généralisant ce que vous avez trouvé précédemment, vous pourriez trouver la règle selon laquelle, pour une grille 2 fois n, vous avez 1 + 2 + .... + (n + 1) chemins possibles vers l'école. Il existe un moyen rapide d'additionner ces nombres : (n + 1)×(n + 2) ∕ 2. </p>\n<p>On peut donc calculer la réponse pour une grille 2 fois 10 en faisant 12×11/2 = 66. </p>"
  },
  "extension_2": {
    "statement": "<p>De combien de façons pourriez-vous atteindre votre école si elle se trouvait dans le coin supérieur à droit d'une grille 4 fois 5 ? </p>",
    "hint": "<p>Think about how many ways there are to go the four steps north. Be careful not to count the same paths too many times.</p>",
    "correct_answer": "126",
    "explanation": "<p>Nous devons faire quatre pas vers le nord et cinq vers l'est. Une façon de le faire serait de suivre la séquence NNNNEEEEE. Nous devons trouver toutes les différentes façons de procéder. Considérons la position des quatre pas au nord. Appelons-les N₁, N₂, N₃, et N₄. N₁ pourrait être dans l'une des 9 positions, puis N₂ pourrait aller dans l'une des 8 qui restent, puis N₃ est l'une des 7 restantes et enfin N₄ dans l'une des 6 restantes. Cela nous donnerait 9×8×7×6 = 3024 choix. Mais en fait, nous ne voulons pas distinguer les quatre pas vers le nord. N₁N₂N₃N₄EEEEE est le même que N₂N₁N₃N₄EEEEE par exemple. Le 126 a donc inclus toutes les différentes façons dont les N₁ jusqu'à N₄ pourraient être arrangés. Nous devons maintenant déterminer combien de façons cela représente. Le N₁ pourrait être dans une des quatre positions, le N₂ dans une des trois, le N₃ dans une des deux et le N₄ dans celle de gauche. Cela nous donne 4×3×2×1 = 24 façons. On a donc surcompté d'un facteur 24. La réponse finale est 3024 ∕ 24 = 126. </p>"
  },
  "additional_information": {
    "about": "<p>Cette énigme consiste à trouver le nombre de façons de choisir r objets parmi n lorsque l'ordre n'a pas d'importance. Le mot mathématique pour cela est <strong>combinaisons</strong>, et il y a une formule pour les trouver : ⁿCᵣ = n! ∕ (r!×(n - r)!)</p>\n<p>Dans cette formule n! = n×(n - 1)×(n - 2)×...×1.</p>",
    "references": [
      "<p><a href=\"https://www.mathsisfun.com/combinatorics/combinations-permutations.html\" target=\"_blank\">https://www.mathsisfun.com/combinatorics/combinations-permutations.html</a></p>"
    ]
  }
}