{
  "title": "Buts marqués",
  "metadata": {
    "type": "counting"
  },
  "main_version": {
    "statement": "<p>Lors de la finale d'une coupe de football, le score était de 5 à 2. Dans combien d'ordres possibles les buts pouvaient-ils être marqués ?</p>",
    "correct_answer": "21",
    "hint": "<p>Imaginez la séquence de tous les buts et réfléchissez aux positions dans la séquence dans lesquelles la deuxième équipe de football peut avoir marqué ses 2 buts. Essayez de trouver la réponse dans les cas où le score était de 3 - 2 ou de 4 - 2.</p>",
    "explanation": "<p>Imaginez que le score n'était que de 3 à 2. Pensons à trois buts marqués par la première équipe (à domicile) (HHH) et deux buts marqués par la deuxième équipe (à l'extérieur) (AA). On pourrait essayer d'énumérer les possibilités. par exemple. AAHHH représenterait les deux premiers buts marqués par l'équipe à l'extérieur, puis les trois buts suivants marqués par l'équipe à domicile. Toutes les options pour les cinq buts sont : AAHHH, AHAHH, AHHAH, AHHHA, HAAHH, HAHAH, HAHHA, HHAAH, HHAHA, HHHAA. Il y a 10 options au total. Une façon de calculer cela est de penser qu'il y a 5 options pour un but à l'extérieur : _ <em> _ </em> _ il pourrait être dans l'une des 5 positions (par exemple A _ <em> _ </em >). L'autre but à l'extérieur pourrait être dans l'une des 4 positions restantes. On pourrait donc penser qu'il y aurait 5 × 4 = 20 façons de choisir où iraient les deux objectifs. Cependant, nous avons compté deux fois, car nous avons inclus chaque possibilité (par exemple AAHHH) deux fois (un but en position 1 et l'autre en position 2 mais aussi l'inverse). L'ordre dans lequel nous avons sélectionné les 2 buts de la deuxième équipe n'a pas d'importance : nous devons diviser par 2. Donc la réponse si le score était 5 - 2 est 5×4 ∕ 2 = 10. </p>\n<p>Pour la question de combien de façons les buts peuvent-ils être marqués si le score est de 5 à 2, nous pouvons utiliser la même logique. Il y a 7 possibilités pour sélectionner la position pour un but ; alors il y a 7 - 1 = 6 possibilités pour sélectionner la position de l'autre but (\"-1\" car une position a déjà été sélectionnée), donc on obtient 7×6 = 42. Cependant, l'ordre dans lequel vous avez sélectionné les 2 buts de l'équipe visiteuse n'a pas d'importance : il faut diviser par 2. On obtient donc 7×6 ∕ 2 = 21.</p>"
  },
  "extension_1": {
    "statement": "<p>Lors de la finale d'une coupe de football, le score était de 6 à 2. Dans combien d'ordres possibles les buts pouvaient-ils être marqués ? </p>",
    "hint": "<p>Réfléchissez à la stratégie que vous avez utilisée pour répondre à la question précédente et essayez de la généraliser pour n'importe quel nombre de buts marqués par la première équipe. </p>",
    "correct_answer": "28",
    "explanation": "<p>La réponse est 8×7 ∕ 2=28</p>\n<p>Ce problème équivaut à compter le nombre de façons dont vous sélectionnez 2 objets (les positions des deux buts de la deuxième équipe dans la séquence ci-dessus) à partir d'un total de n objets (le nombre total de positions des buts). Ceci est calculé par le nombre de <em>combinaisons</em> ⁿC₂=n ! ∕ (2!×(n-2)!) = n×(n - 1) ∕ 2. </p>\n<p>Dans cette formule n! = n×(n - 1)×(n - 2)×…×1</p>\n<p>Vous pouvez vous en servir pour trouver la formule généralisant le raisonnement de la partie précédente : il y a n possibilités pour sélectionner la position du premier but de la seconde équipe ; alors il y a (n - 1) possibilités pour sélectionner la position du deuxième but de la deuxième équipe (\"-1\" car onposition a déjà été sélectionnée), vous obtenez donc n×(n-1). Cependant, l'ordre dans lequel vous avez sélectionné les 2 positions pour les deux buts dans la séquence n'a pas d'importance : vous devez diviser par 2.</p>"
  },
  "extension_2": {
    "statement": "<p>Lors de la finale d'une coupe de football, le score était de 4 à 3. Dans combien d'ordres possibles les buts pouvaient-ils être marqués ?</p>",
    "hint": "<p>Think about how many goals have been scored in total. In how many positions could the first goal of the second team be scored? The second? The third?</p>",
    "correct_answer": "35",
    "explanation": "<p>Si nous pensons à la séquence de 4 + 3 = 7 buts (G₁, G₂, G₃, G₄, G₅, G₆ et G₇), alors le problème équivaut à compter combien de façons vous sélectionnez 3 objets (les positions des trois buts de la deuxième équipe dans la séquence ci-dessus) à partir d'un total de 7 objets (le nombre total de positions deles buts). Il y a 7 possibilités pour sélectionner la position du premier but ; alors il y a 7 - 1 = 6 possibilités pour sélectionner la position du second but (\"-1\" car une position a déjà été sélectionnée) ; il y a 7 - 2 = 5 possibilités pour sélectionner la position du troisième but (\"-2\" car deuxpostes ont déjà été sélectionnés). Vous obtenez donc 7×6×5 = 210. Cependant, l'ordre dans lequel vous avez sélectionné les 3 buts de la deuxième équipe n'a pas d'importance : vous devez diviser par le nombre de façons dont vous pouvez ordonner les 3 buts. Vous avez 3 façons de choisir le premier objectif ; alors vous avez 3 - 1 = 2 façons de choisir le second (\"-1\" car un objectif a déjà été sélectionné) ; il y a 3 - 2 = 1 possibilités pour sélectionner le troisième objectif (\"-2\" car deux objectifs ont déjà été sélectionnés) ; donc vous obtenez 3 × 2 × 1 = 6 façons de pouvoircommander 3 buts. Enfin, vous pouvez trouver le résultat en faisant : 210 ∕ 6 = 35.</p>\n<p>35 est la réponse au réarrangement HHHHAAA, tandis que 210 serait la réponse au réarrangement HHHHA₁A₂A₃.</p>"
  },
  "additional_information": {
    "about": "<p>La combinatoire est un domaine des mathématiques principalement concerné par le comptage. Deux grands aspects de la combinatoire sont la recherche de combinaisons et de permutations. Pour les combinaisons, l'ordre n'a pas d'importance - comme dans notre exemple de football, l'ordre dans lequel l'équipe à l'extérieur a marqué les buts ne nous dérangeait pas. Pour les permutations, l'ordre est important - par exemple, il existe six façons d'organiser les chiffres 123.</p>",
    "references": [
      "<p><a href=\"https://www.mathsisfun.com/combinatorics/combinations-permutations.html\" target=\"_blank\">https://www.mathsisfun.com/combinatorics/combinations-permutations.html</a></p>",
      "<p><a href=\"https://betterexplained.com/articles/easy-permutations-and-combinations/\" target=\"_blank\">https://betterexplained.com/articles/easy-permutations-and-combinations/</a></p>"
    ]
  }
}