{
  "title": "Vingt et un",
  "metadata": {
    "type": "game"
  },
  "main_version": {
    "statement": "<p>Deux joueurs prennent chaqun leur tour de compter vers le haut, à partir de 1 et comptant 1, 2 ou 3 chiffres à la fois. Chaque joueur continue à compter de l'endroit où l'autre joueur s'est arrêté. Le joueur qui doit dire 21 perd.</p>",
    "further_instructions": "<p>Une partie comme exemple: P1 = Joueur 1, P2 = Joueur 2. </p>\n<p>P1 : 1,2,3     P2 : 4 </p>\n<p>P1 : 5,6       P2 : 7,8,9 </p>\n<p>P1 : 10         P2 : 11,12,13</p>\n<p>P1: 14,15,16 P2:17,18,19</p>\n<p>P1: 20         P2: 21</p>\n<p>Le joueur 1 gagne!</p>",
    "strategy_tips": "<p>La personne qui dit 20 gagnera, parce qu'elle force la personne suivante à dire 21. Comment pouvez-vous vous assurer de dire 20 ? Essayez de marcher en arrière. Une fois que vous avez joué plusieurs fois, vous pouvez deviner qui va gagner avant d'atteindre 20 - pensez à la façon dont vous le savez. Pouvez-vous vous entraîner s'il vaut mieux commencer en premier ou en deuxième? Pouvez-vous vous être sûr que vous gagnez toujours?</p>"
  },
  "extension_1": {
    "statement": "<p>Il y a plusieurs façons de changer ce jeu. Vous pouvez dire jusqu'à 4 nombres consécutifs au lieu de 3, ou changer le nombre final de 21 à quelque chose de différent, ou bien encore changer la règle de sorte que le joueur qui dit 21 est maintenant le gagnant, et pas le perdant. Pouvez-vous toujours déterminer comment gagner dès que les règles sont modifiées? </p>\n<p>Le jeu original peut être changé pour un groupe de joueurs qui jouent dans un cercle, en commençant dans le sens des aiguilles d'une montre. Juste pour le plaisir, vous pouvez avoir de nouvelles règles, comme si quelqu'un dit deux chiffres d'affilé, la direction est inversée. Si quelqu'un dit trois chiffres d'affilée, vous sautez une personne dans le cercle. La personne qui dit 21 peut fabriquer une nouvelle règle. Par exemple: \"Au lieu du numéro 5, vous devez dire patate\". Le jeu recommence au numéro 1, mais il faut se souvenir des nouvelles règles ! Vous pouvez jouer pour que si quelqu'un se trompe deux fois, il est hors de la partie. La dernière personne qui joue encore est gagnant!</p>"
  },
  "additional_information": {
    "about": "<p>21 est une version simple du groupe de jeux, Nim. Il est parfois appelé un jeu de Misére, ce qui signifie un jeu que vous jouez pour perdre. On pense qu'il est originaire de Chine, et qu'il est mentionné pour la première fois dans l'histoire européenne au début du XVIe siècle. Le jeu a été joué originellement avec 21 pierres, et vous devez choisir 1, 2, ou 3 pierres chaque fois, et le perdant est le dernier à piocher une pierre.  </p>",
    "references": [
      "<p><a href=\"https://en.wikipedia.org/wiki/Nim\" target=\"_blank\">https://en.wikipedia.org/wiki/Nim</a></p>",
      "<p><a href=\"https://en.wikipedia.org/wiki/Nim#The_21_game\" target=\"_blank\">https://en.wikipedia.org/wiki/Nim#The_21_game</a></p>"
    ]
  }
}