{
  "title": "Abeille à miel",
  "metadata": {
    "type": "puzzle"
  },
  "main_version": {
    "statement": "<p>Un gallon de miel permet à une abeille de voler sur sept millions de miles.</p>\n<p>Combien d'abeilles pourraient voler mille miles s'ils avaient dix gallons de miel ?</p>",
    "correct_answer": "70000 ",
    "hint": "<p>Jusqu'où une abeille peut-elle voyager avec dix gallons de miel ?</p>",
    "explanation": "<p>10 gallons permettraient à une abeille de voyager sur 70 millions de miles. 70000000 ∕ 1000 = 70000, ainsi 70000 abeilles pourraient parcourir 1000 miles chacun.</p>"
  },
  "extension_1": {
    "statement": "<p>Maintenant, supposons que 4 abeilles peuvent voyager chacun 6 millions de miles avec 2 gallons de miel. Dans quelle mesure 8 abeilles peuvent-elles voyager avec 6 gallons de miel ?</p>",
    "hint": "<p>Jusqu'où une abeille peut voyager avec 1 gallon de miel ?</p>",
    "correct_answer": "9000000",
    "explanation": "<p>½×6000000×4 = 12000000. C'est le nombre de miles qu'une abeille peut parcourir avec 1 gallon de miel. Pour trouver la réponse, vous pouvez multiplier ce chiffre par 6 pour trouver le nombre total de miles qu'une abeille peut parcourir avec 6 gallons de miel, puis diviser par 8 pour trouver la distance par abeille. La réponse est 12000000×6 ∕ 8 = 9000000.</p>"
  },
  "extension_2": {
    "statement": "<p>Une abeille ouvrière peut construire une ruche d'hexagones en 60 minutes et une reine peut construire une ruche de même taille en 40 minutes. Combien de minutes leur faudra-t-il si elles le font ensemble ?</p>",
    "hint": "<p>It might be easier to choose a number of hexagons to work with - try 120 and work out how many they can each do per minute.</p>",
    "correct_answer": "24",
    "explanation": "<p>Nous pouvons voir cela avec un exemple sur le nombre d'hexagones dans la ruche. S'il y a 120 hexagones, l'abeille ouvrière en fait 2 par minute et la reine en fait 3 par minute. Donc ensemble, elles en font 5 par minute. 120 ∕ 5 = 24 . </p>\n<p>Le même argument fonctionne pour tout nombre d'hexagones dans une ruche. Prenons le nombre total d'hexagones comme h. L'abeille ouvrière travaillera à un rythme de (h ∕ 60) hexagones par minute et la reine à un rythme de (h ∕ 40) par minute. En ajoutant simplement les taux ensemble, </p>\n<p>(h ∕ 60) + (h ∕ 40) = 100×h ∕ 2400 = h ∕ 24, nous pouvons trouver la réponse, 24 minutes. </p>"
  },
  "additional_information": {
    "about": "<p>Problèmes tels que \"Si une personne peut creuser une tranchée en B<strong> jours </strong>alors combien de temps faudra-t-il à C<strong> </strong>personnes pour creuser la tranchée ? peuvent être résolus en calculant (A×B/ C). Cette technique ancienne est appelée \"la règle de trois\" et a été écrite dans une comptine en 1570 : <strong> \"</strong>La multiplication est une vexation ;</p>\n<p>La division est aussi mauvaise ; la règle de trois m'intrigue et la pratique me rend fou.\"</p>",
    "references": [
      "<p><a href=\"https://nrich.maths.org/5668\" target=\"_blank\">https://nrich.maths.org/5668</a></p>",
      "<p><a href=\"https://en.wikipedia.org/wiki/Cross-multiplication#Rule_of_Three\" target=\"_blank\">https://en.wikipedia.org/wiki/Cross-multiplication#Rule_of_Three</a></p>"
    ]
  }
}