{
  "title": "Éviter la rivière",
  "metadata": {
    "type": "counting"
  },
  "main_version": {
    "statement": "<p>Quittez la maison (H) pour vous rendre à l'école (S). Vous ne pouvez avancer sur la grille 4x4 qu'en faisant des pas vers l’est ou le nord. Vous ne pouvez pas traverser la rivière (ligne bleue)! De combien de façons pouvez-vous rejoindre l’école?</p>\n<p><img alt=\"\" src=\"assets/images/Avoid_the_River_image_0.png\" class=\"Avoid_the_River_image_0\" /></p>",
    "correct_answer": "14",
    "hint": "<p>De combien de façons pouvez-vous rejoindre l'école sur une grille 2x2? Et sur une grille 3x3?</p>",
    "explanation": "<p>Ce n'est pas un problème combinatoire facile. Il est conseillé de commencer avec une version plus simple du problème pour s’y familiariser. Il est donc plus intuitif de résoudre le problème pour une grille 2x2: en effet, il n’y a que deux façons possibles. En ce qui concerne la grille 3x3, les élèves peuvent facilement dessiner les 5 possibilités de manière explicite. Cependant, lorsqu'il s'agit de la grille 4x4, il leur est facile de se perdre dans le compte. Le problème vise donc à amener les étudiants à réfléchir à la façon d'aborder ce compte de manière plus systématique. En particulier, les élèves devraient se demander s'ils peuvent décomposer leur compte de manière à utiliser des résultats connus pour un plus petit nombre de cases. Ils peuvent remarquer par exemple que le résultat pour une grille 3x3 est: 2 + 1 + 2 = 5, 2 est le résultat pour une grille 2x2. De plus, le résultat pour une grille de 4x4 est 5 + 2 + 2 + 5 = 14, où 2 est le résultat pour une grille de 2 sur 2 et 5 est le résultat pour une grille de 3x3.</p>"
  },
  "extension_1": {
    "statement": "<p>De combien de façons pouvez-vous rejoindre l’école sur une grille 5x5 ? Essayez d’utiliser les résultats précédents pour résoudre ce problème !</p>",
    "hint": "<p>Compter explicitement pourrait être trop long. Pouvez-vous trouver une manière de ramener le problème à des cas plus simples que vous avez déjà considéré ? Concentrez-vous sur le moment où un chemin touche la rivière pour la dernière fois avant d'atteindre l'école. Savez-vous quelque chose sur tous les chemins possibles qui peuvent atteindre ce point ? Qu'en est-il de tous les chemins possibles après ce point ? </p>",
    "correct_answer": "42",
    "explanation": "<p>Cette partie vise à trouver une manière récursive pour résoudre le problème. Ce ne sera peut-être pas facile.\nNumérotons de 1 à 6 , les points où les chemins pourraient croiser la rivière en allant de la maison à l'école. Concentrons-nous sur les chemins qui touchent en dernier lieu la rivière au point 6 : ce sont tous des chemins (donc pas utiles) ; considérons tous les chemins qui touchent la rivière en dernier lieu au point 5. Une première partie du problème consiste à compter tous les chemins depuis la maison jusqu'au point 5 (de sorte qu'ils ne traversent pas la rivière), c'est exactement ceux comptés dans une grille 4 par 4 précédemment: il y en a 14. Pour la deuxième partie, il n'y a qu'une seule façon d'atteindre l'école à partir du point 5. On a donc 14 × 1 = 14 chemins qui touchent en dernier lieu la rivière au point 5 avant d'atteindre l'école. Considérons maintenant le nombre de chemins qui touchent la rivière en dernier lieu au point 4. La première partie du problème équivaut à compter tous les chemins de la maison jusqu'au point 4 (de sorte qu'ils ne traversent pas la rivière), c'est exactement ceux comptés auparavant sur une grille de 3 par 3 : il y en a 5. À partir du point 4, il n'y a plus qu'une seule façon de rejoindre l'école sans toucher à nouveau la rivière. Par conséquent, nous avons un total de 5 × 1 = 5 chemins.\nConsidérons à présent le nombre de chemins qui touchent la rivière en dernier lieu au point 3. La première partie du problème équivaut à compter tous les chemins de la maison jusqu'au point 3 (de sorte qu'ils ne traversent pas la rivière), c'est exactement ceux comptés dans une grille 2 par 2 précédemment : il y en a 2. À partir du point 3, vous devez vous déplacer d'un pas vers l'est. De là, vous ne pouvez pas aller au nord (sinon vous touchez la rivière), mais ne pouvez que retourner à l'est. De là, vous pouvez faire un pas vers l'est ou un pas vers le nord, mais pas deux pas vers le nord (sinon vous toucheriez la rivière). Etc. Vous pouvez vous rendre compte que vous résolvez le problème d'une grille 2 par 2 dont le coin inférieur gauche est le point situé à un pas à l'est du point 3 et le coin supérieur droit à un pas au sud du point 6. Par conséquent, vous avez 2 chemins.\nAu total vous avez 2 × 2 = 4 chemins qui touchent en dernier lieu la rivière au point 3. Vous continuez ensuite en considérant le nombre de chemins qui touchent en dernier lieu la rivière au point 2. Vous vous rendez compte que vous séparez le problème en celui d'une Grille 1 par 1 et une grille 3 par 3 (dont le coin inférieur gauche est le point à un pas à l'Est du point 2 et le coin supérieur droit un pas au sud du point 6). Par conséquent, nous avons au total 1 × 5 chemins. Enfin, le nombre de chemins qui touchent en dernier lieu la rivière au point 1 (c'est-à-dire ne touchent que la rivière au point 1) est le même que celui des chemins du problème avec une grille 4 sur 4 (dont le coin inférieur gauche est le point à un pas à l'Est du point 1 et le coin supérieur droit à un pas au sud du point 6). Par conséquent, nous avons 14 chemins.\nNous avons parcouru tous les chemins possibles qui ne traversent pas la rivière. Au total, ils s'additionnent comme suit : 14 + 1 × 5 + 2 × 2 + 5 × 1 + 14 = 42.</p>\n<p>Vous pourriez maintenant être en mesure de trouver une relation de récurrence pour le nombre Cₙ de chemins par l'est et par le nord dans une grille n par n qui ne traverse pas la diagonale. En généralisant ce que vous avez fait avant, nous avons :\nCₙ = Cₙ₋₁ + C₁ × Cₙ₋₂ + C₂ × Cₙ₋₃ +… + Cₙ₋₂ × C₁ + Cₙ₋₁</p>\n<p>Le iᵉ terme de la somme correspond au nombre de chemins qui touchent en dernier lieu la diagonale au point i, (où i est un nombre entre 1 et n). </p>"
  },
  "extension_2": {
    "statement": "<p>Et si la grille avait la taille 7x7? Essayez d’utiliser les résultats précédents pour calculer le nombre de possibilités pour aller à l'école sur cette grille. </p>",
    "hint": "<p>You will need to first find the result for a 6 by 6 grid so that you can use this (and all your previous answers) to find the answer for a 7 by 7 grid.</p>",
    "correct_answer": "429",
    "explanation": "<p>Nous avons déjà calculé C₄ = C₃ + C₁×C₂ + C₂×C₁ + C₃ = 5 + 1×2 +2×1 + 5 = 14</p>\n<p>et C₅ = 42</p>\n<p>Nous pouvons ainsi continuer cette récursion pour trouver</p>\n<p>C₆ = C₅ +C₁×C₄ + C₂×C₃ +…+ C₅= 132</p>\n<p>De même, nous calculons C₇ = 429</p>"
  },
  "additional_information": {
    "about": "<p>Cₙ sont appelés les nombres de Catalan et ils sont cruciaux dans le monde de la combinatoire. Il existe une formule explicite de ces nombres, mais chercher à trouver cette formule va bien au-delà de notre champ d'action : la définition récursive que nous découvrons dans cette énigme est plus que suffisante pour le moment !</p>",
    "references": [
      "<p><a href=\"https://en.wikipedia.org/wiki/Catalan_number\" target=\"_blank\">https://en.wikipedia.org/wiki/Catalan_number</a></p>"
    ]
  }
}