{
  "title": "Carré latin",
  "metadata": {
    "type": "game"
  },
  "main_version": {
    "statement": "<p>Prenez les 16 cartes V, Re, Ro et As à partir d'un pack. Essayez de les mettre dans un carré de 4 par 4 en sorte que chaque figure (J, Q, K, A) et chaque enseigne (Trèfles, Carreaux, Cœurs, Piqeus) n'apparaît qu'une seule fois dans chaque ligne et colonne.</p>",
    "further_instructions": "<p>Ceci peut être une énigme pour une seule personne ou peut attirer un groupe de personnes à l'essayer, puisqu'il est plein d'astuces ! </p>",
    "strategy_tips": "<p>Commencez par ignorer les enseignes et essayez de placer les figures dans un carré afin que chaque figure n'apparaisse qu'une seule fois dans chaque rangée et chaque colonne. </p>"
  },
  "extension_1": {
    "statement": "<p>Créez un carré 5 x 5 avec les mêmes règles, mais en incluant cette fois-ci tous les 10, J, Q, K et As. Vous aurez besoin d'un enseigne supplémentaire : vous pouvez dessiner un 10, un J, un Q, un K et un As sur cinq feuilles de couleur différentes, constituant une nouvelle enseigne de votre choix.</p>"
  },
  "additional_information": {
    "about": "<p>Ce puzzle est un exemple de Carré Latin. Fait intéressant, si le problème avait impliqué 6 figures de cartes, cela aurait été impossible. Mais avec 7 figures, il est assez facile de trouver une solution. Les carrés latins sont utilisés dans les essais médicaux pour s'assurer que chaque participant est introduit à chaque traitement pendant la même période afin de prouver quel est le meilleur traitement.</p>",
    "references": [
      "<p><a href=\"https://www.mathsisfun.com/puzzles/index.html\" target=\"_blank\">https://www.mathsisfun.com/puzzles/index.html</a></p>",
      "<p><a href=\"https://www.wikiwand.com/en/Mutually_orthogonal_Latin_squares\" target=\"_blank\">https://www.wikiwand.com/en/Mutually_orthogonal_Latin_squares</a></p>"
    ]
  }
}