{
  "title": "Journal",
  "metadata": {
    "type": "puzzle"
  },
  "main_version": {
    "statement": "<p>Ci-dessous, une seule feuille d'un journal. Étant donné que chaque feuille comporte quatre pages, combien y a-t-il de feuilles en tout ?</p>\n<p><img alt=\"\" src=\"assets/images/Newspaper_image_0.png\" class=\"Newspaper_image_0\" /></p>",
    "correct_answer": "17",
    "hint": "<p>Pouvez-vous travailler à rebours à partir de 8 pour déterminer combien de feuilles il y aurait sous celle-ci ? Vous pouvez utiliser des morceaux de papier et les numéroter pour vous aider.</p>",
    "explanation": "<p>Au verso du numéro 8 il doit y avoir le numéro 7. La feuille en dessous doit avoir les chiffres 6 et 5. En continuant il y aura 4 et 3 et enfin 2 et 1. Il y a donc trois feuilles en dessous. Ajouter 7 au 61 donne la dernière page comme 68. Étant donné que chaque feuille a quatre pages, il y a 68 ∕ 4 = 17 feuilles.</p>"
  },
  "extension_1": {
    "statement": "<p>S'il faut 852 chiffres pour numéroter toutes les pages d'un livre, dans l'ordre habituel, quel est le numéro de la dernière page du livre ?</p>",
    "hint": "<p>Combien y a-t-il de nombres à 1 chiffre ? Combien de nombres à 2 chiffres ?</p>",
    "correct_answer": "320",
    "explanation": "<p>Il existe 9 nombres à un chiffre (les nombres 1 à 9), 90 nombres à deux chiffres (les nombres 10 à 99) et 900 nombres à trois chiffres (les nombres 100 à 999). Au total, cela ferait 9 × 1 + 90 × 2 + 900 × 3 = 9 + 180 + 2700 = 2889 chiffres, donc le nombre de pages est inférieur à 999. Il y a 852 - 9 - 180 = 663 chiffres utilisés dans les nombres à trois chiffres. 663 ∕ 3 = 221, il y a donc 221 pages avec des nombres à trois chiffres. 99 + 221 = 320 nous donne la réponse.  </p>"
  },
  "extension_2": {
    "statement": "<p>Numéroter les pages d'un livre nécessite d'imprimer 200 neufs. Quel est le nombre minimum de pages que le livre pourrait avoir ?</p>",
    "hint": "<p>How many 9s are there in the first 100 numbers?</p>",
    "correct_answer": "918",
    "explanation": "<p>Pensez d'abord aux nombres inférieurs à 100. Il y a 10 nombres se terminant par 9 et 10 nombres ayant 9 comme chiffre supérieur (90‒99), soit un total de 20 9. De la même façon, on a 20 9 entre 100 et 199, et entre 200 et 299, etc. On obtient donc 9×20 = 180 9 jusqu'à 899. Il nous en faut 20 de plus pour atteindre 200 9s. De 900 à 999, chaque nombre commence par un 9. Parce que 909 a deux 9, nous obtenons les 20 derniers 9 des nombres de 900 à 918.</p>"
  },
  "additional_information": {
    "about": "<p>Vous pouvez essayer ce puzzle avec un vrai journal - sortez l'une des feuilles et regardez les chiffres dessus. Déterminez le nombre de feuilles qu'il devrait y avoir et voyez ensuite si vous avez raison. </p>",
    "references": [
      "<p><a href=\"https://nrich.maths.org/7180\" target=\"_blank\">https://nrich.maths.org/7180</a></p>"
    ]
  }
}
