{
  "title": "Papier plié",
  "metadata": {
    "type": "funfact"
  },
  "main_version": {
    "statement": "<p>Si vous pouviez plier une feuille de papier en deux seulement 42 fois, elle atteindrait la Lune ! </p>",
    "hint": "<p>Disons que l'épaisseur du papier est d'environ 0,1 millimètre (ou 0,0039 pouce). Si vous le pliez une fois sur lui-même, quelle serait l'épaisseur ? Et si vous le pliez une fois de plus sur lui-même? Et si vous le pliez 10 fois?</p>",
    "explanation": "<p>La distance entre la Terre et la Lune est un peu moins de 400000 kilomètres (ou 250000 miles). Pour nous le papier est de 0.1 millimètre (mm) en épaisseur. Si nous plions le papier une fois, l'épaisseur sera doublée, elle deviendra donc 0.2mm. Replier donne 0,4mm. Si on le plie 10 fois, l'épaisseur devient (0.1mm)×2¹⁰ (2 à la puissance 10). Maintenant, si on calcule (0.1mm)×2⁴², le résultat est de 440 000km!</p>"
  },
  "extension_1": {
    "statement": "<p>Combien de fois auriez-vous besoin de plier le même morceau de papier pour atteindre la hauteur de la Tour Britam, la plus haute gratte-ciel de Nairobi? (200m, ou 640 pieds)</p>",
    "hint": "<p>Assurez-vous de convertir d'abord le 0,1 mm en mètres ou 200 m en millimètres. </p>",
    "explanation": "<p>Vous auriez besoin de plier le papier 21 fois. 200 m est 200000 mm. Vous devez résoudre (0.1 mm)×2ⁿ = 200000 pour n. Nous pouvons résoudre des équations comme celles-ci en utilisant des logarithmes ou juste avec des essais et des erreurs - continuez à multiplier par 2 jusqu'à ce que vous ayez atteint la hauteur de la tour… 20 est presque suffisant, mais vous aurez besoin de 21 plis pour atteindre plus de 200 m de hauteur. </p>"
  },
  "additional_information": {
    "about": "<p>Essayez de plier une feuille de papier 6 fois, souvenez-vous de la plier complètement sur elle-même à chaque répétition. Pouvez-vous la plier une septième fois ? Une huitième ? Jusqu'où pouvez-vous aller ? Peut-être avons-nous besoin d'une plus grande feuille de papier! On a pensé pendant des années que 7 était le nombre maximum de fois qu'un morceau de papier pouvait être plié. Mais en 2002, l'adolescente américaine Britney Gallivan a démontré qu'une feuille de papier peut être pliée 12 fois, à condition qu'elle soit assez longue et assez mince. Britney Gallivan l'a démontré en utilisant un papier de toilette de 1200m de longueur, qui lui a fourni à la fois la longueur et la minceur dont elle avait besoin. Britney a même proposé une formule qui a montré en combien de longueur le morceau de papier devrait être pour qu'il puisse être plié n fois :</p>\n<p><!-- LaTeX Start -->$$ L = \\frac{\\pi \\times t}{6} (2^n + 4)(2^n - 1) $$<!-- LaTeX End --><!-- L = π×t×(2ⁿ + 4)(2ⁿ - 1) ∕ 6 --></p>\n<p>L est la longueur de papier requise, t est l'épaisseur du papier et n est le nombre de plis que vous pouvez faire.</p>\n<p>Dix ans plus tard, en 2012, un groupe d'étudiants ont battu le record de Britney en prenant 16 km de rouleaux de toilettes et en le pliant 13 fois dans une direction. </p>",
    "references": [
      "<p><a href=\"https://www.mathscareers.org.uk/article/how-many-times-can-you-fold-a-sheet-of-paper/\" target=\"_blank\">https://www.mathscareers.org.uk/article/how-many-times-can-you-fold-a-sheet-of-paper/</a></p>"
    ]
  }
}