{
  "title": "Sim",
  "metadata": {
    "type": "game"
  },
  "main_version": {
    "statement": "<p>Dessinez six points dans un arrangement hexagonal. Les joueurs tracent\nà tour de rôle une ligne droite entre deux points quelconques, en\nessayant d'éviter de faire un triangle. Chaque joueur devrait utiliser\nune couleur différente. Le joueur qui complète un triangle avec sa\ncouleur en premier perd la partie.</p>",
    "further_instructions": "<p>Vous voudrez peut-être prendre toutes les lignes possibles entres les\npoints pour commencer et après colorier dessus. Cela rendrait le jeu un\npeu plus facile à jouer. Si vous n'avez pas deux couleurs différentes,\nvous pouvez utiliser des lignes pleines et des pointillés pour les deux\njoueurs. </p>",
    "strategy_tips": "<p>Essayez de faire des mouvements dans le but d'enlever des options pour\nvotre adversaire. Vous pourriez essayer de completer les triangles qui\nsont de couleur mixte.</p>"
  },
  "extension_1": {
    "statement": "<p>Dessinez un cadre/grille de points 5 par . Deux joueurs échangent leur\ntour pour colorer un point (utilisez des couleurs différentes ou un x\net un +). Le gagnant est le premier qui réalise un carré avec quatre\npoints. Les carrés peuvent être aussi bien inclinés que droits.</p>"
  },
  "additional_information": {
    "about": "<p>Le jeu de crayon Sim a été inventé en 1969 par Gustavus Simmons, un\ncryptographe, qui l'a décrit dans le Journal of Recreational\nMathematics. Frank P. Ramsey a prouvé qu'il doit toujours y avoir un\ngagnant dans ce jeu par le \"théorème sur les amis et les étrangers\". Il\na montré qu'en complétant toutes les arêtes du graphique, il doit y\navoir un triangle qui est entièrement de la même couleur.</p>",
    "references": [
      "<p><a href=\"https://www.whatdowedoallday.com/sim-pencil-game/\" target=\"_blank\">https://www.whatdowedoallday.com/sim-pencil-game/</a></p>",
      "<p><a href=\"http://web.math.ucsb.edu/~padraic/ucsb_2013_14/mathcs103_s2014/images/SIM_game.pdf\" target=\"_blank\">http://web.math.ucsb.edu/~padraic/ucsb_2013_14/mathcs103_s2014/images/SIM_game.pdf</a></p>",
      "<p><a href=\"https://nrich.maths.org/2526\" target=\"_blank\">https://nrich.maths.org/2526</a></p>",
      "<p><a href=\"https://en.wikipedia.org/wiki/Theorem_on_friends_and_strangers\" target=\"_blank\">https://en.wikipedia.org/wiki/Theorem_on_friends_and_strangers</a></p>"
    ]
  }
}