{
  "title": "Poignées de main à la table",
  "metadata": {
    "type": "counting"
  },
  "main_version": {
    "statement": "<p>Si 8 personnes sont assises autour d’une table circulaire, en combien de manière peuvent-ils tous être en train de se serrer la main en simultané avec une autre personne a la table de telle manière qu'aucun de leurs bras se croisent? (Ils ont de très long bras).</p>",
    "correct_answer": "14",
    "hint": "<p>Quelle est la réponse si il n’y a que 2 personnes, ou 4 personnes, ou 6 personnes? Pouvez vous trouvez une façon d'utiliser les cas avec moins de personnes pour vous aidez à compter les cas avec plus de personnes?</p>",
    "explanation": "<p>Pour le cas avec 2 personnes il y a 1 seul (accord) façon: </p>\n<p><img alt=\"\" src=\"assets/images/Table_Handshakes_image_0.png\" class=\"Table_Handshakes_image_0\" /></p>\n<p>Pour 4 personnes il y a 2 moyen :</p>\n<p><img alt=\"\" src=\"assets/images/Table_Handshakes_image_1.png\" class=\"Table_Handshakes_image_1\" /><img alt=\"\" src=\"assets/images/Table_Handshakes_image_2.png\" class=\"Table_Handshakes_image_2\" /></p>\n<p>Pour 6 personnes, nous pouvons envisager les options pour lesquelles le numéro 1 se serre la main. Le numéro 1 ne peut pas se serrer la main avec les numéros 3 ou 5, car cela laisserait quelqu’un coupé du groupe. Si le numéro 1 se serre la main avec le numéro 2 comme ceci :</p>\n<p><img alt=\"\" src=\"assets/images/Table_Handshakes_image_3.png\" class=\"Table_Handshakes_image_3\" /></p>\n<p>Ensuite, nous savons que les quatre autres personnes peuvent se serrer la main de 2 façons différentes (en utilisant notre résultat d’avant). Le numéro 1 pourrait se serrer la main avec le numéro 6 et il y aurait aussi deux façons différentes pour les quatre autres de se serrer la main. Enfin, le numéro 1 pourrait serrer la main du numéro 4, et cela ne laisserait qu’une option :</p>\n<p><img alt=\"\" src=\"assets/images/Table_Handshakes_image_4.png\" class=\"Table_Handshakes_image_4\" /></p>\n<p>Le résultat pour 6 personnes est donc : 5 = 2 + 1 + 2.</p>\n<p>Pour huit personnes, le numéro 1 pourrait se serrer la main avec le numéro 2 (laissant un groupe de 6 personnes que nous savons maintenant qu’il y a 5 façons de se serrer la main), le numéro 4 (laissant un groupe de 4, donc 2 voies) le numéro 6 (laissant un groupe de 4, donc 2 voies) ou le numéro 6 (laissant un groupe de 6 et 5 voies). La réponse pour huit personnes est 5 + 2 + 2 + 5.</p>"
  },
  "extension_1": {
    "statement": "<p>Et si on avait dix personnes à table ? Ca serait peut être utile d’utiliser les résultats précédents pour vous aider!</p>",
    "hint": "<p>Compter tout seul prendrait peut être trop longtemps. Pouvez vous trouver une façon de réduire le problème en cas plus simple que vous aviez déjà comptée? Concentrez vous sur quand une personne fixe serre la main d’une autre personne: le problème se divise en partie gauche et droite ou un nombre réduit de personnes doivent se serrer la main.</p>",
    "correct_answer": "42",
    "explanation": "<p>Numérotons les personnes de un à dix dans le sens inverse des aiguilles d’une montre. Concentrons notre attention sur une personne fixe, par exemple 1. Quand personne 1 serre la main de personne 2 il y a 10-2 = 8 personnes sur leur gauche qui doivent se serrer la main. Pour eux c’est le problème qu’on avait avant, avec 8 personnes à table il peuvent se serrer la main de 14 façons différentes. Maintenant imaginons que personne 1 veut serrer la main de personne 3: ceci laisserait personne 2 seul, parce que chaque tentative du dernier de serrer la main avec un autre va résulter à un croisement de serrement de main entre personne 1 et 3. Donc personne 1 doit sauter personne 3 et serrer la main de personne 4. Sur leur droite ils ont personnes 2 et 3 qui peuvent eux que se serrer la main d’une manière, alors que sur leurs gauche ils on 10-2-2=6 personnes qui peuvent se serrer la main de 5 maniere differentes (comme calculé auparavant), donc nous avons 1*5=5 possibilités dans ce cas. Considérons maintenant les personnes 1et 5: il y aura une personne parmi les personnes 2, 3, 4 qui restera seule, alors personne 1 ne doit bouger a personne 6. Dans ce cas, on aura 4 personnes sur la droite (personnes 2,3,4,5) et 4 personnes sur la gauche (personnes 7,8,9,10). Chaque groupe peut se serrer la main indépendamment de 2 façons, alors le total est 2*2=4. Nous continuons avec personne 1 qui serre la main avec personne 8 (obtenant 1*5=5 façons) et après avec personne 10 (obtenant 14 façons). Nous avons épuisé toutes les façons possibles où personne 1 peut serrer la main, alors au dessus nous avons couvert toutes les façons différentes, qui s’additionnent à : 14 + 1×5 + 2×2 + 5×1 + 14 = 42.</p>\n<p>Penser au problème de cette manière nous donne une formule pour calculer le nombre de serrements de mains Hₙ où n est le nombre (pair) de personnes a la table:</p>\n<p>Hₙ = Hₙ₋₂ + H₂×Hₙ₋₄ + H₄×Hₙ₋₆ + … + Hₙ₋₄×H₂ + Hₙ₋₂</p>\n<p>Par exemple, pour 10 personnes a la table:</p>\n<p>H₁₀ = H₈ + H₂×H₆+ H₄×H₄ + H₆×H₂ + H₈ = 14 + 1×5 + 2×2 + 5×1 + 14 = 42</p>"
  },
  "extension_2": {
    "statement": "<p>Et si nous avions 14 personnes à la table? Pouvez vous utiliser les résultats précédents pour calculer le nombre de façons pour se serrer la main? </p>",
    "hint": "<p>You will need to first find the result for 12 people so that you can use this (and all your previous answers) to find the answer for 14.</p>",
    "correct_answer": "429",
    "explanation": "<p>Que Hₙ soit le nombre de façons où n personnes se serrent la main. Dans la solution précédente nous avons calculé les nombres H₂, H₄,  H₆, H₈, et H₁₀. Nous savons que la formule pour 14 personnes nous demande de calculer pour 12 personnes d’abord. Alors, nous calculons</p>\n<p>H₁₂ = H₁₀ + H₂×H₈ + … + H₈×H₂ + H₁₀ = 132</p>\n<p>Et de la même façon nous pouvons donc calculer H₁₄ = 429.</p>"
  },
  "additional_information": {
    "about": "<p>Les suites de nombres que nous avons découvertes 1, 2, 5, 14, 42, ... sont appelées <em>nombres catalans</em> et elles sont cruciales dans le monde de la combinatoire. Il existe des preuves de leur utilisation en Chine dès 1730, mais ils portent le nom du mathématicien belge Eugène Charles Catalan (1814–1894).</p>",
    "references": [
      "<p><a href=\"https://en.wikipedia.org/wiki/Catalan_number\" target=\"_blank\">https://en.wikipedia.org/wiki/Catalan_number</a></p>"
    ]
  }
}