{
  "title": "Quinze",
  "metadata": {
    "type": "game"
  },
  "main_version": {
    "statement": "<p>Il s'agit d'un jeu pour deux joueurs (ou bien un groupe séparé en deux équipes). Prenez les As et 2 à 9 de n'importe quelle combinaison, et puis placez-les en ordre. As = 1 dans ce jeu. Prenez chaqun son tour pour choisir une des cartes et placez-la devant vous. Le premier joueur qui a exactement trois cartes qui s'ajoutent pour être 15 est le gagnant. Vous pouvez avoir plus de trois cartes, mais vous ne gagnez que si trois d'entre elles remontent à 15.</p>",
    "further_instructions": "<p>Rappelez-vous que vous ne pouvez pas utiliser deux nombres pour faire 15, vous ne pouvez pas non plus utiliser quatre nombres, il doit être que trois nombres. Vous pouvez avoir plus de trois cartes dans votre main et n'en utiliser que trois d'entre eux. Le jeu est un tirage au sort si toutes les cartes ont été choisies et que personne ne peut faire 15.</p>",
    "strategy_tips": "<p>Notez toutes les combinaisons de trois nombres qui totalisent jusqu'à 15. Comment pouvez-vous être sûr que vous avez trouvé toutes les combinaisons ? Quels chiffres apparaissent dans exactement 2, 3 et 4 de ces combinaisons notées?</p>\n<p>Pensez a d'autres jeux similaires que vous aviez jouez? Est-ce qu'il y an un avantage à passer en premier ou en deuxième?</p>"
  },
  "extension_1": {
    "statement": "<p>Essayez de jouer à nouveau ce jeu, mais avec les cartes arrangées comme ceci pour commencer. </p>\n<p><img alt=\"\" src=\"assets/images/Quinze_image_0.png\" class=\"Quinze_image_0\" /></p>\n<p>Qu'est-ce que vous remarquez sur la façon dont les nombres sont arrangés ? Est-ce que cela vous rappelle un autre jeu ?</p>"
  },
  "additional_information": {
    "about": "<p>Ce jeu est intéressant parce qu'il est similaire au jeu du morpion/tic-tac-toe. Le terme technique pour cela est <em>isomorphe. </em>. En mathématiques, lorsqu'on est confronté à un nouveau problème, il est souvent utile de le relier à un problème que vous savez déjà résoudre.</p>",
    "references": [
      "<p><a href=\"https://www.ms.uky.edu/~lee/ma310sp15/gameoffifteen.pdf\" target=\"_blank\">https://www.ms.uky.edu/~lee/ma310sp15/gameoffifteen.pdf</a></p>",
      "<p><a href=\"https://en.wikipedia.org/wiki/Number_Scrabble\" target=\"_blank\">https://en.wikipedia.org/wiki/Number_Scrabble</a></p>"
    ]
  }
}