{
  "title": "-> La Loi de Benford",
  "metadata": {
    "type": "funfact"
  },
  "main_version": {
    "statement": "<p>Quand on regarde au valeurs trouvés dans les données du monde réel, le premier chiffre pour la plupart des numéros est plus souvent 1 que tous lest autres nombres. 2 est un premier chiffre plus commun que 3, et ainsi de suite jusqu'à 9. En fait, ces premiers chiffres suivent souvent le même modèle (distribution).</p>\n<p><img alt=\"\" src=\"assets/images/Benford_s_Law_image_0.png\" class=\"Benford_s_Law_image_0\" /></p>",
    "hint": "<p>Regardez a des données qui couvrents plusieurs ordres de grandeur. Par example, quels sont les premier chiffres de: les100 nombres premier initiaux (et encore plus!), de la population de pays d'Afrique, la hauteur des plus hauts bâtiments du monde?</p>",
    "explanation": "<p>De nombreux ensembles de données (par exemple, les populations de pays, les hauteurs des bâtiments, le prix des actions) ou des suites bien connues (nombres de Fibonacci, les nombres premiers) sont répartis sur des échelles très différentes (ordres de grandeur). Beaucoup de ces données massives découlent de lois de puissance décroissante. Un exemple simple pourrait être  </p>\n<p>y = k×10⁽⁻ᵃˣ⁾ where k, a &gt; 0. Choosing a = 0.1 and k = 1000 gives the following:</p>\n<p><img alt=\"\" src=\"assets/images/Benford_s_Law_image_1.png\" class=\"Benford_s_Law_image_1\" /></p>\n<p>Les lois sur la puissance ressembleront à une ligne droite sur le papier de graphes à demi-loch - où l'axe y est sur un papier à échelle logique. On peut le montrer en réécrivant notre formule pour la loi de puissance y = k×10⁽⁻ᵃˣ⁾ = 10ᵇ×10⁽⁻ᵃˣ⁾ = 10⁽⁻ᵃˣ⁺ᵇ⁾ , puis en appliquant un logarithme des deux côtés : log₁₀(y) = - a×x + b. Il s'agit de l'équation lorsque l'axe Y est sur une échelle de log. Le même exemple est affiché ci-dessous:</p>\n<p><img alt=\"\" src=\"assets/images/Benford_s_Law_image_2.png\" class=\"Benford_s_Law_image_2\" /></p>\n<p>Les lignes horizontales représentent 1, 2, 3, 4, …, 10, 20, 30, …, 100, 200, 300, … et notez qu'ils sont inégalement réparti sur l'axe y ! Les plus grands espaces sont entre 1 et 2, entre 10 et 20 et entre 100 et 200. Les espaces les plus petits sont compris entre 9 et 10, 90 et 100.</p>\n<p>Try picking random values of x, and reading off corresponding values of y from our (power law) straight line. Because of the spacing of the horizontal lines we see that we are most likely to get a value of y with first digit 1, then we are next likely to get a value of y with a first digit 2, etc. These probabilities are what leads to -> La Loi de Benford. </p>"
  },
  "extension_1": {
    "statement": "<p>Pouvez-vous penser à quels séries de chiffres n'obéissent pas a la loi de Benford?</p>",
    "hint": "<p>L'explication de la loi de Benford remarquait que l'ensemble de données couvre généralement de nombreuses ordres de grandeur.</p>",
    "explanation": "<p>Tout ce qui se trouve dans une petite portée, un exemple serait quelque chose normalement distribué. Par exemple: mesurer la hauteur de tout le monde (en mètres). Presque toutes les hauteurs commenceraient par un 1.</p>"
  },
  "additional_information": {
    "about": "<p>-> La Loi de Benford is used in the real world to check for fraud on big data sets. If they don't follow the law when they should, it is possible they have been falsified!</p>",
    "references": [
      "<p><a href=\"https://brilliant.org/wiki/benfords-law/\" target=\"_blank\">https://brilliant.org/wiki/benfords-law/</a></p>",
      "<p><a href=\"https://towardsdatascience.com/what-is-benfords-law-and-why-is-it-important-for-data-science-312cb8b61048\" target=\"_blank\">https://towardsdatascience.com/what-is-benfords-law-and-why-is-it-important-for-data-science-312cb8b61048</a></p>"
    ]
  }
}