{
  "title": "Vingt-Quatre",
  "metadata": {
    "type": "game"
  },
  "main_version": {
    "statement": "<p>Enlever le 10, J , Q , K et les cartes jocker du tas. Mélanger le reste et\nplacer quatre cartes, face vers le haut, pour que tous les joueurs\npuissent les voir. Chaque joueur essaye de faire le numéro 24\nsilencieusement en utilisant les quatre numéros (A compte comme 1) et\nautant d'opérations nécessaires +,-,*,÷, et les parenthèses si\nnécessaire. La première personne qui donne une réponse avec une\nexplication gagne et garde les quatre cartes. Continuer à jouer jusqu'à\nce qu’il y ait plus de cartes.</p>",
    "further_instructions": "<p>Ceci est un jeu pour deux ou plus de joueurs. </p>\n<p>Quelques combinaisons peuvent être impossibles. Dans ce cas,\nremettre les cartes, et mélanger encore pour en choisir encore quatre. </p>",
    "strategy_tips": "<p>Pensez à un nombre des facteurs de 24,pour faire par\nexemple 1x24, 2x12 ,3x8 et 4x6. Si vous avez l’un des\nfacteurs dans votre liste comme 1, 2, 3, 4, 6, 8,...\nutilisez les derniers nombres pour créer un autre nombre\nou utilisez vos numéros pour créer des combinaisons.</p>"
  },
  "extension_1": {
    "statement": "<p>Vous pouvez jouer ce jeu comme snap avec 2 ou 4 joueurs. Distribuer les\ncartes de manière égale à tous les joueurs. Pour deux joueurs, sur le\ncompte de trois, ils retournent leurs deux premières cartes. Pour\nquatre joueurs, ils retournent juste tous une carte par tour. Tout le\nmonde essaye de faire 24 avec leur quatre cartes. La première personne\nà le faire prends les cartes et les met au bas de leur pile. Le jeu\ncontinue jusqu’à ce qu’un joueur n’ait plus de cartes. Alors le joueur\navec le plus de cartes est le gagnant.</p>"
  },
  "additional_information": {
    "about": "<p>Le nombre 24 est utilisé parce qu’il a tellement de facteurs.\nCependant, une analyse de toutes les combinaisons possibles de 4 cartes\nmontre que le chiffre 2 aurait été le meilleur nombre cible! 99,19% des\ncombinaisons pourraient être résolues, comparativement à 80,20 % pour\n24. Si vous êtes autorisé à utiliser des factorielles (par exemple 3! =\n3×2×1 = 6), vous pouvez résoudre beaucoup plus de combinaisons pour 24.</p>",
    "references": [
      "<p><a href=\"https://nrich.maths.org/7669\" target=\"_blank\">https://nrich.maths.org/7669</a></p>",
      "<p><a href=\"https://nrich.maths.org/1262\" target=\"_blank\">https://nrich.maths.org/1262</a></p>",
      "<p><a href=\"http://www.ijastnet.com/journals/Vol_1_No_5_September_2011/20.pdf\" target=\"_blank\">http://www.ijastnet.com/journals/Vol_1_No_5_September_2011/20.pdf</a></p>",
      "<p><a href=\"https://gottfriedville.net/games/24/index.shtml\" target=\"_blank\">https://gottfriedville.net/games/24/index.shtml</a></p>"
    ]
  }
}