{
  "title": "Affaires de singe(quelque chose de louche)",
  "metadata": {
    "type": "puzzle"
  },
  "main_version": {
    "statement": "<p>Une grande pièce contient 1000 ampoules, toutes éteintes. 1000 singes entrent dans la pièce et décident d'appuyer sur les interrupteurs d'une manière très particulière.</p>\n<p>Le 1<sup>er</sup> singe appuie sur chaque multiple de 1.</p>\n<p>Le second singe appui sur tout les multiples de 2.</p>\n<p>Le troisième singe appui sur tout les multiples de 3.</p>\n<p>Etc., jusqu'au 1000<sup>ème</sup> singe. Une fois que tous les singes ont fini d'appuyer sur les interrupteurs, combien de lumières au total seront allumées ?</p>",
    "correct_answer": "31",
    "hint": "<p>Pouvez-vous déterminer si le numéro 8 sera allumé ou éteint ? Et le numéro 9 ? Qu'y a-t-il dans les facteurs de ces deux nombres qui signifient que l'un d'eux est allumé et l'autre est éteint ?</p>",
    "explanation": "<p>La plupart des nombres seront pressés par un nombre pair de singes, par ex. 24 a des facteurs (1×24, 2×12, 3×8, 4×6), donc les singes 1, 2, 3, 4, 6, 8, 12, 24 appuieront sur l'interrupteur, et comme c'est un nombre pair la lumière sera éteinte.</p>\n<p>Les nombres carrés sont les seuls qui n'ont pas un nombre pair de facteurs, par ex. 16 a des facteurs (1×16, 2×8, 4×4). Les singes 1, 2, 4, 8, 16 appuieront sur l'interrupteur, et comme il s'agit d'un nombre impair d'appuis sur l'interrupteur, la lumière restera allumée (le singe 4 n'appuiera pas deux fois !).</p>\n<p>Nous avons donc juste besoin de déterminer combien de nombres carrés il y a entre 1 et 1000. </p>\n<p>On trouve le plus grand nombre carré inférieur à 1000 : 31×31 = 961, 32×32 = 1024</p>\n<p>Il restera donc 31 interrupteurs allumés ! (commutateurs numéros 1, 4, 9, 16, 25, 36, … , 900, 961)</p>"
  },
  "extension_1": {
    "statement": "<p>Combien d'interrupteurs d'éclairage seront touchés par exactement trois singes ?</p>",
    "hint": "<p>L'interrupteur numéro 9 sera touché par trois singes : 1, 3 et 9. Pouvez-vous trouver d'autres chiffres qui le feront ?</p>",
    "correct_answer": "11",
    "explanation": "<p>Les interrupteurs qui ne sont touchés que par trois singes sont les carrés des nombres premiers (car ce sont les seuls nombres qui ont exactement trois facteurs.) Les nombres sont 4,9, 25, 49, 121, 169, 289, 361, 529, 841 et 961 soit 11 au total.</p>"
  },
  "extension_2": {
    "statement": "<p>Quelle ampoule sera touchée par le plus de singes ?</p>",
    "hint": "<p>Which number under 1000 has most factors? Try and build up a number using small prime numbers.</p>",
    "correct_answer": "840",
    "explanation": "<p>Un nombre aura le plus grand nombre de facteurs si sa décomposition en facteurs premiers contient le plus de nombres. Par exemple 24 = 2³×3 a 8 facteurs (1, 2, 3, 4, 6, 8, 12, 24) contre 25 = 5² qui n'en a que 3 (1, 5, 25). </p>\n<p>Pour trouver le nombre inférieur à 1000 qui a le plus de facteurs, nous commençons avec autant de plus petits nombres premiers que possible, puis multiplions à moins de 1000 (2 × 3 × 5 × 7) puis nous pouvons multiplier par 2 jusqu'à ce que le nombre est aussi proche que possible de 1000.</p>\n<p>Par conséquent, la réponse est 2³×3×5×7 = 840.</p>\n<p>Le nombre de facteurs de 840 est 32, donc l'interrupteur 840 a été touché par 32 singes.</p>"
  },
  "additional_information": {
    "about": "<p>Il s'agit d'un casse-tête très célèbre qui peut être trouvé dans différents contextes - l'ouverture et la fermeture des casiers est un autre problème courant. Il est conçu pour vous faire réfléchir sur les propriétés de différents nombres. </p>",
    "references": [
      "<p><a href=\"https://mathsclub.samicharity.co.uk/en/monkey-business\" target=\"_blank\">https://mathsclub.samicharity.co.uk/en/monkey-business</a></p>",
      "<p><a href=\"https://tasks.illustrativemathematics.org/content-standards/tasks/938\" target=\"_blank\">https://tasks.illustrativemathematics.org/content-standards/tasks/938</a></p>",
      "<p><a href=\"https://nrich.maths.org/countingfactors\" target=\"_blank\">https://nrich.maths.org/countingfactors</a></p>",
      "<p><a href=\"https://en.wikipedia.org/wiki/Highly_composite_number\" target=\"_blank\">https://en.wikipedia.org/wiki/Highly_composite_number</a></p>"
    ]
  }
}