{
  "title": "Les Chemins pavés",
  "metadata": {
    "type": "counting"
  },
  "main_version": {
    "statement": "<p>De combien de manières différentes pouvez-vous poser 6 dalles de pavage égales, chacune de 2 mètres sur 1 mètre, pour faire un chemin de 2 mètres de large et 6 mètres de long de ma porte arrière dans mon jardin, sans couper aucune des dalles de pavage ?</p>",
    "correct_answer": "13",
    "hint": "<p>De combien de manières différentes pouvez-vous le faire au cas où vous auriez moins de dalles de pavage pour un chemin plus court ? Réfléchissez à une bonne stratégie pour classer les différentes manières. Par exemple, combien de façons peut-on avoir 2 paires de dalles dans le sens de la longueur ?</p>",
    "explanation": "<p>Ce problème est d'abord destiné à vous faire réfléchir à une bonne stratégie pour compter. Vous pouvez dessiner toutes les possibilités de chemins plus courts. Cependant, cela deviendra vite trop long. Une première étape vers la recherche d'un principe d'organisation pourrait consister à classer les chemins en fonction du nombre de paires de dalles placées dans le sens de la longueur. Notons n le nombre de dalles de pavage. Pour n = 1, il n'y a clairement qu'une seule possibilité (pas de paires) ; pour n = 2 il y a 2 possibilités (pas de paires, et 1 paire) ; pour n = 3 il y a 1×(pas de paires) + 2×(1 paire) = 3 façons ; pour n = 4 il y a 1×(pas de paires) + 3×(1 paire) + 1×(2 paires)= 5. En utilisant cette stratégie, nous pouvons facilement compter n = 6 : il y a 1×(pas de paires) + 5×(1 paire) + 6×(2 paires) + 1×(3 paires) = 13. En regardant la séquence 1, 2 , 3, 5, 8, 13, …vous reconnaîtrez peut-être le motif !</p>"
  },
  "extension_1": {
    "statement": "<p>De combien de manières différentes pouvez-vous poser les 11 dalles de même type pour faire un chemin de 2 mètres de large et 11 mètres de long, sans couper aucune des dalles ?</p>",
    "hint": "<p>Compter explicitement peut être trop long. Pouvez-vous trouver un moyen de réduire le problème dans des cas plus simples que vous avez déjà comptés ?</p>",
    "correct_answer": "144",
    "explanation": "<p>Supposons que vous deviez poser n dalles. Notons F(n) la solution du problème pour n dalles. Vous pouvez terminer votre chemin de deux manières : soit en posant la dernière paire de dalles dans le sens de la longueur, soit en posant la dernière dalle en travers. Dans le premier cas, vous êtes libre de disposer les premières (n - 2) dalles comme vous le souhaitez pour faire un chemin de longueur (n - 2) mètres : il y a exactement F(n - 2) façons de faire. En ce qui concerne le deuxième cas, vous êtes alors libre de disposer les premières (n - 1) dalles comme vous le souhaitez pour faire un chemin de longueur (n - 1) mètres : il existe exactement F(n - 1) voies de Ce faisant. Par conséquent, vous trouvez que F(n) = F(n - 1) + F(n - 2) : c'est la preuve de la relation de récurrence pour votre suite de nombres ! Par des expériences précédentes, il devrait être clair que F(1) = 1 et F(2) = 2. Nous pouvons maintenant construire la suite facilement : chaque terme de la suite peut être trouvé en additionnant les deux termes précédents. Nous pouvons continuer :</p>\n<p>1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144</p>\n<p>Il y a donc 144 façons de poser les 11 dalles de pavage pour faire le chemin.</p>"
  },
  "extension_2": {
    "statement": "<p>Pour tous les chemins construits avec un nombre de dalles compris entre 1 et 30 inclus, combien d'entre eux auront un nombre impair de façons de les construire ?</p>",
    "hint": "<p>Think about how the sequence is generated … can you find a pattern that repeats thinking about odd and even numbers?</p>",
    "correct_answer": "20",
    "explanation": "<p>Pour la séquence 1, 2, 3, 5, 8, 13, 21, … nous pouvons voir qu'il existe un modèle impair-pair-impair, impair-pair-impair, impair-etc. Cela a du sens car pair + impair = impair et impair + impair = pair. Donc dans une suite de 30 nombres, il y a 30 ∕ 3×2= 20 nombres impairs.</p>"
  },
  "additional_information": {
    "about": "<p>La suite de nombres dans ce puzzle fait partie de la suite de Fibonacci : </p>\n<p>0, 1, 1, 2, 3, 5, 8, 13, 21, 34,... Il est facile de trouver le numéro suivant en additionnant les deux numéros précédents, mais vous pouvez également trouver des numéros dans la séquence directement en utilisant ce formule:</p>\n<p><!-- LaTeX Start -->$$F_n = \\frac{1}{\\sqrt{5}}\\left[ \\left(\\frac{1+\\sqrt{5}}{2}\\right)^{n+1} - \\left(\\frac{1-\\sqrt{5}}{2}\\right)^{n+1}\\right]$$<!-- LaTeX End --><!-- Fₙ = (1 ∕ √5)×( ((1 + √5) ∕ 2)ⁿ⁺¹ - ((1 - √5) ∕ 2)ⁿ⁺¹ ) --></p>",
    "references": [
      "<p><a href=\"http://datagenetics.com/blog/june52020/index.html\" target=\"_blank\">http://datagenetics.com/blog/june52020/index.html</a></p>",
      "<p><a href=\"http://datagenetics.com/blog/october22015/index.html\" target=\"_blank\">http://datagenetics.com/blog/october22015/index.html</a></p>",
      "<p><a href=\"https://www.mathsisfun.com/numbers/fibonacci-sequence.html\" target=\"_blank\">https://www.mathsisfun.com/numbers/fibonacci-sequence.html</a></p>"
    ]
  }
}