{
  "title": "Les Nombres de Lychrel",
  "metadata": {
    "type": "funfact"
  },
  "main_version": {
    "statement": "<p>Prendre un nombre entier positif. Inverser les chiffres pour obtenir un nouveau nombre. Ajouter ces deux nombres ensemble. Répétez cette procédure jusqu'à obtenir un palindrome (un nombre qui se lit le même en avant et en arrière).</p>\n<p>Pouvez-vous trouver un numéro initiel qui ne se retrouve jamais à un palindrome? Personne ne sait si c'est possible.</p>",
    "hint": "<p>Prenez un nombre entier positif, par exemple 57. Inverser les chiffres pour obtenir 75. La somme donne 57 +75 = 132, puis inversez ce nouveau nombre et ajoutez les ensemble. Vous obtenez 132 + 231 = 353. C'est un palindrome car il lit le même en avant qu'en arrière, donc nous pouvons arrêter. Pouvez-vous trouver un nombre qui prend plus de temps pour atteindre un palindrome? </p>",
    "explanation": "<p>Certains nombres se retrouvent comme palindrome après une seule étape, par exemple 243: 243 + 342 = 585. Certains prennent un peu plus de temps, par exemple 87: </p>\n<p>87 + 78 = 165, </p>\n<p>165 + 561 = 726, </p>\n<p>726 + 627 = 1353, </p>\n<p>1353 + 3531 = 4884.</p>\n<p>Certains nombres prennent un très long temps : 89 prends 24 étapes, qui est inhabituellement grand (le plus grand que n'importe quel nombre moins de 10 000) pour atteindre le palindrome 8813200023188.</p>\n<p>Un nombre est appelé un nombre Lychrel s'il n'atteint jamais un palindrome. Personne n'a prouvé l'existence d'un seul nombre Lychrel. Une possibilité est 196 - les premiers milliards d'étapes ont été calculeés par des ordinateurs, et il n'a pas atteint un palindrome… mais cela ne prouve pas qu'il ne le sera jamais !</p>"
  },
  "extension_1": {
    "statement": "<p>Pouvez-vous trouver différents nombres à 3 chiffres qui prennent 1, 2, 3 et 4 étapes pour devenir un palindrome?</p>",
    "hint": "<p>La plupart des plus petits nombres à 3 chiffres ne prennent qu'une seule étape pour devenir un palindrome, mais essayez d'utiliser des chiffres plus grand qui signifieront que vous devrez retenir et monter le un lorsque vous faites la somme (e. . 8 + 9 = 17 donc vous devrez porter le 1).</p>",
    "explanation": "<p>Il y a beaucoup d'options, mais 122 prend 1 étape, 109 prend 2 étapes, 199 fait 3 étapes et 192 en prend 4.</p>"
  },
  "additional_information": {
    "about": "<p>Si vous changez la base du problème en binaire, alors 10110 (22 en décimal) est un nombre Lychrel. Le nom Lychrel vient d'un anagramme de la petite amie de Wade Van Landingham, Cheryl.</p>",
    "references": [
      "<p><a href=\"https://lycee.samicharity.co.uk/2020/02/06/lychrel-numbers/\" target=\"_blank\">https://lycee.samicharity.co.uk/2020/02/06/lychrel-numbers/</a></p>",
      "<p><a href=\"https://en.wikipedia.org/wiki/Lychrel_number#196_palindrome_quest\" target=\"_blank\">https://en.wikipedia.org/wiki/Lychrel_number#196_palindrome_quest</a></p>",
      "<p><a href=\"http://datagenetics.com/blog/october12015/index.html\" target=\"_blank\">http://datagenetics.com/blog/october12015/index.html</a></p>"
    ]
  }
}