{
  "title": "Going to School",
  "metadata": {
    "type": "counting"
  },
  "main_version": {
    "statement": "<p>Start from home (H) and go to school (S). You can walk along the 2 by 5 grid by making steps only towards east or north. How many different paths can you take to reach your school?</p>\n<p><img alt=\"\" src=\"assets/images/Going_to_School_image_0.png\" class=\"Going_to_School_image_0\" /></p>",
    "correct_answer": "21",
    "hint": "<p>What is the total number of steps you have to make? Think about when you could make the two steps north.\nYou could first try to find the answer if the grid was 2 by 3 and 2 by 4.</p>",
    "explanation": "<p>First of all, we can realise that, in order to get to school, you need to do a total of 2 steps north and 5 steps east. If we think about the sequence of 2 + 5 = 7 steps (S1, S2, S3, S4, S5, S6, and S7), then the problem is equivalent to counting how many ways you select 2 objects (the positions of the two steps towards north) from a total of 7 objects (the total number of positions of the steps). There are 7 possibilities to select the position for the first step towards north; then there are 7 - 1 = 6 possibilities to select the position of the second step towards north (\"-1\" because one position has already been selected), therefore you get 6×7 = 42. However, the order in which you selected the 2 positions of the steps towards north does not matter: you need to divide by 2, to give the final answer of 21.</p>\n<p>Alternatively, we could look at smaller examples first.</p>\n<p>Let N be one step north and E be one step east. </p>\n<p>For a 2 by 2 grid we could have NNEE, NENE, NEEN, ENNE, ENEN, EENN  (6 ways)</p>\n<p>For a 2 by 3 grid we need an extra move east. We could add an E onto all the options above. We would then just be missing all the routes that had N as the last move. There are 4 of these, corresponding to the other N in each one of the first four positions.</p>\n<p>NNEE(E), NENE(E), NEEN(E), ENNE(E), ENEN(E), EENN(E) (6 ways) plus NEEEN, ENEEN, EENEN, EEENN (4 ways) = 10 ways</p>\n<p>For a 2 by 4 grid there are 10 + 5 = 15 ways</p>\n<p>For a 2 by 5 grid there are 15 + 6 = 21 ways</p>\n<p>In general, by counting from small examples, we can see that each time you increase by one the number n of total steps (while keeping the number of steps towards north to 2), the number of ways you can go to school increases by n - 1. This is because you have already counted the ways the steps towards north can be in all the previous positions from 1 to n - 1. Therefore you just need to add the possibility that the two steps towards north are in the position n and any other of the n - 1 remaining ones. </p>"
  },
  "extension_1": {
    "statement": "<p>In how many ways could you reach your school if it were further away in the top right of a 2 by 10 grid? </p>",
    "hint": "<p>Think about the strategy you used to answer the previous question and try to generalise in the case the school is in the top right (north-east) of a 2 by n grid. </p>",
    "correct_answer": "66",
    "explanation": "<p>You can come up with a formula generalising the reasoning in the previous part: there are n+2 possibilities to select the position for the first step towards north; then there are n+1 possibilities to select the position of the second step towards north (1 less because one position has already been selected), therefore you get (n + 2)×(n + 1). However, the order in which you selected the 2 positions of the steps towards north does not matter: you then need to divide by 2.</p>\n<p>Alternatively, generalising what you found earlier, you might come up with the rule that for a 2×n grid you have 1 + 2 + ... + (n + 1) possible paths to school. There is a quick way of adding these numbers together - it is (n + 1)×(n + 2) ∕ 2. </p>\n<p>So we can calculate the answer for a 2 by 10 grid by doing 12×11 ∕ 2 = 66. </p>"
  },
  "extension_2": {
    "statement": "<p>In how many ways could you reach your school if it were in the top right of a 4 by 5 grid? </p>",
    "hint": "<p>Think about how many ways there are to go the four steps north. Be careful not to count the same paths too many times.</p>",
    "correct_answer": "126",
    "explanation": "<p>We need to take four steps north and 5 steps east. One way to do this would be in the sequence NNNNEEEEE. We need to find all the different ways. Consider the position of the four steps north. Let's call them N₁, N₂, N₃, and N₄. N₁ could be in any one of 9 positions, then N₂ could go in any of the 8 that are left, then N₃ is one of the remaining 7 and finally N₄ in one of the remaining 6. This would give us 9×8×7×6 = 3024 ways. But we actually don't want to distinguish between the four north steps. N₁N₂N₃N₄EEEEE is the same as N₂N₁N₃N₄EEEEE for example. So the 126 has included all the different ways the N₁ up to N₄ could be arranged. We now need to work out how many ways this is. The N₁ could be in one of four positions, the N₂ then in one of three, the N₃ in one of two and the N₄ in the one left. This gives us 4×3×2×1 = 24 ways. So we overcounted by a factor of 24. The final answer is 3024 ∕ 24 = 126. </p>"
  },
  "additional_information": {
    "about": "<p>This puzzle is all about finding the number of ways of choosing r items from a choice of n items when the order doesn't matter. The mathematical word for this is <strong>combinations</strong>, and there is a formula for finding them: ⁿCᵣ = n! ∕ (r!×(n - r)!)</p>\n<p>In this formula n! = n×(n - 1)×(n - 2)×...×1.</p>",
    "references": [
      "<p><a href=\"https://www.mathsisfun.com/combinatorics/combinations-permutations.html\" target=\"_blank\">https://www.mathsisfun.com/combinatorics/combinations-permutations.html</a></p>"
    ]
  }
}