{
  "title": "Patience",
  "metadata": {
    "type": "game"
  },
  "main_version": {
    "statement": "<p>This is a one player game of patience. Lay out a grid of 8 cards in 2 rows of 4 cards, face up and hold the remaining cards. If you find two cards in the grid that sum to 11 you can put new cards from your hand on top of them (here A = 1). If you find the J, Q or K cards you can also put a new card on top of each. The objective of the game is to put down all the cards. </p>",
    "further_instructions": "<p>Remove the Jokers before starting. A has a value of 1 in this game. If you manage to play all your cards, the last stage of the game is to pick up pairs of piles of cards whose top cards add up to 11, or three piles whose top cards are J, Q, K. You have won the game if you can pick up all the cards. If you can't put down all your cards, count how many are left</p>",
    "strategy_tips": "<p>This game is mostly luck - but you need to think carefully about how many J, Q and K you cover to win the final stage!</p>"
  },
  "extension_1": {
    "statement": "<p>A similar game uses 10 cards face up and you have to remove pairs that add up to 13 (A = 1, J = 11, Q = 12, and K=13). The K can be removed on its own. Each time you remove cards you replace them with new ones. The aim is to finish playing all the cards in the deck. </p>\n<p>You could make up your own version of this type of game by choosing the number to sum to, how many cards are face up to start with and what to do with the face cards. Can you design a game that can be won about half of the time?</p>"
  },
  "additional_information": {
    "about": "<p>These types of games are often called Patience or Solitaire. Patience because you need a lot of patience to try and win, and Solitaire because you can play them on your own. Although many variations of Patience are down to chance, it is interesting to use mathematics to analyse the probability of winning.</p>",
    "references": [
      "<p><a href=\"https://nrich.maths.org/1194\" target=\"_blank\">https://nrich.maths.org/1194</a></p>",
      "<p><a href=\"https://www.solsuite.com/games/elevens.htm\" target=\"_blank\">https://www.solsuite.com/games/elevens.htm</a></p>"
    ]
  }
}