{
  "title": "Honey Bees",
  "metadata": {
    "type": "puzzle"
  },
  "main_version": {
    "statement": "<p>One gallon of honey provides fuel for one bee to fly for seven million miles.</p>\n<p>How many bees could fly one thousand miles if they had ten gallons of honey?</p>",
    "correct_answer": "70000 ",
    "hint": "<p>How far can one bee travel with ten gallons of honey?</p>",
    "explanation": "<p>10 gallons would allow one bee to travel for 70 million miles. 70000000 ∕ 1000 = 70000 so 70000 bees could travel 1000 miles each.</p>"
  },
  "extension_1": {
    "statement": "<p>Now suppose 4 bees can each travel 6 million miles on 2 gallons of honey. How far could 8 bees each travel with 6 gallons of honey?</p>",
    "hint": "<p>How far can one bee can travel on 1 gallon of honey?</p>",
    "correct_answer": "9000000",
    "explanation": "<p>½×6000000×4 = 12000000. This is the number of miles one bee can travel on 1 gallon of honey. To find the answer, you can multiply this by 6 to find the total number of miles one bee can travel on 6 gallons of honey and then divide by 8 to find the distance per bee. The answer is 12000000×6 ∕ 8 = 9000000.</p>"
  },
  "extension_2": {
    "statement": "<p>A worker bee can make a hive of hexagons in 60 minutes, and a queen bee can make the same size hive in 40 minutes. How many minutes will it take them if they do it together?</p>",
    "hint": "<p>It might be easier to choose a number of hexagons to work with - try 120 and work out how many they can each do per minute.</p>",
    "correct_answer": "24",
    "explanation": "<p>We can see this with an example with the number of hexagons in the hive. If there are 120 hexagons, then the worker bee makes 2 per minute and the queen bee makes 3 per minute. So together they make 5 per minute. 120 ∕ 5 = 24 . </p>\n<p>The same argument works for any number of hexagons in a hive. Take the total number of hexagons as h. The worker bee will be working at a rate of (h  ∕ 60) hexagons per minute, and the queen bee at a rate of (h  ∕ 40) per minute. By simply adding the rates together, </p>\n<p>(h  ∕ 60) + (h  ∕ 40) = 100×h  ∕ 2400 = h ∕ 24, we can find the answer, 24 minutes. </p>"
  },
  "additional_information": {
    "about": "<p>Problems such as \"If A people can dig a trench in B<strong> </strong>days, then how long will it take C<strong> </strong>people to dig the trench?\" can be solved by calculating (A×B  ∕ C). This ancient technique is called \"the rule of three\" and was written about in a nursery rhyme in 1570: <strong> \"</strong>Multiplication is vexation;</p>\n<p>Division is as bad; The Rule of Three doth puzzle me, And Practice drives me mad.\"</p>",
    "references": [
      "<p><a href=\"https://nrich.maths.org/5668\" target=\"_blank\">https://nrich.maths.org/5668</a></p>",
      "<p><a href=\"https://en.wikipedia.org/wiki/Cross-multiplication#Rule_of_Three\" target=\"_blank\">https://en.wikipedia.org/wiki/Cross-multiplication#Rule_of_Three</a></p>"
    ]
  }
}