{
  "title": "Avoid the River",
  "metadata": {
    "type": "counting"
  },
  "main_version": {
    "statement": "<p>Start from home (H) and go to school (S). You can walk along the 4 by 4 grid by making steps only towards east or north. You cannot cross the river (blue line)! In how many ways can you reach your school?</p>\n<p><img alt=\"\" src=\"assets/images/Avoid_the_River_image_0.png\" class=\"Avoid_the_River_image_0\" /></p>",
    "correct_answer": "14",
    "hint": "<p>In how many ways you can go from home to school in a 2 by 2 grid? What about in a 3 by 3 grid?</p>",
    "explanation": "<p>This is not an easy combinatorial problem. It is better to start with a simpler version and familiarise with the problem. It is indeed intuitive to find the result for 2 by 2 grid: there are indeed only 2 possible ways. As far as the 3 by 3 case is concerned, students might easily draw all 5 ways explicitly. However, when it comes to the 4 by 4 case, it is easy to lose the count. Therefore the problem aims at making students think how to tackle this counting in a more systematic way. In particular, students should think whether they can decompose their counting in a way they can employ results known for a lower number of people. They may notice for example that the result for a 3 by 3 grid is: 2 + 1 + 2 = 5, 2 is the result for a 2 by 2 grid. Moreover, the result for a 4 by 4 grid is 5 + 2 + 2 + 5 = 14, where 2 is the result for a 2 by 2 and 5 is the result for a 3 by 3 grid.</p>"
  },
  "extension_1": {
    "statement": "<p>In how many ways you can go from home to school in a 5 by 5 grid? Try using previous results to compute this!</p>",
    "hint": "<p>Counting explicitly might be too long. Can you come up with a way to reduce the problem in simpler cases you have already counted? Focus on when a path last touches the river before reaching the school. Do you know anything about all possible paths that can reach that point? What about all possible paths after that point? </p>",
    "correct_answer": "42",
    "explanation": "<p>This part is aimed at finding a recursive way to solve the problem. It might not be easy. \nLet us number the points in which the paths might intersect the river from 1 to 6 starting from home to school. Let us focus our attention on the paths which last touch the river in point 6: these are all paths (so not useful); let us consider all paths that last touch the river in point 5. The bottom part of the problem is equivalent to counting all paths from home up to point 5 (such that they do not cross the river), these are exactly the one counted in a 4 by 4 grid previously: there are 14. For the top part, there is only one way to reach school from point 5. Therefore we have 14×1 = 14 paths that touch the river in point 5 for the last time before reaching school. Now let us consider the number of paths that last touches the river in point 4. The bottom part of the problem is equivalent to counting all paths from home up to point 4 (such that they do not cross the river), these are exactly the one counted in a 3 by 3 grid previously: there are 5. Starting from point 4 there is now only one way to reach school without touching the river again. Therefore we have a total of 5×1 = 5 paths.\nNow let us consider the number of paths that last touches the river in point 3. The bottom part of the problem is equivalent to counting all paths from home up to point 3 (such that they do not cross the river), these are exactly the one counted in a 2 by 2 grid previously: there are 2. Starting from point 3, you need to move one step east. From here, you can not go north (otherwise you touch the river), but can only go East again. From here you can go one step East or one step North, but not two steps North (otherwise you would touch the river). And so on. You might realise you are solving the problem for a 2 by 2 grid whose bottom left corner is the point one step East to point 3 and the top right corner one step south the point 6. Therefore you have 2 paths. \nIn total you have 2×2 = 4 paths which last touch the river in the point 3. You then continue by considering the number of paths that last touch the river in point 2. You realise that you split the problem in the one for a 1 by 1 grid and for a 3 by 3 grid (whose bottom left corner is the point at one step East to point 2 and the top right corner one step south the point 6). Therefore we have in total 1×5 paths. Finally the number of paths which last touch the river in point 1 (i.e. only touch the river in point 1) are the same as the paths for the problem with 4 by 4 grid (whose bottom left corner is the point at one step East to point 1 and the top right corner one step south the point 6). Therefore we have 14 paths.\nWe covered all possible paths which do not cross the river. In total they add up as: 14 + 1×5 + 2×2 + 5×1 + 14 = 42.</p>\n<p>You might be able now to find a recursion relation for the number Cₙ of east and north paths in an n by n grid which do not cross the diagonal. Generalising what you did before we have that:\nCₙ = Cₙ₋₁ + C₁×Cₙ₋₂ + C₂×Cₙ₋₃ + … + Cₙ₋₂×C₁ + Cₙ₋₁</p>\n<p>The iᵗʰ summand corresponds to the number of paths which last touch the diagonal at the point i, (where i is a number from 1 to n). </p>"
  },
  "extension_2": {
    "statement": "<p>What if the grid has the size of 7 by 7? Try to use previous results to calculate the number of ways you can go to school in this grid. </p>",
    "hint": "<p>You will need to first find the result for a 6 by 6 grid so that you can use this (and all your previous answers) to find the answer for a 7 by 7 grid.</p>",
    "correct_answer": "429",
    "explanation": "<p>We already calculated C₄ = C₃ + C₁×C₂ + C₂×C₁ + C₃ = 5 + 1×2 +2×1 + 5 = 14</p>\n<p>and C₅ = 42</p>\n<p>We can carry on this pattern to give</p>\n<p>C₆ = C₅ +C₁×C₄ + C₂×C₃ +…+ C₅= 132</p>\n<p>Likewise, we calculate C₇ = 429</p>"
  },
  "additional_information": {
    "about": "<p>Cₙ are called <em>Catalan numbers</em> and they are crucial in the world of combinatorics. There is an explicit formula for them, but finding it goes much beyond our scopes: the recursive definition we find out in this puzzle is more than enough for now!</p>",
    "references": [
      "<p><a href=\"https://en.wikipedia.org/wiki/Catalan_number\" target=\"_blank\">https://en.wikipedia.org/wiki/Catalan_number</a></p>"
    ]
  }
}