{
  "title": "Newspaper",
  "metadata": {
    "type": "puzzle"
  },
  "main_version": {
    "statement": "<p>Below is a single sheet from a newspaper. Given that each sheet has four pages, how many sheets are there altogether?</p>\n<p><img alt=\"\" src=\"assets/images/Newspaper_image_0.png\" class=\"Newspaper_image_0\" /></p>",
    "correct_answer": "17",
    "hint": "<p>Can you work backwards from 8 to work out how many sheets would be underneath this one? You might want to use bits of paper and number them to help.</p>",
    "explanation": "<p>On the back of the number 8 there must be the number 7. The sheet below must have the numbers 6 and 5. Keeping going there will be 4 and 3 and finally 2 and 1. So there are three sheets underneath. Adding on 7 to the 61 gives the last page as 68. Given each sheet has four pages, there are 68 ∕ 4 = 17 sheets.</p>"
  },
  "extension_1": {
    "statement": "<p>If it takes 852 digits to number all the pages of a book, in the usual order, what is the number on the last page of the book?</p>",
    "hint": "<p>How many 1 digit numbers are there? How many 2 digit numbers?</p>",
    "correct_answer": "320",
    "explanation": "<p>There are 9 one-digit numbers (the numbers 1 - 9), 90 two-digit numbers (the numbers 10 - 99) and 900 three-digits numbers (the numbers 100 - 999). Altogether this would make 9×1 + 90×2 + 900×3 = 9 + 180 + 2700 = 2889 digits, so the number of pages is less than 999. There are 852 - 9 - 180 = 663 digits used in three digit numbers. 663 ∕ 3 = 221, so there are 221 pages with three digit numbers. 99 + 221 = 320 gives us the answer.  </p>"
  },
  "extension_2": {
    "statement": "<p>Numbering the pages of a book requires printing 200 nines. What is the minimum number of pages the book could have?</p>",
    "hint": "<p>How many 9s are there in the first 100 numbers?</p>",
    "correct_answer": "918",
    "explanation": "<p>Think about the numbers under 100 first. There are 10 numbers ending in 9, and 10 numbers having 9 as their upper digit (90‒99), making for a total of 20 9s. In the same way, we have 20 9s between 100 and 199, and between 200 and 299, etc. So we get 9×20 = 180 9s up to 899. We need 20 more to reach 200 9s. From 900‒999, every number has a 9 at the beginning. Because 909 has two 9s, we get the last 20 9s from the numbers from 900‒918.</p>"
  },
  "additional_information": {
    "about": "<p>You can try this puzzle with a real newspaper - take out one of the sheets and look at the numbers on it. Work out how many sheets there should be and then see if you are correct. </p>",
    "references": [
      "<p><a href=\"https://nrich.maths.org/7180\" target=\"_blank\">https://nrich.maths.org/7180</a></p>"
    ]
  }
}