{
  "title": "Table Handshakes",
  "metadata": {
    "type": "counting"
  },
  "main_version": {
    "statement": "<p>If 8 people are seated around a circular table, in how many ways can all of them be simultaneously shaking hands with one other person at the table in such a way that none of the arms cross each other? (They have very long arms).</p>",
    "correct_answer": "14",
    "hint": "<p>What is the answer if there are just 2 people, or 4 people, or 6 people. Can you find a way of making the cases with fewer people help you count the cases with more people?</p>",
    "explanation": "<p>For the case with 2 people there is just 1 way: </p>\n<p><img alt=\"\" src=\"assets/images/Table_Handshakes_image_0.png\" class=\"Table_Handshakes_image_0\" /></p>\n<p>For 4 people there are 2 ways:</p>\n<p><img alt=\"\" src=\"assets/images/Table_Handshakes_image_1.png\" class=\"Table_Handshakes_image_1\" /><img alt=\"\" src=\"assets/images/Table_Handshakes_image_2.png\" class=\"Table_Handshakes_image_2\" /></p>\n<p>For 6 people, we can consider the options for who number 1 shakes hands with. Number 1 cannot shake hands with number 3 or 5 as that would leave someone cut off from the group. If number 1 shakes hands with number 2 like this:</p>\n<p><img alt=\"\" src=\"assets/images/Table_Handshakes_image_3.png\" class=\"Table_Handshakes_image_3\" /></p>\n<p>Then we know that the other four people can shake hands in 2 different ways (using our result from before). Number 1 could shake hands with number 6 and there would also be 2 different ways for the other four to shake hands. Finally number 1 could shake hands with number 4, and that would just leave one option:</p>\n<p><img alt=\"\" src=\"assets/images/Table_Handshakes_image_4.png\" class=\"Table_Handshakes_image_4\" /></p>\n<p>So the result for 6 people is: 5 = 2 + 1 + 2.</p>\n<p>For eight people number 1 could shake hands with number 2 (leaving a group of 6 people which we now know there are 5 ways to shake hands), number 4 (leaving a group of 4, so 2 ways) number 6 (leaving a group of 4, so 2 ways) or number 6 (leaving a group of 6 so 5 ways). So the answer for eight people is 5 + 2 + 2 + 5.</p>"
  },
  "extension_1": {
    "statement": "<p>What if we have 10 people at the table? It may be useful to use previous results to help you!</p>",
    "hint": "<p>Counting explicitly might be too long. Can you come up with a way to reduce the problem in simpler cases you have already counted? Focus on when a fixed person shakes hands with another one: the problem splits into a left part and a right part where a lower number of people have to shake their hands.</p>",
    "correct_answer": "42",
    "explanation": "<p>Let us number people from 1 to 10 counter-clockwise. Let us focus our attention on a fixed person, say person 1. When person 1 shakes hands with person number 2 there are 10 - 2 = 8 people on their left that have to shake hands. For them this is the problem we had before, with 8 people at the table they can shake hands in 14 different ways. Now imagine person 1 wants to shake hands with person 3: this would leave person 2 alone, since every attempt of the latter to shake hands with others would cross the handshaking of people 1 and 3. Therefore person 1 has to skip person 3 and shake hands with person 4. On their right they have people 2 and 3 who can only shake hands themselves in one way, whereas on their left they have 10 - 2 - 2 = 6 people who can shake hands in 5 ways (as calculated before), therefore we have 1×5 = 5 possibility in this case. Let us now consider people 1 and 5: there will be a person among people 2, 3, 4 who will remain alone, therefore person 1 has to move to person 6. In this case we will have 4 people on the right (people 2, 3, 4, 5) and four people on the left (people 7, 8, 9, 10). Each group can independently shake hands in 2 ways, therefore the total is 2×2 = 4. We continue with person 1 shaking hands with person 8 (obtaining 1×5 = 5 ways) and then with person 10 (obtaining 14 ways). We have exhausted all possible ways person 1 can shake hands, therefore above we have covered all possible cases, which add up to: 14 + 1×5 + 2×2 + 5×1 + 14 = 42.</p>\n<p>Thinking about the problem in this way leads to a formula to calculate the number of handshakes Hₙ where n is the (even) number of people at the table:</p>\n<p>Hₙ = Hₙ₋₂ + H₂×Hₙ₋₄ + H₄×Hₙ₋₆ + … + Hₙ₋₄×H₂ + Hₙ₋₂</p>\n<p>For example, for 10 people at the table:</p>\n<p>H₁₀ = H₈ + H₂×H₆+ H₄×H₄ + H₆×H₂ + H₈ = 14 + 1×5 + 2×2 + 5×1 + 14 = 42</p>"
  },
  "extension_2": {
    "statement": "<p>What if we have 14 people at the table? Can you use previous results to calculate the number of ways they can shake hands? </p>",
    "hint": "<p>You will need to first find the result for 12 people so that you can use this (and all your previous answers) to find the answer for 14.</p>",
    "correct_answer": "429",
    "explanation": "<p>Let Hₙ be the number of ways n people shake hands. In the previous solutions we have calculated the numbers H₂, H₄,  H₆, H₈, and H₁₀. We know the formula for 14 people requires us to calculate for 12 people first. We therefore calculate</p>\n<p>H₁₂ = H₁₀ + H₂×H₈ + … + H₈×H₂ + H₁₀ = 132</p>\n<p>And likewise we can then calculate H₁₄ = 429.</p>"
  },
  "additional_information": {
    "about": "<p>The sequence of numbers we have discovered 1, 2, 5, 14, 42, ... are called <em>Catalan numbers</em> and they are crucial in the world of combinatorics. There is evidence of their use in China as far back as 1730, but they are named after the Belgian mathematician Eugène Charles Catalan (1814–1894).</p>",
    "references": [
      "<p><a href=\"https://en.wikipedia.org/wiki/Catalan_number\" target=\"_blank\">https://en.wikipedia.org/wiki/Catalan_number</a></p>"
    ]
  }
}