{
  "title": "Birthday Probability",
  "metadata": {
    "type": "funfact"
  },
  "main_version": {
    "statement": "<p>In a room with 23 people the probability that two people have the same birthday is more than 50%.</p>",
    "hint": "<p>The probability that two people have the same birthday is just 1 minus the probability of everyone's birthday being different.</p>\n<p>You should ask yourself the following questions:</p>\n<p>If we only have 2 people what is the probability their birthday is different? </p>\n<p>If we had 5 people, in how many ways can we select two to compare their birthdays?</p>\n<p>What do we get if we use the same approach for 23 people?</p>",
    "explanation": "<p>The probability of any 2 people having different birthdays is roughly 364 ∕ 365. There are 253 different pairs of people in a room of 23 people, so the probability of them all having different birthdays is roughly 364 ∕ 365 to the power 253. This is 0.4995 slightly less than 50% so the probability of having 2 people in the room with the same birthday is just over 50%. Actually we should be including leap years but the result is still true if you do.</p>"
  },
  "extension_1": {
    "statement": "<p>If there are 50 people in a room, what is the chance that two people share a birthday?</p>",
    "hint": "<p>Think about these questions: </p>\n<p>How many possible pairs of people are there with 50 people in the room? </p>\n<p>What is the chance that every pair of people have different birthdays to each other?</p>",
    "explanation": "<p>The number of pairs of people are 50x49 ∕ 2 = 1225. Chance of a unique pair is 364 ∕ 365. Chance of 1225 unique pairs is (364 ∕ 365)¹²²⁵ = 0.0347. Chance of at least one match is 1 - 0.0347 = 0.9653, which is 96.53%. So, incredibly likely!</p>"
  },
  "additional_information": {
    "about": "<p>This problem is not a paradox but it is counter-intuitive. The number of people needed seems surprisingly small, perhaps because we imagine ourselves as one of the people in the room and think of only 22 possibilities for a match, rather than thinking of the 253 different pairs of people in the room. </p>\n<p>You can extend the birthday problem - you would only need 88 people to have a greater than 50% chance of 3 people sharing a birthday.</p>\n<p>Have you experienced a surprising coincidence in your life? </p>\n<p>Coincidences like meeting someone with exactly the same birthday as you are unlikely events on their own. However, as with the birthday problem, the number of events can increase exponentially meaning that in a group or over time it is more likely to have coincidences than not!</p>\n<p>If you haven't had a coincidence yet don't worry. If you keep looking it's unlikely that nothing unlikely will ever happen to you! </p>",
    "references": [
      "<p><a href=\"https://betterexplained.com/articles/understanding-the-birthday-paradox/\" target=\"_blank\">https://betterexplained.com/articles/understanding-the-birthday-paradox/</a></p>",
      "<p><a href=\"https://oeis.org/A014088\" target=\"_blank\">https://oeis.org/A014088</a></p>"
    ]
  }
}