{
  "title": "Card Sums",
  "metadata": {
    "type": "game"
  },
  "main_version": {
    "statement": "<p>Remove the 10, J, Q, K, and Joker cards and shuffle the rest of the pack.</p>\n<p><img alt=\"\" src=\"assets/images/Card_Sums_image_0.png\" class=\"Card_Sums_image_0\" /></p>\n<p>Any number of players can play. Deal 6 cards face up on a table. Everyone has 1 minute to decide how to set them out in the layout above to make the biggest total of the two multiplications. A counts as 1. The player with the highest score wins.</p>",
    "further_instructions": "<p>It might help if everyone has pen and paper. After one minute, everyone says their highest total. The person who says the highest number explains how they came to that number, by arranging the cards. If they are correct they win a point, if incorrect, the person with the next highest total attempts to justify their answer. If two people have the same answer they get a point each.</p>",
    "strategy_tips": "<p>Think about where it is going to be best to place the biggest numbers.</p>"
  },
  "extension_1": {
    "statement": "<p>With the J, Q, K, and Joker cards removed, deal 4 cards to each player. Each player has to make two fractions with their cards which can be added, subtracted, multiplied or divided to try to make the answer as close to 1 as possible. Anyone who can make 1 exactly gets 2 points. If no one can make 1 then the closest to 1 gets 1 point.</p>"
  },
  "additional_information": {
    "about": "<p>These games feature in Andrew Jeffrey's Leader of the Pack book - which has 52 games and activities to do with a deck of cards. There is a perfect strategy to the main game. </p>",
    "references": [
      "<p><a href=\"http://andrewjeffrey.co.uk/product/leader-of-the-pack/\" target=\"_blank\">http://andrewjeffrey.co.uk/product/leader-of-the-pack/</a></p>",
      "<p><a href=\"https://www.jennettspark.bracknell-forest.sch.uk/wp-content/uploads/2020/04/52-Card-Activities-for-Mathematics.pdf\" target=\"_blank\">https://www.jennettspark.bracknell-forest.sch.uk/wp-content/uploads/2020/04/52-Card-Activities-for-Mathematics.pdf</a></p>"
    ]
  }
}